package com.common.config.handicap;
import com.google.common.collect.ImmutableMap;

import java.util.Map;

/**
 * 盘口球类
 * @Author: Dongming
 * @Date: 2020-06-06 15:59
 * @Email: job.dongming@foxmail.com
 * @Version: v1.0
 */
public interface BallConfig {
	/**
	 * 投注限额
	 */
	Map<String, String> ITEM_TYPE = ImmutableMap.<String, String>builder().put("第一球|0", "0").put("第一球|1", "0")
			.put("第一球|2", "0").put("第一球|3", "0").put("第一球|4", "0").put("第一球|5", "0").put("第一球|6", "0").put("第一球|7", "0")
			.put("第一球|8", "0").put("第一球|9", "0").put("第一球|大", "1").put("第一球|小", "1").put("第一球|单", "1").put("第一球|双", "1")

			.put("第二球|0", "0").put("第二球|1", "0").put("第二球|2", "0").put("第二球|3", "0").put("第二球|4", "0").put("第二球|5", "0")
			.put("第二球|6", "0").put("第二球|7", "0").put("第二球|8", "0").put("第二球|9", "0").put("第二球|大", "1").put("第二球|小", "1")
			.put("第二球|单", "1").put("第二球|双", "1")

			.put("第三球|0", "0").put("第三球|1", "0").put("第三球|2", "0").put("第三球|3", "0").put("第三球|4", "0").put("第三球|5", "0")
			.put("第三球|6", "0").put("第三球|7", "0").put("第三球|8", "0").put("第三球|9", "0").put("第三球|大", "1").put("第三球|小", "1")
			.put("第三球|单", "1").put("第三球|双", "1")

			.put("第四球|0", "0").put("第四球|1", "0").put("第四球|2", "0").put("第四球|3", "0").put("第四球|4", "0").put("第四球|5", "0")
			.put("第四球|6", "0").put("第四球|7", "0").put("第四球|8", "0").put("第四球|9", "0").put("第四球|大", "1").put("第四球|小", "1")
			.put("第四球|单", "1").put("第四球|双", "1")

			.put("第五球|0", "0").put("第五球|1", "0").put("第五球|2", "0").put("第五球|3", "0").put("第五球|4", "0").put("第五球|5", "0")
			.put("第五球|6", "0").put("第五球|7", "0").put("第五球|8", "0").put("第五球|9", "0").put("第五球|大", "1").put("第五球|小", "1")
			.put("第五球|单", "1").put("第五球|双", "1")

			.put("总和|大", "7").put("总和|小", "7").put("总和|单", "7").put("总和|双", "7").put("龙虎和|龙", "8").put("龙虎和|虎", "8")
			.put("龙虎和|和", "8").put("前三|豹子", "2").put("中三|豹子", "2").put("后三|豹子", "2").put("前三|顺子", "3").put("中三|顺子", "3")
			.put("后三|顺子", "3").put("前三|对子", "4").put("中三|对子", "4").put("后三|对子", "4").put("前三|半顺", "5").put("中三|半顺", "5")
			.put("后三|半顺", "5").put("前三|杂六", "6").put("中三|杂六", "6").put("后三|杂六", "6").build();
}
