package com.common.config.handicap;
import com.google.common.collect.ImmutableMap;

import java.util.Map;

/**
 * COM 盘口 号码类玩法配置类
 * @Author: Dongming
 * @Date: 2020-06-10 10:57
 * @Email: job.dongming@foxmail.com
 * @Version: v1.0
 */
public interface ComNumberConfig extends ComConfig,NumberConfig {
	/**
	 * 游戏code
	 */
	Map<String, String> TYPE_CODE = ImmutableMap.<String, String>builder().put("dobleSides",
			"lmp").put("ballNO", "d1_10").put("sumDT", "12").build();
	Map<String, String> BET_TYPE = ImmutableMap.<String, String>builder().put("dobleSides",
			"2,3,4,6,7,8,10,11,12,14,15,16,18,19,20,22,23,25,26,28,29,31,32,34,35,37,38")
			.put("ballNO", "1,5,9,13,17,21,24,27,30,33").put("sumDT", "1,2,3,4,5,6,7,8,36,37,38").build();


	/**
	 * 所有球码code
	 */
	Map<String, String> ITEM_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "1_1")
			.put("第一名|2", "1_2").put("第一名|3", "1_3").put("第一名|4", "1_4").put("第一名|5", "1_5")
			.put("第一名|6", "1_6").put("第一名|7", "1_7").put("第一名|8", "1_8").put("第一名|9", "1_9")
			.put("第一名|10", "1_10").put("第一名|大", "2_11").put("第一名|小", "2_12").put("第一名|单", "3_13")
			.put("第一名|双", "3_14").put("第一名|龙", "4_15").put("第一名|虎", "4_16")

			.put("第二名|1", "5_17").put("第二名|2", "5_18").put("第二名|3", "5_19").put("第二名|4", "5_20")
			.put("第二名|5", "5_21").put("第二名|6", "5_22").put("第二名|7", "5_23").put("第二名|8", "5_24")
			.put("第二名|9", "5_25").put("第二名|10", "5_26").put("第二名|大", "6_27").put("第二名|小", "6_28")
			.put("第二名|单", "7_29").put("第二名|双", "7_30").put("第二名|龙", "8_31").put("第二名|虎", "8_32")

			.put("第三名|1", "9_33").put("第三名|2", "9_34").put("第三名|3", "9_35").put("第三名|4", "9_36")
			.put("第三名|5", "9_37").put("第三名|6", "9_38").put("第三名|7", "9_39").put("第三名|8", "9_40")
			.put("第三名|9", "9_41").put("第三名|10", "9_42").put("第三名|大", "10_43").put("第三名|小", "10_44")
			.put("第三名|单", "11_45").put("第三名|双", "11_46").put("第三名|龙", "12_47").put("第三名|虎", "12_48")

			.put("第四名|1", "13_49").put("第四名|2", "13_50").put("第四名|3", "13_51").put("第四名|4", "13_52")
			.put("第四名|5", "13_53").put("第四名|6", "13_54").put("第四名|7", "13_55").put("第四名|8", "13_56")
			.put("第四名|9", "13_57").put("第四名|10", "13_58").put("第四名|大", "14_59").put("第四名|小", "14_60")
			.put("第四名|单", "15_61").put("第四名|双", "15_62").put("第四名|龙", "16_63").put("第四名|虎", "16_64")

			.put("第五名|1", "17_65").put("第五名|2", "17_66").put("第五名|3", "17_67").put("第五名|4", "17_68")
			.put("第五名|5", "17_69").put("第五名|6", "17_70").put("第五名|7", "17_71").put("第五名|8", "17_72")
			.put("第五名|9", "17_73").put("第五名|10", "17_74").put("第五名|大", "18_75").put("第五名|小", "18_76")
			.put("第五名|单", "19_77").put("第五名|双", "19_78").put("第五名|龙", "20_79").put("第五名|虎", "20_80")

			.put("第六名|1", "21_81").put("第六名|2", "21_82").put("第六名|3", "21_83").put("第六名|4", "21_84")
			.put("第六名|5", "21_85").put("第六名|6", "21_86").put("第六名|7", "21_87").put("第六名|8", "21_88")
			.put("第六名|9", "21_89").put("第六名|10", "21_90").put("第六名|大", "22_91").put("第六名|小", "22_92")
			.put("第六名|单", "23_93").put("第六名|双", "23_94")

			.put("第七名|1", "24_95").put("第七名|2", "24_96").put("第七名|3", "24_97").put("第七名|4", "24_98")
			.put("第七名|5", "24_99").put("第七名|6", "24_100").put("第七名|7", "24_101").put("第七名|8", "24_102")
			.put("第七名|9", "24_103").put("第七名|10", "24_104").put("第七名|大", "25_105").put("第七名|小", "25_106")
			.put("第七名|单", "26_107").put("第七名|双", "26_108")

			.put("第八名|1", "27_109").put("第八名|2", "27_110").put("第八名|3", "27_111").put("第八名|4", "27_112")
			.put("第八名|5", "27_113").put("第八名|6", "27_114").put("第八名|7", "27_115").put("第八名|8", "27_116")
			.put("第八名|9", "27_117").put("第八名|10", "27_118").put("第八名|大", "28_119").put("第八名|小", "28_120")
			.put("第八名|单", "29_121").put("第八名|双", "29_122")

			.put("第九名|1", "30_123").put("第九名|2", "30_124").put("第九名|3", "30_125").put("第九名|4", "30_126")
			.put("第九名|5", "30_127").put("第九名|6", "30_128").put("第九名|7", "30_129").put("第九名|8", "30_130")
			.put("第九名|9", "30_131").put("第九名|10", "30_132").put("第九名|大", "31_133").put("第九名|小", "31_134")
			.put("第九名|单", "32_135").put("第九名|双", "32_136")

			.put("第十名|1", "33_137").put("第十名|2", "33_138").put("第十名|3", "33_139").put("第十名|4", "33_140")
			.put("第十名|5", "33_141").put("第十名|6", "33_142").put("第十名|7", "33_143").put("第十名|8", "33_144")
			.put("第十名|9", "33_145").put("第十名|10", "33_146").put("第十名|大", "34_147").put("第十名|小", "34_148")
			.put("第十名|单", "35_149").put("第十名|双", "35_150")

			.put("冠亚|3", "36_151").put("冠亚|4", "36_152").put("冠亚|5", "36_153").put("冠亚|6", "36_154")
			.put("冠亚|7", "36_155").put("冠亚|8", "36_156").put("冠亚|9", "36_157").put("冠亚|10", "36_158")
			.put("冠亚|11", "36_159").put("冠亚|12", "36_160").put("冠亚|13", "36_161").put("冠亚|14", "36_162")
			.put("冠亚|15", "36_163").put("冠亚|16", "36_164").put("冠亚|17", "36_165").put("冠亚|18", "36_166")
			.put("冠亚|19", "36_167").put("冠亚|大", "37_168").put("冠亚|小", "37_169").put("冠亚|单", "38_170")
			.put("冠亚|双", "38_171").build();

}
