package com.common.config.handicap;

import com.google.common.collect.ImmutableMap;

import java.util.Map;

/**
 * @Description:
 * @Author: wwj
 * @Date: 2019/12/30 11:27
 * @Email: 97085010@qq.com
 * @Version: v1.0
 */
public interface FcBallConfig {

    Map<String, String> GAME_TYPE_CODE = ImmutableMap.<String, String>builder().put("dobleSides",
            "lmp").put("ballNO", "d1_5").put("sumDT", "d1").build();

    Map<String,String> GAME_ODDS_ID = ImmutableMap.<String, String>builder().put("ballNO","1,4,7,10,13").
            put("dobleSides","2,3,5,6,8,9,11,12,14,15,16,17,18").put("threeBall","1,2,3,16,17,18,19,20,21").build();

    /**
     * 游戏code
     */
    Map<String, String> ITEM_CODE = ImmutableMap.<String, String>builder().put("第一球|0", "1").put("第一球|1", "2")
            .put("第一球|2", "3").put("第一球|3", "4").put("第一球|4", "5").put("第一球|5", "6")
            .put("第一球|6", "7").put("第一球|7", "8").put("第一球|8", "9").put("第一球|9", "10")
            .put("第一球|大", "11").put("第一球|小", "12").put("第一球|单", "13").put("第一球|双", "14")

            .put("第二球|0", "15").put("第二球|1", "16").put("第二球|2", "17").put("第二球|3", "18")
            .put("第二球|4", "19").put("第二球|5", "20").put("第二球|6", "21").put("第二球|7", "22")
            .put("第二球|8", "23").put("第二球|9", "24").put("第二球|大", "25").put("第二球|小", "26")
            .put("第二球|单", "27").put("第二球|双", "28")

            .put("第三球|0", "29").put("第三球|1", "30").put("第三球|2", "31").put("第三球|3", "32")
            .put("第三球|4", "33").put("第三球|5", "34").put("第三球|6", "35").put("第三球|7", "36")
            .put("第三球|8", "37").put("第三球|9", "38").put("第三球|大", "39").put("第三球|小", "40")
            .put("第三球|单", "41").put("第三球|双", "42")

            .put("第四球|0", "43").put("第四球|1", "44").put("第四球|2", "45").put("第四球|3", "46")
            .put("第四球|4", "47").put("第四球|5", "48").put("第四球|6", "49").put("第四球|7", "50")
            .put("第四球|8", "51").put("第四球|9", "52").put("第四球|大", "53").put("第四球|小", "54")
            .put("第四球|单", "55").put("第四球|双", "56")

            .put("第五球|0", "57").put("第五球|1", "58").put("第五球|2", "59").put("第五球|3", "60")
            .put("第五球|4", "61").put("第五球|5", "62").put("第五球|6", "63").put("第五球|7", "64")
            .put("第五球|8", "65").put("第五球|9", "66").put("第五球|大", "67").put("第五球|小", "68")
            .put("第五球|单", "69").put("第五球|双", "70")

            .put("总和|大", "71").put("总和|小", "72").put("总和|单", "73").put("总和|双", "74").put("龙虎和|龙", "75")
            .put("龙虎和|虎", "76").put("龙虎和|和", "77").put("前三|豹子", "78").put("前三|顺子", "79")
            .put("前三|对子", "80").put("前三|半顺", "81").put("前三|杂六", "82").put("中三|豹子", "83")
            .put("中三|顺子", "84").put("中三|对子", "85").put("中三|半顺", "86").put("中三|杂六", "87")
            .put("后三|豹子", "88").put("后三|顺子", "89").put("后三|对子", "90").put("后三|半顺", "91")
            .put("后三|杂六", "92").build();

    /**
     * 投注信息
     */
    Map<String, String> BET_INFO_CODE = ImmutableMap.<String, String>builder().put("第一球0", "第一球|0").put("第一球1", "第一球|1")
            .put("第一球2", "第一球|2").put("第一球3", "第一球|3").put("第一球4", "第一球|4").put("第一球5", "第一球|5")
            .put("第一球6", "第一球|6").put("第一球7", "第一球|7").put("第一球8", "第一球|8").put("第一球9", "第一球|9")
            .put("第一球單雙單", "第一球|单").put("第一球單雙雙", "第一球|双").put("第一球大小大", "第一球|大").put("第一球大小小", "第一球|小")

            .put("第二球0", "第二球|0").put("第二球1", "第二球|1").put("第二球2", "第二球|2").put("第二球3", "第二球|3")
            .put("第二球4", "第二球|4").put("第二球5", "第二球|5").put("第二球6", "第二球|6").put("第二球7", "第二球|7")
            .put("第二球8", "第二球|8").put("第二球9", "第二球|9").put("第二球單雙單", "第二球|单").put("第二球單雙雙", "第二球|双")
            .put("第二球大小大", "第二球|大").put("第二球大小小", "第二球|小")

            .put("第三球0", "第三球|0").put("第三球1", "第三球|1").put("第三球2", "第三球|2").put("第三球3", "第三球|3")
            .put("第三球4", "第三球|4").put("第三球5", "第三球|5").put("第三球6", "第三球|6").put("第三球7", "第三球|7")
            .put("第三球8", "第三球|8").put("第三球9", "第三球|9").put("第三球單雙單", "第三球|单").put("第三球單雙雙", "第三球|双")
            .put("第三球大小大", "第三球|大").put("第三球大小小", "第三球|小")

            .put("第四球0", "第四球|0").put("第四球1", "第四球|1").put("第四球2", "第四球|2").put("第四球3", "第四球|3")
            .put("第四球4", "第四球|4").put("第四球5", "第四球|5").put("第四球6", "第四球|6").put("第四球7", "第四球|7")
            .put("第四球8", "第四球|8").put("第四球9", "第四球|9").put("第四球單雙單", "第四球|单").put("第四球單雙雙", "第四球|双")
            .put("第四球大小大", "第四球|大").put("第四球大小小", "第四球|小")

            .put("第五球0", "第五球|0").put("第五球1", "第五球|1").put("第五球2", "第五球|2").put("第五球3", "第五球|3")
            .put("第五球4", "第五球|4").put("第五球5", "第五球|5").put("第五球6", "第五球|6").put("第五球7", "第五球|7")
            .put("第五球8", "第五球|8").put("第五球9", "第五球|9").put("第五球單雙單", "第五球|单").put("第五球單雙雙", "第五球|双")
            .put("第五球大小大", "第五球|大").put("第五球大小小", "第五球|小")

            .put("總和大小總和大", "总和|大").put("總和大小總和小", "总和|小").put("總和大小總和單", "总和|单").put("總和大小總雙", "总和|双")
            .put("龍虎龍", "龙虎和|龙").put("龍虎虎", "龙虎和|虎").put("龍虎和", "龙虎和|和")
            .put("前三豹子", "前三|豹子").put("中三豹子", "中三|豹子").put("后三豹子", "后三|豹子")
            .put("前三順子", "前三|顺子").put("中三順子", "中三|顺子").put("后三順子", "后三|顺子")
            .put("前三對子", "前三|对子").put("中三對子", "中三|对子").put("后三對子", "后三|对子")
            .put("前三半順", "前三|半顺").put("中三半順", "中三|半顺").put("后三半順", "后三|半顺")
            .put("前三雜六", "前三|杂六").put("中三雜六", "中三|杂六").put("后三雜六", "后三|杂六").build();

    /**
     * 限额信息
     */
    Map<String, String> BET_LIMIT_CODE = ImmutableMap.<String, String>builder().put("第一球|0", "00").put("第一球|1", "00")
            .put("第一球|2", "00").put("第一球|3", "00").put("第一球|4", "00").put("第一球|5", "00").put("第一球|6", "00")
            .put("第一球|7", "00").put("第一球|8", "00").put("第一球|9", "00").put("第一球|大", "01").put("第一球|小", "01")
            .put("第一球|单", "02").put("第一球|双", "02")

            .put("第二球|0", "00").put("第二球|1", "00").put("第二球|2", "00").put("第二球|3", "00").put("第二球|4", "00")
            .put("第二球|5", "00").put("第二球|6", "00").put("第二球|7", "00").put("第二球|8", "00").put("第二球|9", "00")
            .put("第二球|大", "01").put("第二球|小", "01").put("第二球|单", "02").put("第二球|双", "02")

            .put("第三球|0", "00").put("第三球|1", "00").put("第三球|2", "00").put("第三球|3", "00").put("第三球|4", "00")
            .put("第三球|5", "00").put("第三球|6", "00").put("第三球|7", "00").put("第三球|8", "00").put("第三球|9", "00")
            .put("第三球|大", "01").put("第三球|小", "01").put("第三球|单", "02").put("第三球|双", "02")

            .put("第四球|0", "00").put("第四球|1", "00").put("第四球|2", "00").put("第四球|3", "00").put("第四球|4", "00")
            .put("第四球|5", "00").put("第四球|6", "00").put("第四球|7", "00").put("第四球|8", "00").put("第四球|9", "00")
            .put("第四球|大", "01").put("第四球|小", "01").put("第四球|单", "02").put("第四球|双", "02")

            .put("第五球|0", "00").put("第五球|1", "00").put("第五球|2", "00").put("第五球|3", "00").put("第五球|4", "00")
            .put("第五球|5", "00").put("第五球|6", "00").put("第五球|7", "00").put("第五球|8", "00").put("第五球|9", "00")
            .put("第五球|大", "01").put("第五球|小", "01").put("第五球|单", "02").put("第五球|双", "02")

            .put("总和|大", "03").put("总和|小", "03").put("总和|单", "04").put("总和|双", "04")
            .put("龙虎和|龙", "05").put("龙虎和|虎", "05").put("龙虎和|和", "05")
            .put("前三|豹子", "06").put("中三|豹子", "07").put("后三|豹子", "08")
            .put("前三|顺子", "06").put("中三|顺子", "07").put("后三|顺子", "08")
            .put("前三|对子", "06").put("中三|对子", "07").put("后三|对子", "08")
            .put("前三|半顺", "06").put("中三|半顺", "07").put("后三|半顺", "08")
            .put("前三|杂六", "06").put("中三|杂六", "07").put("后三|杂六", "08").build();

}
