package com.common.config.handicap;

import com.google.common.collect.ImmutableMap;

import java.util.Map;

/**
 * @Description:
 * @Author: zjj
 * @Date: 2020-05-07 14:45
 * @Email: 543974681@qq.com
 * @Version: v1.0
 */
public interface FcHappyConfig extends ComConfig, HappyConfig {


	Map<String, String> GAME_TYPE_CODE = ImmutableMap.<String, String>builder().put("dobleSides",
			"lmp").put("ballNO", "d1_8").put("sumDT", "zhlh").build();

	/**
	 * 游戏code
	 */
	Map<String, String> GAME_ODDS_ID = ImmutableMap.<String, String>builder()
			.put("dobleSides","100,102,103,104,105,107,108,109,11,110,112,113,114,115,117,118,119,12,120,13,80,82,83,84,85,87,88,89,90,92,93,94,95,97,98,99")
			.put("ballNO", "81,86,91,96,101,106,111,116").put("sumDT","121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136").build();


	Map<String, String> ITEM_CODE = ImmutableMap.<String, String>builder().put("第一球|1", "1").put("第一球|2", "2")
			.put("第一球|3", "3").put("第一球|4", "4").put("第一球|5", "5").put("第一球|6", "6")
			.put("第一球|7", "7").put("第一球|8", "8").put("第一球|9", "9").put("第一球|10", "10")
			.put("第一球|11", "11").put("第一球|12", "12").put("第一球|13", "13").put("第一球|14", "14")
			.put("第一球|15", "15").put("第一球|16", "16").put("第一球|17", "17").put("第一球|18", "18")
			.put("第一球|19", "19").put("第一球|20", "20")

			.put("第一球|大", "21").put("第一球|小", "22").put("第一球|单", "23").put("第一球|双", "24")
			.put("第一球|合单", "25").put("第一球|合双", "26").put("第一球|尾大", "27").put("第一球|尾小", "28")
			.put("第一球|东", "251").put("第一球|南", "252").put("第一球|西", "253").put("第一球|北", "254")
			.put("第一球|中", "283").put("第一球|发", "284").put("第一球|白", "285")

			.put("第二球|1", "29").put("第二球|2", "30").put("第二球|3", "31").put("第二球|4", "32")
			.put("第二球|5", "33").put("第二球|6", "34").put("第二球|7", "35").put("第二球|8", "36")
			.put("第二球|9", "37").put("第二球|10", "38").put("第二球|11", "39").put("第二球|12", "40")
			.put("第二球|13", "41").put("第二球|14", "42").put("第二球|15", "43").put("第二球|16", "44")
			.put("第二球|17", "45").put("第二球|18", "46").put("第二球|19", "47").put("第二球|20", "48")

			.put("第二球|大", "49").put("第二球|小", "50").put("第二球|单", "51").put("第二球|双", "52")
			.put("第二球|合单", "53").put("第二球|合双", "54").put("第二球|尾大", "55").put("第二球|尾小", "56")
			.put("第二球|东", "255").put("第二球|南", "256").put("第二球|西", "257").put("第二球|北", "258")
			.put("第二球|中", "286").put("第二球|发", "287").put("第二球|白", "288")

			.put("第三球|1", "57").put("第三球|2", "58").put("第三球|3", "59").put("第三球|4", "60")
			.put("第三球|5", "61").put("第三球|6", "62").put("第三球|7", "63").put("第三球|8", "64")
			.put("第三球|9", "65").put("第三球|10", "66").put("第三球|11", "67").put("第三球|12", "68")
			.put("第三球|13", "69").put("第三球|14", "70").put("第三球|15", "71").put("第三球|16", "72")
			.put("第三球|17", "73").put("第三球|18", "74").put("第三球|19", "75").put("第三球|20", "76")

			.put("第三球|大", "77").put("第三球|小", "78").put("第三球|单", "79").put("第三球|双", "80")
			.put("第三球|合单", "81").put("第三球|合双", "82").put("第三球|尾大", "83").put("第三球|尾小", "84")
			.put("第三球|东", "259").put("第三球|南", "260").put("第三球|西", "261").put("第三球|北", "262")
			.put("第三球|中", "289").put("第三球|发", "290").put("第三球|白", "291")

			.put("第四球|1", "85").put("第四球|2", "86").put("第四球|3", "87").put("第四球|4", "88")
			.put("第四球|5", "89").put("第四球|6", "90").put("第四球|7", "91").put("第四球|8", "92")
			.put("第四球|9", "93").put("第四球|10", "94").put("第四球|11", "95").put("第四球|12", "96")
			.put("第四球|13", "97").put("第四球|14", "98").put("第四球|15", "99").put("第四球|16", "100")
			.put("第四球|17", "101").put("第四球|18", "102").put("第四球|19", "103").put("第四球|20", "104")

			.put("第四球|大", "105").put("第四球|小", "106").put("第四球|单", "107").put("第四球|双", "108")
			.put("第四球|合单", "109").put("第四球|合双", "110").put("第四球|尾大", "111").put("第四球|尾小", "112")
			.put("第四球|东", "263").put("第四球|南", "264").put("第四球|西", "265").put("第四球|北", "266")
			.put("第四球|中", "292").put("第四球|发", "293").put("第四球|白", "294")

			.put("第五球|1", "113").put("第五球|2", "114").put("第五球|3", "115").put("第五球|4", "116")
			.put("第五球|5", "117").put("第五球|6", "118").put("第五球|7", "119").put("第五球|8", "120")
			.put("第五球|9", "121").put("第五球|10", "122").put("第五球|11", "123").put("第五球|12", "124")
			.put("第五球|13", "125").put("第五球|14", "126").put("第五球|15", "127").put("第五球|16", "128")
			.put("第五球|17", "129").put("第五球|18", "130").put("第五球|19", "131").put("第五球|20", "132")

			.put("第五球|大", "133").put("第五球|小", "134").put("第五球|单", "135").put("第五球|双", "136")
			.put("第五球|合单", "137").put("第五球|合双", "138").put("第五球|尾大", "139").put("第五球|尾小", "140")
			.put("第五球|东", "267").put("第五球|南", "268").put("第五球|西", "269").put("第五球|北", "270")
			.put("第五球|中", "295").put("第五球|发", "296").put("第五球|白", "297")

			.put("第六球|1", "141").put("第六球|2", "142").put("第六球|3", "143").put("第六球|4", "144")
			.put("第六球|5", "145").put("第六球|6", "146").put("第六球|7", "147").put("第六球|8", "148")
			.put("第六球|9", "149").put("第六球|10", "150").put("第六球|11", "151").put("第六球|12", "152")
			.put("第六球|13", "153").put("第六球|14", "154").put("第六球|15", "155").put("第六球|16", "156")
			.put("第六球|17", "157").put("第六球|18", "158").put("第六球|19", "159").put("第六球|20", "160")

			.put("第六球|大", "161").put("第六球|小", "162").put("第六球|单", "163").put("第六球|双", "164")
			.put("第六球|合单", "165").put("第六球|合双", "166").put("第六球|尾大", "167").put("第六球|尾小", "168")
			.put("第六球|东", "271").put("第六球|南", "272").put("第六球|西", "273").put("第六球|北", "274")
			.put("第六球|中", "298").put("第六球|发", "299").put("第六球|白", "300")

			.put("第七球|1", "169").put("第七球|2", "170").put("第七球|3", "171").put("第七球|4", "172")
			.put("第七球|5", "173").put("第七球|6", "174").put("第七球|7", "175").put("第七球|8", "176")
			.put("第七球|9", "177").put("第七球|10", "178").put("第七球|11", "179").put("第七球|12", "180")
			.put("第七球|13", "181").put("第七球|14", "182").put("第七球|15", "183").put("第七球|16", "184")
			.put("第七球|17", "185").put("第七球|18", "186").put("第七球|19", "187").put("第七球|20", "188")

			.put("第七球|大", "189").put("第七球|小", "190").put("第七球|单", "191").put("第七球|双", "192")
			.put("第七球|合单", "193").put("第七球|合双", "194").put("第七球|尾大", "195").put("第七球|尾小", "196")
			.put("第七球|东", "275").put("第七球|南", "276").put("第七球|西", "277").put("第七球|北", "278")
			.put("第七球|中", "301").put("第七球|发", "302").put("第七球|白", "303")

			.put("第八球|1", "197").put("第八球|2", "198").put("第八球|3", "199").put("第八球|4", "200")
			.put("第八球|5", "201").put("第八球|6", "202").put("第八球|7", "203").put("第八球|8", "204")
			.put("第八球|9", "205").put("第八球|10", "206").put("第八球|11", "207").put("第八球|12", "208")
			.put("第八球|13", "209").put("第八球|14", "210").put("第八球|15", "211").put("第八球|16", "212")
			.put("第八球|17", "213").put("第八球|18", "214").put("第八球|19", "215").put("第八球|20", "216")

			.put("第八球|大", "217").put("第八球|小", "218").put("第八球|单", "219").put("第八球|双", "220")
			.put("第八球|合单", "223").put("第八球|合双", "224").put("第八球|尾大", "221").put("第八球|尾小", "222")
			.put("第八球|东", "279").put("第八球|南", "280").put("第八球|西", "281").put("第八球|北", "282")
			.put("第八球|中", "304").put("第八球|发", "305").put("第八球|白", "306")

			.put("总和|大", "245").put("总和|小", "246").put("总和|单", "247").put("总和|双", "248")
			.put("总和|尾大", "249").put("总和|尾小", "250").put("总和|龙", "307").put("总和|虎", "308")
			.build();

	Map<String, String> BET_INFO_CODE = ImmutableMap.<String, String>builder().put("第一球01", "第一球|1")
			.put("第一球02", "第一球|2").put("第一球03", "第一球|3").put("第一球04", "第一球|4").put("第一球05", "第一球|5")
			.put("第一球06", "第一球|6").put("第一球07", "第一球|7").put("第一球08", "第一球|8").put("第一球09", "第一球|9")
			.put("第一球10", "第一球|10").put("第一球11", "第一球|11").put("第一球12", "第一球|12").put("第一球13", "第一球|13")
			.put("第一球14", "第一球|14").put("第一球15", "第一球|15").put("第一球16", "第一球|16").put("第一球17", "第一球|17")
			.put("第一球18", "第一球|18").put("第一球19", "第一球|19").put("第一球20", "第一球|20")

			.put("第一球單雙單", "第一球|单").put("第一球單雙雙", "第一球|双").put("第一球大小大", "第一球|大").put("第一球大小小", "第一球|小")
			.put("第一球合數單雙單", "第一球|合单").put("第一球合數單雙雙", "第一球|合双").put("第一球尾數大小大", "第一球|尾大").put("第一球尾數大小小", "第一球|尾小")
			.put("第一球方向東", "第一球|东").put("第一球方向南", "第一球|南").put("第一球方向西", "第一球|西").put("第一球方向北", "第一球|北")
			.put("第一球中發白中", "第一球|中").put("第一球中發白發", "第一球|发").put("第一球中發白白", "第一球|白")

			.put("第二球01", "第二球|1").put("第二球02", "第二球|2").put("第二球03", "第二球|3").put("第二球04", "第二球|4")
			.put("第二球05", "第二球|5").put("第二球06", "第二球|6").put("第二球07", "第二球|7").put("第二球08", "第二球|8")
			.put("第二球09", "第二球|9").put("第二球10", "第二球|10").put("第二球11", "第二球|11").put("第二球12", "第二球|12")
			.put("第二球13", "第二球|13").put("第二球14", "第二球|14").put("第二球15", "第二球|15").put("第二球16", "第二球|16")
			.put("第二球17", "第二球|17").put("第二球18", "第二球|18").put("第二球19", "第二球|19").put("第二球20", "第二球|20")

			.put("第二球單雙單", "第二球|单").put("第二球單雙雙", "第二球|双").put("第二球大小大", "第二球|大").put("第二球大小小", "第二球|小")
			.put("第二球合數單雙單", "第二球|合单").put("第二球合數單雙雙", "第二球|合双").put("第二球尾數大小大", "第二球|尾大").put("第二球尾數大小小", "第二球|尾小")
			.put("第二球方向東", "第二球|东").put("第二球方向南", "第二球|南").put("第二球方向西", "第二球|西").put("第二球方向北", "第二球|北")
			.put("第二球中發白中", "第二球|中").put("第二球中發白發", "第二球|发").put("第二球中發白白", "第二球|白")

			.put("第三球01", "第三球|1").put("第三球02", "第三球|2").put("第三球03", "第三球|3").put("第三球04", "第三球|4")
			.put("第三球05", "第三球|5").put("第三球06", "第三球|6").put("第三球07", "第三球|7").put("第三球08", "第三球|8")
			.put("第三球09", "第三球|9").put("第三球10", "第三球|10").put("第三球11", "第三球|11").put("第三球12", "第三球|12")
			.put("第三球13", "第三球|13").put("第三球14", "第三球|14").put("第三球15", "第三球|15").put("第三球16", "第三球|16")
			.put("第三球17", "第三球|17").put("第三球18", "第三球|18").put("第三球19", "第三球|19").put("第三球20", "第三球|20")

			.put("第三球單雙單", "第三球|单").put("第三球單雙雙", "第三球|双").put("第三球大小大", "第三球|大").put("第三球大小小", "第三球|小")
			.put("第三球合數單雙單", "第三球|合单").put("第三球合數單雙雙", "第三球|合双").put("第三球尾數大小大", "第三球|尾大").put("第三球尾數大小小", "第三球|尾小")
			.put("第三球方向東", "第三球|东").put("第三球方向南", "第三球|南").put("第三球方向西", "第三球|西").put("第三球方向北", "第三球|北")
			.put("第三球中發白中", "第三球|中").put("第三球中發白發", "第三球|发").put("第三球中發白白", "第三球|白")

			.put("第四球01", "第四球|1").put("第四球02", "第四球|2").put("第四球03", "第四球|3").put("第四球04", "第四球|4")
			.put("第四球05", "第四球|5").put("第四球06", "第四球|6").put("第四球07", "第四球|7").put("第四球08", "第四球|8")
			.put("第四球09", "第四球|9").put("第四球10", "第四球|10").put("第四球11", "第四球|11").put("第四球12", "第四球|12")
			.put("第四球13", "第四球|13").put("第四球14", "第四球|14").put("第四球15", "第四球|15").put("第四球16", "第四球|16")
			.put("第四球17", "第四球|17").put("第四球18", "第四球|18").put("第四球19", "第四球|19").put("第四球20", "第四球|20")

			.put("第四球單雙單", "第四球|单").put("第四球單雙雙", "第四球|双").put("第四球大小大", "第四球|大").put("第四球大小小", "第四球|小")
			.put("第四球合數單雙單", "第四球|合单").put("第四球合數單雙雙", "第四球|合双").put("第四球尾數大小大", "第四球|尾大").put("第四球尾數大小小", "第四球|尾小")
			.put("第四球方向東", "第四球|东").put("第四球方向南", "第四球|南").put("第四球方向西", "第四球|西").put("第四球方向北", "第四球|北")
			.put("第四球中發白中", "第四球|中").put("第四球中發白發", "第四球|发").put("第四球中發白白", "第四球|白")

			.put("第五球01", "第五球|1").put("第五球02", "第五球|2").put("第五球03", "第五球|3").put("第五球04", "第五球|4")
			.put("第五球05", "第五球|5").put("第五球06", "第五球|6").put("第五球07", "第五球|7").put("第五球08", "第五球|8")
			.put("第五球09", "第五球|9").put("第五球10", "第五球|10").put("第五球11", "第五球|11").put("第五球12", "第五球|12")
			.put("第五球13", "第五球|13").put("第五球14", "第五球|14").put("第五球15", "第五球|15").put("第五球16", "第五球|16")
			.put("第五球17", "第五球|17").put("第五球18", "第五球|18").put("第五球19", "第五球|19").put("第五球20", "第五球|20")

			.put("第五球單雙單", "第五球|单").put("第五球單雙雙", "第五球|双").put("第五球大小大", "第五球|大").put("第五球大小小", "第五球|小")
			.put("第五球合數單雙單", "第五球|合单").put("第五球合數單雙雙", "第五球|合双").put("第五球尾數大小大", "第五球|尾大").put("第五球尾數大小小", "第五球|尾小")
			.put("第五球方向東", "第五球|东").put("第五球方向南", "第五球|南").put("第五球方向西", "第五球|西").put("第五球方向北", "第五球|北")
			.put("第五球中發白中", "第五球|中").put("第五球中發白發", "第五球|发").put("第五球中發白白", "第五球|白")

			.put("第六球01", "第六球|1").put("第六球02", "第六球|2").put("第六球03", "第六球|3").put("第六球04", "第六球|4")
			.put("第六球05", "第六球|5").put("第六球06", "第六球|6").put("第六球07", "第六球|7").put("第六球08", "第六球|8")
			.put("第六球09", "第六球|9").put("第六球10", "第六球|10").put("第六球11", "第六球|11").put("第六球12", "第六球|12")
			.put("第六球13", "第六球|13").put("第六球14", "第六球|14").put("第六球15", "第六球|15").put("第六球16", "第六球|16")
			.put("第六球17", "第六球|17").put("第六球18", "第六球|18").put("第六球19", "第六球|19").put("第六球20", "第六球|20")

			.put("第6球單雙單", "第六球|单").put("第6球單雙雙", "第六球|双").put("第6球大小大", "第六球|大").put("第6球大小小", "第六球|小")
			.put("第6球合數單雙單", "第六球|合单").put("第6球合數單雙雙", "第六球|合双").put("第6球尾數大小大", "第六球|尾大").put("第6球尾數大小小", "第六球|尾小")
			.put("第6球方向東", "第六球|东").put("第6球方向南", "第六球|南").put("第6球方向西", "第六球|西").put("第6球方向北", "第六球|北")
			.put("第6球中發白中", "第六球|中").put("第6球中發白發", "第六球|发").put("第6球中發白白", "第六球|白")

			.put("第七球01", "第七球|1").put("第七球02", "第七球|2").put("第七球03", "第七球|3").put("第七球04", "第七球|4")
			.put("第七球05", "第七球|5").put("第七球06", "第七球|6").put("第七球07", "第七球|7").put("第七球08", "第七球|8")
			.put("第七球09", "第七球|9").put("第七球10", "第七球|10").put("第七球11", "第七球|11").put("第七球12", "第七球|12")
			.put("第七球13", "第七球|13").put("第七球14", "第七球|14").put("第七球15", "第七球|15").put("第七球16", "第七球|16")
			.put("第七球17", "第七球|17").put("第七球18", "第七球|18").put("第七球19", "第七球|19").put("第七球20", "第七球|20")

			.put("第7球單雙單", "第七球|单").put("第7球單雙雙", "第七球|双").put("第7球大小大", "第七球|大").put("第7球大小小", "第七球|小")
			.put("第7球合數單雙單", "第七球|合单").put("第7球合數單雙雙", "第七球|合双").put("第7球尾數大小大", "第七球|尾大").put("第7球尾數大小小", "第七球|尾小")
			.put("第7球方向東", "第七球|东").put("第7球方向南", "第七球|南").put("第7球方向西", "第七球|西").put("第7球方向北", "第七球|北")
			.put("第7球中發白中", "第七球|中").put("第7球中發白發", "第七球|发").put("第7球中發白白", "第七球|白")

			.put("第八球01", "第八球|1").put("第八球02", "第八球|2").put("第八球03", "第八球|3").put("第八球04", "第八球|4")
			.put("第八球05", "第八球|5").put("第八球06", "第八球|6").put("第八球07", "第八球|7").put("第八球08", "第八球|8")
			.put("第八球09", "第八球|9").put("第八球10", "第八球|10").put("第八球11", "第八球|11").put("第八球12", "第八球|12")
			.put("第八球13", "第八球|13").put("第八球14", "第八球|14").put("第八球15", "第八球|15").put("第八球16", "第八球|16")
			.put("第八球17", "第八球|17").put("第八球18", "第八球|18").put("第八球19", "第八球|19").put("第八球20", "第八球|20")

			.put("第八球單雙單", "第八球|单").put("第八球單雙雙", "第八球|双").put("第八球大小大", "第八球|大").put("第八球大小小", "第八球|小")
			.put("第八球合數單雙單", "第八球|合单").put("第八球合數單雙雙", "第八球|合双").put("第八球尾數大小大", "第八球|尾大").put("第八球尾數大小小", "第八球|尾小")
			.put("第八球方向東", "第八球|东").put("第八球方向南", "第八球|南").put("第八球方向西", "第八球|西").put("第八球方向北", "第八球|北")
			.put("第八球中發白中", "第八球|中").put("第八球中發白發", "第八球|发").put("第八球中發白白", "第八球|白")

			.put("總和大小大", "總和|大").put("總和大小小", "總和|小").put("總和單雙單", "總和|单").put("總和單雙雙", "總和|双").put("總和尾數大小大", "總和|尾大")
			.put("總和尾數大小小", "總和|尾小").put("龍虎虎", "總和|虎").put("龍虎龍", "總和|龍").build();


	Map<String, String> BET_LIMIT_CODE = ImmutableMap.<String, String>builder()
			.put("第一球|1", "0").put("第一球|2", "0").put("第一球|3", "0").put("第一球|4", "0").put("第一球|5", "0").put("第一球|6", "0")
			.put("第一球|7", "0").put("第一球|8", "0").put("第一球|9", "0").put("第一球|10", "0").put("第一球|11", "0")
			.put("第一球|12", "0").put("第一球|13", "0").put("第一球|14", "0").put("第一球|15", "0").put("第一球|16", "0")
			.put("第一球|17", "0").put("第一球|18", "0").put("第一球|19", "0").put("第一球|20", "0")

			.put("第一球|单", "2").put("第一球|双", "2").put("第一球|大", "1").put("第一球|小", "1").put("第一球|合单", "4")
			.put("第一球|合双", "4").put("第一球|尾大", "3").put("第一球|尾小", "3").put("第一球|东", "5").put("第一球|南", "5")
			.put("第一球|西", "5").put("第一球|北", "5").put("第一球|中", "6").put("第一球|发", "6").put("第一球|白", "6")

			.put("第二球|1", "0").put("第二球|2", "0").put("第二球|3", "0").put("第二球|4", "0").put("第二球|5", "0").put("第二球|6", "0")
			.put("第二球|7", "0").put("第二球|8", "0").put("第二球|9", "0").put("第二球|10", "0").put("第二球|11", "0")
			.put("第二球|12", "0").put("第二球|13", "0").put("第二球|14", "0").put("第二球|15", "0").put("第二球|16", "0")
			.put("第二球|17", "0").put("第二球|18", "0").put("第二球|19", "0").put("第二球|20", "0")

			.put("第二球|单", "2").put("第二球|双", "2").put("第二球|大", "1").put("第二球|小", "1").put("第二球|合单", "4")
			.put("第二球|合双", "4").put("第二球|尾大", "3").put("第二球|尾小", "3").put("第二球|东", "5").put("第二球|南", "5")
			.put("第二球|西", "5").put("第二球|北", "5").put("第二球|中", "6").put("第二球|发", "6").put("第二球|白", "6")

			.put("第三球|1", "0").put("第三球|2", "0").put("第三球|3", "0").put("第三球|4", "0").put("第三球|5", "0").put("第三球|6", "0")
			.put("第三球|7", "0").put("第三球|8", "0").put("第三球|9", "0").put("第三球|10", "0").put("第三球|11", "0")
			.put("第三球|12", "0").put("第三球|13", "0").put("第三球|14", "0").put("第三球|15", "0").put("第三球|16", "0")
			.put("第三球|17", "0").put("第三球|18", "0").put("第三球|19", "0").put("第三球|20", "0")

			.put("第三球|单", "2").put("第三球|双", "2").put("第三球|大", "1").put("第三球|小", "1").put("第三球|合单", "4")
			.put("第三球|合双", "4").put("第三球|尾大", "3").put("第三球|尾小", "3").put("第三球|东", "5").put("第三球|南", "5")
			.put("第三球|西", "5").put("第三球|北", "5").put("第三球|中", "6").put("第三球|发", "6").put("第三球|白", "6")

			.put("第四球|1", "0").put("第四球|2", "0").put("第四球|3", "0").put("第四球|4", "0").put("第四球|5", "0").put("第四球|6", "0")
			.put("第四球|7", "0").put("第四球|8", "0").put("第四球|9", "0").put("第四球|10", "0").put("第四球|11", "0")
			.put("第四球|12", "0").put("第四球|13", "0").put("第四球|14", "0").put("第四球|15", "0").put("第四球|16", "0")
			.put("第四球|17", "0").put("第四球|18", "0").put("第四球|19", "0").put("第四球|20", "0")

			.put("第四球|单", "2").put("第四球|双", "2").put("第四球|大", "1").put("第四球|小", "1").put("第四球|合单", "4")
			.put("第四球|合双", "4").put("第四球|尾大", "3").put("第四球|尾小", "3").put("第四球|东", "5").put("第四球|南", "5")
			.put("第四球|西", "5").put("第四球|北", "5").put("第四球|中", "6").put("第四球|发", "6").put("第四球|白", "6")

			.put("第五球|1", "0").put("第五球|2", "0").put("第五球|3", "0").put("第五球|4", "0").put("第五球|5", "0").put("第五球|6", "0")
			.put("第五球|7", "0").put("第五球|8", "0").put("第五球|9", "0").put("第五球|10", "0").put("第五球|11", "0")
			.put("第五球|12", "0").put("第五球|13", "0").put("第五球|14", "0").put("第五球|15", "0").put("第五球|16", "0")
			.put("第五球|17", "0").put("第五球|18", "0").put("第五球|19", "0").put("第五球|20", "0")

			.put("第五球|单", "2").put("第五球|双", "2").put("第五球|大", "1").put("第五球|小", "1").put("第五球|合单", "4")
			.put("第五球|合双", "4").put("第五球|尾大", "3").put("第五球|尾小", "3").put("第五球|东", "5").put("第五球|南", "5")
			.put("第五球|西", "5").put("第五球|北", "5").put("第五球|中", "6").put("第五球|发", "6").put("第五球|白", "6")

			.put("第六球|1", "0").put("第六球|2", "0").put("第六球|3", "0").put("第六球|4", "0").put("第六球|5", "0").put("第六球|6", "0")
			.put("第六球|7", "0").put("第六球|8", "0").put("第六球|9", "0").put("第六球|10", "0").put("第六球|11", "0")
			.put("第六球|12", "0").put("第六球|13", "0").put("第六球|14", "0").put("第六球|15", "0").put("第六球|16", "0")
			.put("第六球|17", "0").put("第六球|18", "0").put("第六球|19", "0").put("第六球|20", "0")

			.put("第六球|单", "2").put("第六球|双", "2").put("第六球|大", "1").put("第六球|小", "1").put("第六球|合单", "4")
			.put("第六球|合双", "4").put("第六球|尾大", "3").put("第六球|尾小", "3").put("第六球|东", "5").put("第六球|南", "5")
			.put("第六球|西", "5").put("第六球|北", "5").put("第六球|中", "6").put("第六球|发", "6").put("第六球|白", "6")

			.put("第七球|1", "0").put("第七球|2", "0").put("第七球|3", "0").put("第七球|4", "0").put("第七球|5", "0").put("第七球|6", "0")
			.put("第七球|7", "0").put("第七球|8", "0").put("第七球|9", "0").put("第七球|10", "0").put("第七球|11", "0")
			.put("第七球|12", "0").put("第七球|13", "0").put("第七球|14", "0").put("第七球|15", "0").put("第七球|16", "0")
			.put("第七球|17", "0").put("第七球|18", "0").put("第七球|19", "0").put("第七球|20", "0")

			.put("第七球|单", "2").put("第七球|双", "2").put("第七球|大", "1").put("第七球|小", "1").put("第七球|合单", "4")
			.put("第七球|合双", "4").put("第七球|尾大", "3").put("第七球|尾小", "3").put("第七球|东", "5").put("第七球|南", "5")
			.put("第七球|西", "5").put("第七球|北", "5").put("第七球|中", "6").put("第七球|发", "6").put("第七球|白", "6")

			.put("第八球|1", "0").put("第八球|2", "0").put("第八球|3", "0").put("第八球|4", "0").put("第八球|5", "0").put("第八球|6", "0")
			.put("第八球|7", "0").put("第八球|8", "0").put("第八球|9", "0").put("第八球|10", "0").put("第八球|11", "0")
			.put("第八球|12", "0").put("第八球|13", "0").put("第八球|14", "0").put("第八球|15", "0").put("第八球|16", "0")
			.put("第八球|17", "0").put("第八球|18", "0").put("第八球|19", "0").put("第八球|20", "0")

			.put("第八球|单", "2").put("第八球|双", "2").put("第八球|大", "1").put("第八球|小", "1").put("第八球|合单", "4")
			.put("第八球|合双", "4").put("第八球|尾大", "3").put("第八球|尾小", "3").put("第八球|东", "5").put("第八球|南", "5")
			.put("第八球|西", "5").put("第八球|北", "5").put("第八球|中", "6").put("第八球|发", "6").put("第八球|白", "6")

			.put("总和|大", "7").put("总和|小", "7").put("总和|单", "8").put("总和|双", "8").put("总和|尾大", "9").put("总和|尾小", "9")
			.put("总和|龙", "18").put("总和|虎", "18").build();

}
