package com.common.config.handicap;
import com.google.common.collect.ImmutableMap;

import java.util.Map;

/**
 * 快乐彩类游戏配置类
 * @Author: Dongming
 * @Date: 2020-05-13 10:03
 * @Email: job.dongming@foxmail.com
 * @Version: v1.0
 */
public interface HappyConfig {


	Map<String, String> ITEM_TYPE = ImmutableMap.<String, String>builder()
			.put("第一球|1", "0").put("第一球|2", "0").put("第一球|3", "0").put("第一球|4", "0").put("第一球|5", "0").put("第一球|6", "0")
			.put("第一球|7", "0").put("第一球|8", "0").put("第一球|9", "0").put("第一球|10", "0").put("第一球|11", "0")
			.put("第一球|12", "0").put("第一球|13", "0").put("第一球|14", "0").put("第一球|15", "0").put("第一球|16", "0")
			.put("第一球|17", "0").put("第一球|18", "0").put("第一球|19", "0").put("第一球|20", "0")

			.put("第一球|单", "1").put("第一球|双", "1").put("第一球|大", "1").put("第一球|小", "1").put("第一球|合单", "1")
			.put("第一球|合双", "1").put("第一球|尾大", "1").put("第一球|尾小", "1").put("第一球|东", "2").put("第一球|南", "2")
			.put("第一球|西", "2").put("第一球|北", "2").put("第一球|中", "3").put("第一球|发", "3").put("第一球|白", "3")

			.put("第二球|1", "0").put("第二球|2", "0").put("第二球|3", "0").put("第二球|4", "0").put("第二球|5", "0").put("第二球|6", "0")
			.put("第二球|7", "0").put("第二球|8", "0").put("第二球|9", "0").put("第二球|10", "0").put("第二球|11", "0")
			.put("第二球|12", "0").put("第二球|13", "0").put("第二球|14", "0").put("第二球|15", "0").put("第二球|16", "0")
			.put("第二球|17", "0").put("第二球|18", "0").put("第二球|19", "0").put("第二球|20", "0")

			.put("第二球|单", "1").put("第二球|双", "1").put("第二球|大", "1").put("第二球|小", "1").put("第二球|合单", "1")
			.put("第二球|合双", "1").put("第二球|尾大", "1").put("第二球|尾小", "1").put("第二球|东", "2").put("第二球|南", "2")
			.put("第二球|西", "2").put("第二球|北", "2").put("第二球|中", "3").put("第二球|发", "3").put("第二球|白", "3")

			.put("第三球|1", "0").put("第三球|2", "0").put("第三球|3", "0").put("第三球|4", "0").put("第三球|5", "0").put("第三球|6", "0")
			.put("第三球|7", "0").put("第三球|8", "0").put("第三球|9", "0").put("第三球|10", "0").put("第三球|11", "0")
			.put("第三球|12", "0").put("第三球|13", "0").put("第三球|14", "0").put("第三球|15", "0").put("第三球|16", "0")
			.put("第三球|17", "0").put("第三球|18", "0").put("第三球|19", "0").put("第三球|20", "0")

			.put("第三球|单", "1").put("第三球|双", "1").put("第三球|大", "1").put("第三球|小", "1").put("第三球|合单", "1")
			.put("第三球|合双", "1").put("第三球|尾大", "1").put("第三球|尾小", "1").put("第三球|东", "2").put("第三球|南", "2")
			.put("第三球|西", "2").put("第三球|北", "2").put("第三球|中", "3").put("第三球|发", "3").put("第三球|白", "3")

			.put("第四球|1", "0").put("第四球|2", "0").put("第四球|3", "0").put("第四球|4", "0").put("第四球|5", "0").put("第四球|6", "0")
			.put("第四球|7", "0").put("第四球|8", "0").put("第四球|9", "0").put("第四球|10", "0").put("第四球|11", "0")
			.put("第四球|12", "0").put("第四球|13", "0").put("第四球|14", "0").put("第四球|15", "0").put("第四球|16", "0")
			.put("第四球|17", "0").put("第四球|18", "0").put("第四球|19", "0").put("第四球|20", "0")

			.put("第四球|单", "1").put("第四球|双", "1").put("第四球|大", "1").put("第四球|小", "1").put("第四球|合单", "1")
			.put("第四球|合双", "1").put("第四球|尾大", "1").put("第四球|尾小", "1").put("第四球|东", "2").put("第四球|南", "2")
			.put("第四球|西", "2").put("第四球|北", "2").put("第四球|中", "3").put("第四球|发", "3").put("第四球|白", "3")

			.put("第五球|1", "0").put("第五球|2", "0").put("第五球|3", "0").put("第五球|4", "0").put("第五球|5", "0").put("第五球|6", "0")
			.put("第五球|7", "0").put("第五球|8", "0").put("第五球|9", "0").put("第五球|10", "0").put("第五球|11", "0")
			.put("第五球|12", "0").put("第五球|13", "0").put("第五球|14", "0").put("第五球|15", "0").put("第五球|16", "0")
			.put("第五球|17", "0").put("第五球|18", "0").put("第五球|19", "0").put("第五球|20", "0")

			.put("第五球|单", "1").put("第五球|双", "1").put("第五球|大", "1").put("第五球|小", "1").put("第五球|合单", "1")
			.put("第五球|合双", "1").put("第五球|尾大", "1").put("第五球|尾小", "1").put("第五球|东", "2").put("第五球|南", "2")
			.put("第五球|西", "2").put("第五球|北", "2").put("第五球|中", "3").put("第五球|发", "3").put("第五球|白", "3")

			.put("第六球|1", "0").put("第六球|2", "0").put("第六球|3", "0").put("第六球|4", "0").put("第六球|5", "0").put("第六球|6", "0")
			.put("第六球|7", "0").put("第六球|8", "0").put("第六球|9", "0").put("第六球|10", "0").put("第六球|11", "0")
			.put("第六球|12", "0").put("第六球|13", "0").put("第六球|14", "0").put("第六球|15", "0").put("第六球|16", "0")
			.put("第六球|17", "0").put("第六球|18", "0").put("第六球|19", "0").put("第六球|20", "0")

			.put("第六球|单", "1").put("第六球|双", "1").put("第六球|大", "1").put("第六球|小", "1").put("第六球|合单", "1")
			.put("第六球|合双", "1").put("第六球|尾大", "1").put("第六球|尾小", "1").put("第六球|东", "2").put("第六球|南", "2")
			.put("第六球|西", "2").put("第六球|北", "2").put("第六球|中", "3").put("第六球|发", "3").put("第六球|白", "3")

			.put("第七球|1", "0").put("第七球|2", "0").put("第七球|3", "0").put("第七球|4", "0").put("第七球|5", "0").put("第七球|6", "0")
			.put("第七球|7", "0").put("第七球|8", "0").put("第七球|9", "0").put("第七球|10", "0").put("第七球|11", "0")
			.put("第七球|12", "0").put("第七球|13", "0").put("第七球|14", "0").put("第七球|15", "0").put("第七球|16", "0")
			.put("第七球|17", "0").put("第七球|18", "0").put("第七球|19", "0").put("第七球|20", "0")

			.put("第七球|单", "1").put("第七球|双", "1").put("第七球|大", "1").put("第七球|小", "1").put("第七球|合单", "1")
			.put("第七球|合双", "1").put("第七球|尾大", "1").put("第七球|尾小", "1").put("第七球|东", "2").put("第七球|南", "2")
			.put("第七球|西", "2").put("第七球|北", "2").put("第七球|中", "3").put("第七球|发", "3").put("第七球|白", "3")

			.put("第八球|1", "0").put("第八球|2", "0").put("第八球|3", "0").put("第八球|4", "0").put("第八球|5", "0").put("第八球|6", "0")
			.put("第八球|7", "0").put("第八球|8", "0").put("第八球|9", "0").put("第八球|10", "0").put("第八球|11", "0")
			.put("第八球|12", "0").put("第八球|13", "0").put("第八球|14", "0").put("第八球|15", "0").put("第八球|16", "0")
			.put("第八球|17", "0").put("第八球|18", "0").put("第八球|19", "0").put("第八球|20", "0")

			.put("第八球|单", "1").put("第八球|双", "1").put("第八球|大", "1").put("第八球|小", "1").put("第八球|合单", "1")
			.put("第八球|合双", "1").put("第八球|尾大", "2").put("第八球|尾小", "2").put("第八球|东", "2").put("第八球|南", "2")
			.put("第八球|西", "2").put("第八球|北", "2").put("第八球|中", "3").put("第八球|发", "3").put("第八球|白", "3")

			.put("总和|大", "4").put("总和|小", "4").put("总和|单", "4").put("总和|双", "4").put("总和|尾大", "4").put("总和|尾小", "4")
			.put("总和|龙", "5").put("总和|虎", "5").build();
}
