package com.common.config.handicap;
import com.google.common.collect.ImmutableMap;

import java.util.Map;

/**
 * IDC盘口 号码类玩法配置类
 *
 * @Author: Dongming
 * @Date: 2020-05-12 15:06
 * @Email: job.dongming@foxmail.com
 * @Version: v1.0
 */
public interface IdcNumberConfig extends IdcConfig,NumberConfig {

	Map<String, String> ITEM_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "601:1").put("第一名|2", "601:2")
			.put("第一名|3", "601:3").put("第一名|4", "601:4").put("第一名|5", "601:5").put("第一名|6", "601:6")
			.put("第一名|7", "601:7").put("第一名|8", "601:8").put("第一名|9", "601:9").put("第一名|10", "601:10")
			.put("第一名|单", "611:1").put("第一名|双", "611:2").put("第一名|大", "621:1").put("第一名|小", "621:2")
			.put("第一名|龙", "631:1").put("第一名|虎", "631:2")

			.put("第二名|1", "602:1").put("第二名|2", "602:2").put("第二名|3", "602:3").put("第二名|4", "602:4")
			.put("第二名|5", "602:5").put("第二名|6", "602:6").put("第二名|7", "602:7").put("第二名|8", "602:8")
			.put("第二名|9", "602:9").put("第二名|10", "602:10").put("第二名|单", "612:1").put("第二名|双", "612:2")
			.put("第二名|大", "622:1").put("第二名|小", "622:2").put("第二名|龙", "632:1").put("第二名|虎", "632:2")

			.put("第三名|1", "603:1").put("第三名|2", "603:2").put("第三名|3", "603:3").put("第三名|4", "603:4")
			.put("第三名|5", "603:5").put("第三名|6", "603:6").put("第三名|7", "603:7").put("第三名|8", "603:8")
			.put("第三名|9", "603:9").put("第三名|10", "603:10").put("第三名|单", "613:1").put("第三名|双", "613:2")
			.put("第三名|大", "623:1").put("第三名|小", "623:2").put("第三名|龙", "633:1").put("第三名|虎", "633:2")

			.put("第四名|1", "604:1").put("第四名|2", "604:2").put("第四名|3", "604:3").put("第四名|4", "604:4")
			.put("第四名|5", "604:5").put("第四名|6", "604:6").put("第四名|7", "604:7").put("第四名|8", "604:8")
			.put("第四名|9", "604:9").put("第四名|10", "604:10").put("第四名|单", "614:1").put("第四名|双", "614:2")
			.put("第四名|大", "624:1").put("第四名|小", "624:2").put("第四名|龙", "634:1").put("第四名|虎", "634:2")

			.put("第五名|1", "605:1").put("第五名|2", "605:2").put("第五名|3", "605:3").put("第五名|4", "605:4")
			.put("第五名|5", "605:5").put("第五名|6", "605:6").put("第五名|7", "605:7").put("第五名|8", "605:8")
			.put("第五名|9", "605:9").put("第五名|10", "605:10").put("第五名|单", "615:1").put("第五名|双", "615:2")
			.put("第五名|大", "625:1").put("第五名|小", "625:2").put("第五名|龙", "635:1").put("第五名|虎", "635:2")

			.put("第六名|1", "606:1").put("第六名|2", "606:2").put("第六名|3", "606:3").put("第六名|4", "606:4")
			.put("第六名|5", "606:5").put("第六名|6", "606:6").put("第六名|7", "606:7").put("第六名|8", "606:8")
			.put("第六名|9", "606:9").put("第六名|10", "606:10").put("第六名|单", "616:1").put("第六名|双", "616:2")
			.put("第六名|大", "626:1").put("第六名|小", "626:2")

			.put("第七名|1", "607:1").put("第七名|2", "607:2").put("第七名|3", "607:3").put("第七名|4", "607:4")
			.put("第七名|5", "607:5").put("第七名|6", "607:6").put("第七名|7", "607:7").put("第七名|8", "607:8")
			.put("第七名|9", "607:9").put("第七名|10", "607:10").put("第七名|单", "617:1").put("第七名|双", "617:2")
			.put("第七名|大", "627:1").put("第七名|小", "627:2")

			.put("第八名|1", "608:1").put("第八名|2", "608:2").put("第八名|3", "608:3").put("第八名|4", "608:4")
			.put("第八名|5", "608:5").put("第八名|6", "608:6").put("第八名|7", "608:7").put("第八名|8", "608:8")
			.put("第八名|9", "608:9").put("第八名|10", "608:10").put("第八名|单", "618:1").put("第八名|双", "618:2")
			.put("第八名|大", "628:1").put("第八名|小", "628:2")

			.put("第九名|1", "609:1").put("第九名|2", "609:2").put("第九名|3", "609:3").put("第九名|4", "609:4")
			.put("第九名|5", "609:5").put("第九名|6", "609:6").put("第九名|7", "609:7").put("第九名|8", "609:8")
			.put("第九名|9", "609:9").put("第九名|10", "609:10").put("第九名|单", "619:1").put("第九名|双", "619:2")
			.put("第九名|大", "629:1").put("第九名|小", "629:2")

			.put("第十名|1", "610:1").put("第十名|2", "610:2").put("第十名|3", "610:3").put("第十名|4", "610:4")
			.put("第十名|5", "610:5").put("第十名|6", "610:6").put("第十名|7", "610:7").put("第十名|8", "610:8")
			.put("第十名|9", "610:9").put("第十名|10", "610:10").put("第十名|单", "620:1").put("第十名|双", "620:2")
			.put("第十名|大", "630:1").put("第十名|小", "630:2")

			.put("冠亚|3", "638:3").put("冠亚|4", "638:4").put("冠亚|5", "638:5").put("冠亚|6", "638:6").put("冠亚|7", "638:7")
			.put("冠亚|8", "638:8").put("冠亚|9", "638:9").put("冠亚|10", "638:20").put("冠亚|11", "638:11")
			.put("冠亚|12", "638:12").put("冠亚|13", "638:13").put("冠亚|14", "638:14").put("冠亚|15", "638:15")
			.put("冠亚|16", "638:16").put("冠亚|17", "638:17").put("冠亚|18", "638:18").put("冠亚|19", "638:19")
			.put("冠亚|单", "636:1").put("冠亚|双", "636:2").put("冠亚|大", "637:1").put("冠亚|小", "637:2").build();

	Map<String, String> CODE_ITEM = ImmutableMap.<String, String>builder().put("601:1", "第一名|1")
			.put("601:2", "第一名|2").put("601:3", "第一名|3").put("601:4", "第一名|4").put("601:5", "第一名|5")
			.put("601:6", "第一名|6").put("601:7", "第一名|7").put("601:8", "第一名|8").put("601:9", "第一名|9")
			.put("601:10", "第一名|10").put("611:1", "第一名|单").put("611:2", "第一名|双").put("621:1", "第一名|大")
			.put("621:2", "第一名|小").put("631:1", "第一名|龙").put("631:2", "第一名|虎")

			.put("602:1", "第二名|1").put("602:2", "第二名|2").put("602:3", "第二名|3").put("602:4", "第二名|4")
			.put("602:5", "第二名|5").put("602:6", "第二名|6").put("602:7", "第二名|7").put("602:8", "第二名|8")
			.put("602:9", "第二名|9").put("602:10", "第二名|10").put("612:1", "第二名|单").put("612:2", "第二名|双")
			.put("622:1", "第二名|大").put("622:2", "第二名|小").put("632:1", "第二名|龙").put("632:2", "第二名|虎")

			.put("603:1", "第三名|1").put("603:2", "第三名|2").put("603:3", "第三名|3").put("603:4", "第三名|4")
			.put("603:5", "第三名|5").put("603:6", "第三名|6").put("603:7", "第三名|7").put("603:8", "第三名|8")
			.put("603:9", "第三名|9").put("603:10", "第三名|10").put("613:1", "第三名|单").put("613:2", "第三名|双")
			.put("623:1", "第三名|大").put("623:2", "第三名|小").put("633:1", "第三名|龙").put("633:2", "第三名|虎")

			.put("604:1", "第四名|1").put("604:2", "第四名|2").put("604:3", "第四名|3").put("604:4", "第四名|4")
			.put("604:5", "第四名|5").put("604:6", "第四名|6").put("604:7", "第四名|7").put("604:8", "第四名|8")
			.put("604:9", "第四名|9").put("604:10", "第四名|10").put("614:1", "第四名|单").put("614:2", "第四名|双")
			.put("624:1", "第四名|大").put("624:2", "第四名|小").put("634:1", "第四名|龙").put("634:2", "第四名|虎")

			.put("605:1", "第五名|1").put("605:2", "第五名|2").put("605:3", "第五名|3").put("605:4", "第五名|4")
			.put("605:5", "第五名|5").put("605:6", "第五名|6").put("605:7", "第五名|7").put("605:8", "第五名|8")
			.put("605:9", "第五名|9").put("605:10", "第五名|10").put("615:1", "第五名|单").put("615:2", "第五名|双")
			.put("625:1", "第五名|大").put("625:2", "第五名|小").put("635:1", "第五名|龙").put("635:2", "第五名|虎")

			.put("606:1", "第六名|1").put("606:2", "第六名|2").put("606:3", "第六名|3").put("606:4", "第六名|4")
			.put("606:5", "第六名|5").put("606:6", "第六名|6").put("606:7", "第六名|7").put("606:8", "第六名|8")
			.put("606:9", "第六名|9").put("606:10", "第六名|10").put("616:1", "第六名|单").put("616:2", "第六名|双")
			.put("626:1", "第六名|大").put("626:2", "第六名|小")

			.put("607:1", "第七名|1").put("607:2", "第七名|2").put("607:3", "第七名|3").put("607:4", "第七名|4")
			.put("607:5", "第七名|5").put("607:6", "第七名|6").put("607:7", "第七名|7").put("607:8", "第七名|8")
			.put("607:9", "第七名|9").put("607:10", "第七名|10").put("617:1", "第七名|单").put("617:2", "第七名|双")
			.put("627:1", "第七名|大").put("627:2", "第七名|小")

			.put("608:1", "第八名|1").put("608:2", "第八名|2").put("608:3", "第八名|3").put("608:4", "第八名|4")
			.put("608:5", "第八名|5").put("608:6", "第八名|6").put("608:7", "第八名|7").put("608:8", "第八名|8")
			.put("608:9", "第八名|9").put("608:10", "第八名|10").put("618:1", "第八名|单").put("618:2", "第八名|双")
			.put("628:1", "第八名|大").put("628:2", "第八名|小")

			.put("609:1", "第九名|1").put("609:2", "第九名|2").put("609:3", "第九名|3").put("609:4", "第九名|4")
			.put("609:5", "第九名|5").put("609:6", "第九名|6").put("609:7", "第九名|7").put("609:8", "第九名|8")
			.put("609:9", "第九名|9").put("609:10", "第九名|10").put("619:1", "第九名|单").put("619:2", "第九名|双")
			.put("629:1", "第九名|大").put("629:2", "第九名|小")

			.put("610:1", "第十名|1").put("610:2", "第十名|2").put("610:3", "第十名|3").put("610:4", "第十名|4")
			.put("610:5", "第十名|5").put("610:6", "第十名|6").put("610:7", "第十名|7").put("610:8", "第十名|8")
			.put("610:9", "第十名|9").put("610:10", "第十名|10").put("620:1", "第十名|单").put("620:2", "第十名|双")
			.put("630:1", "第十名|大").put("630:2", "第十名|小")

			.put("638:3", "冠亚|3").put("638:4", "冠亚|4").put("638:5", "冠亚|5").put("638:6", "冠亚|6").put("638:7", "冠亚|7")
			.put("638:8", "冠亚|8").put("638:9", "冠亚|9").put("638:10", "冠亚|10").put("638:11", "冠亚|11")
			.put("638:12", "冠亚|12").put("638:13", "冠亚|13").put("638:14", "冠亚|14").put("638:15", "冠亚|15")
			.put("638:16", "冠亚|16").put("638:17", "冠亚|17").put("638:18", "冠亚|18").put("638:19", "冠亚|19")
			.put("636:1", "冠亚|单").put("636:2", "冠亚|双").put("637:1", "冠亚|大").put("637:2", "冠亚|小").build();

	Map<String, String> INFO_ITEM = ImmutableMap.<String, String>builder().put("冠军01", "第一名|1").put("冠军02", "第一名|2")
			.put("冠军03", "第一名|3").put("冠军04", "第一名|4").put("冠军05", "第一名|5").put("冠军06", "第一名|6").put("冠军07", "第一名|7")
			.put("冠军08", "第一名|8").put("冠军09", "第一名|9").put("冠军10", "第一名|10").put("冠军龙虎虎", "第一名|虎").put("冠军龙虎龙", "第一名|龙")
			.put("冠军单双单", "第一名|单").put("冠军单双双", "第一名|双").put("冠军大小大", "第一名|大").put("冠军大小小", "第一名|小")

			.put("亚军01", "第二名|1").put("亚军02", "第二名|2").put("亚军03", "第二名|3").put("亚军04", "第二名|4").put("亚军05", "第二名|5")
			.put("亚军06", "第二名|6").put("亚军07", "第二名|7").put("亚军08", "第二名|8").put("亚军09", "第二名|9").put("亚军10", "第二名|10")
			.put("亚军龙虎虎", "第二名|虎").put("亚军龙虎龙", "第二名|龙").put("亚军单双单", "第二名|单").put("亚军单双双", "第二名|双")
			.put("亚军大小大", "第二名|大").put("亚军大小小", "第二名|小")

			.put("第三名01", "第三名|1").put("第三名02", "第三名|2").put("第三名03", "第三名|3").put("第三名04", "第三名|4")
			.put("第三名05", "第三名|5").put("第三名06", "第三名|6").put("第三名07", "第三名|7").put("第三名08", "第三名|8")
			.put("第三名09", "第三名|9").put("第三名10", "第三名|10").put("第三名龙虎虎", "第三名|虎").put("第三名龙虎龙", "第三名|龙")
			.put("第三名单双单", "第三名|单").put("第三名单双双", "第三名|双").put("第三名大小大", "第三名|大").put("第三名大小小", "第三名|小")

			.put("第四名01", "第四名|1").put("第四名02", "第四名|2").put("第四名03", "第四名|3").put("第四名04", "第四名|4")
			.put("第四名05", "第四名|5").put("第四名06", "第四名|6").put("第四名07", "第四名|7").put("第四名08", "第四名|8")
			.put("第四名09", "第四名|9").put("第四名10", "第四名|10").put("第四名龙虎虎", "第四名|虎").put("第四名龙虎龙", "第四名|龙")
			.put("第四名单双单", "第四名|单").put("第四名单双双", "第四名|双").put("第四名大小大", "第四名|大").put("第四名大小小", "第四名|小")

			.put("第五名01", "第五名|1").put("第五名02", "第五名|2").put("第五名03", "第五名|3").put("第五名04", "第五名|4")
			.put("第五名05", "第五名|5").put("第五名06", "第五名|6").put("第五名07", "第五名|7").put("第五名08", "第五名|8")
			.put("第五名09", "第五名|9").put("第五名10", "第五名|10").put("第五名龙虎虎", "第五名|虎").put("第五名龙虎龙", "第五名|龙")
			.put("第五名单双单", "第五名|单").put("第五名单双双", "第五名|双").put("第五名大小大", "第五名|大").put("第五名大小小", "第五名|小")

			.put("第六名01", "第六名|1").put("第六名02", "第六名|2").put("第六名03", "第六名|3").put("第六名04", "第六名|4")
			.put("第六名05", "第六名|5").put("第六名06", "第六名|6").put("第六名07", "第六名|7").put("第六名08", "第六名|8")
			.put("第六名09", "第六名|9").put("第六名10", "第六名|10").put("第六名单双单", "第六名|单").put("第六名单双双", "第六名|双")
			.put("第六名大小大", "第六名|大").put("第六名大小小", "第六名|小")

			.put("第七名01", "第七名|1").put("第七名02", "第七名|2").put("第七名03", "第七名|3").put("第七名04", "第七名|4")
			.put("第七名05", "第七名|5").put("第七名06", "第七名|6").put("第七名07", "第七名|7").put("第七名08", "第七名|8")
			.put("第七名09", "第七名|9").put("第七名10", "第七名|10").put("第七名单双单", "第七名|单").put("第七名单双双", "第七名|双")
			.put("第七名大小大", "第七名|大").put("第七名大小小", "第七名|小")

			.put("第八名01", "第八名|1").put("第八名02", "第八名|2").put("第八名03", "第八名|3").put("第八名04", "第八名|4")
			.put("第八名05", "第八名|5").put("第八名06", "第八名|6").put("第八名07", "第八名|7").put("第八名08", "第八名|8")
			.put("第八名09", "第八名|9").put("第八名10", "第八名|10").put("第八名单双单", "第八名|单").put("第八名单双双", "第八名|双")
			.put("第八名大小大", "第八名|大").put("第八名大小小", "第八名|小")

			.put("第九名01", "第九名|1").put("第九名02", "第九名|2").put("第九名03", "第九名|3").put("第九名04", "第九名|4")
			.put("第九名05", "第九名|5").put("第九名06", "第九名|6").put("第九名07", "第九名|7").put("第九名08", "第九名|8")
			.put("第九名09", "第九名|9").put("第九名10", "第九名|10").put("第九名单双单", "第九名|单").put("第九名单双双", "第九名|双")
			.put("第九名大小大", "第九名|大").put("第九名大小小", "第九名|小")

			.put("第十名01", "第十名|1").put("第十名02", "第十名|2").put("第十名03", "第十名|3").put("第十名04", "第十名|4")
			.put("第十名05", "第十名|5").put("第十名06", "第十名|6").put("第十名07", "第十名|7").put("第十名08", "第十名|8")
			.put("第十名09", "第十名|9").put("第十名10", "第十名|10").put("第十名单双单", "第十名|单").put("第十名单双双", "第十名|双")
			.put("第十名大小大", "第十名|大").put("第十名大小小", "第十名|小")

			.put("冠亚和3", "冠亚|3").put("冠亚和4", "冠亚|4").put("冠亚和5", "冠亚|5").put("冠亚和6", "冠亚|6").put("冠亚和7", "冠亚|7")
			.put("冠亚和8", "冠亚|8").put("冠亚和9", "冠亚|9").put("冠亚和10", "冠亚|10").put("冠亚和11", "冠亚|11").put("冠亚和12", "冠亚|12")
			.put("冠亚和13", "冠亚|13").put("冠亚和14", "冠亚|14").put("冠亚和15", "冠亚|15").put("冠亚和16", "冠亚|16")
			.put("冠亚和17", "冠亚|17").put("冠亚和18", "冠亚|18").put("冠亚和19", "冠亚|19").put("冠亚和单双单", "冠亚|单")
			.put("冠亚和单双双", "冠亚|双").put("冠亚和大小大", "冠亚|大").put("冠亚和大小小", "冠亚|小").build();

	Map<String, String> ITEM_LIMIT = ImmutableMap.<String, String>builder().put("第一名|1", "00").put("第一名|2", "00")
			.put("第一名|3", "00").put("第一名|4", "00").put("第一名|5", "00").put("第一名|6", "00").put("第一名|7", "00")
			.put("第一名|8", "00").put("第一名|9", "00").put("第一名|10", "00").put("第一名|大", "01").put("第一名|小", "01")
			.put("第一名|单", "01").put("第一名|双", "01").put("第一名|龙", "02").put("第一名|虎", "02")

			.put("第二名|1", "00").put("第二名|2", "00").put("第二名|3", "00").put("第二名|4", "00").put("第二名|5", "00")
			.put("第二名|6", "00").put("第二名|7", "00").put("第二名|8", "00").put("第二名|9", "00").put("第二名|10", "00")
			.put("第二名|大", "01").put("第二名|小", "01").put("第二名|单", "01").put("第二名|双", "01").put("第二名|龙", "02")
			.put("第二名|虎", "02")

			.put("第三名|1", "00").put("第三名|2", "00").put("第三名|3", "00").put("第三名|4", "00").put("第三名|5", "00")
			.put("第三名|6", "00").put("第三名|7", "00").put("第三名|8", "00").put("第三名|9", "00").put("第三名|10", "00")
			.put("第三名|大", "01").put("第三名|小", "01").put("第三名|单", "01").put("第三名|双", "01").put("第三名|龙", "02")
			.put("第三名|虎", "02")

			.put("第四名|1", "00").put("第四名|2", "00").put("第四名|3", "00").put("第四名|4", "00").put("第四名|5", "00")
			.put("第四名|6", "00").put("第四名|7", "00").put("第四名|8", "00").put("第四名|9", "00").put("第四名|10", "00")
			.put("第四名|大", "01").put("第四名|小", "01").put("第四名|单", "01").put("第四名|双", "01").put("第四名|龙", "02")
			.put("第四名|虎", "02")

			.put("第五名|1", "00").put("第五名|2", "00").put("第五名|3", "00").put("第五名|4", "00").put("第五名|5", "00")
			.put("第五名|6", "00").put("第五名|7", "00").put("第五名|8", "00").put("第五名|9", "00").put("第五名|10", "00")
			.put("第五名|大", "01").put("第五名|小", "01").put("第五名|单", "01").put("第五名|双", "01").put("第五名|龙", "02")
			.put("第五名|虎", "02")

			.put("第六名|1", "00").put("第六名|2", "00").put("第六名|3", "00").put("第六名|4", "00").put("第六名|5", "00")
			.put("第六名|6", "00").put("第六名|7", "00").put("第六名|8", "00").put("第六名|9", "00").put("第六名|10", "00")
			.put("第六名|大", "01").put("第六名|小", "01").put("第六名|单", "01").put("第六名|双", "01")

			.put("第七名|1", "00").put("第七名|2", "00").put("第七名|3", "00").put("第七名|4", "00").put("第七名|5", "00")
			.put("第七名|6", "00").put("第七名|7", "00").put("第七名|8", "00").put("第七名|9", "00").put("第七名|10", "00")
			.put("第七名|大", "01").put("第七名|小", "01").put("第七名|单", "01").put("第七名|双", "01")

			.put("第八名|1", "00").put("第八名|2", "00").put("第八名|3", "00").put("第八名|4", "00").put("第八名|5", "00")
			.put("第八名|6", "00").put("第八名|7", "00").put("第八名|8", "00").put("第八名|9", "00").put("第八名|10", "00")
			.put("第八名|大", "01").put("第八名|小", "01").put("第八名|单", "01").put("第八名|双", "01")

			.put("第九名|1", "00").put("第九名|2", "00").put("第九名|3", "00").put("第九名|4", "00").put("第九名|5", "00")
			.put("第九名|6", "00").put("第九名|7", "00").put("第九名|8", "00").put("第九名|9", "00").put("第九名|10", "00")
			.put("第九名|大", "01").put("第九名|小", "01").put("第九名|单", "01").put("第九名|双", "01")

			.put("第十名|1", "00").put("第十名|2", "00").put("第十名|3", "00").put("第十名|4", "00").put("第十名|5", "00")
			.put("第十名|6", "00").put("第十名|7", "00").put("第十名|8", "00").put("第十名|9", "00").put("第十名|10", "00")
			.put("第十名|大", "01").put("第十名|小", "01").put("第十名|单", "01").put("第十名|双", "01")

			.put("冠亚|3", "04").put("冠亚|4", "04").put("冠亚|5", "04").put("冠亚|6", "04").put("冠亚|7", "04").put("冠亚|8", "04")
			.put("冠亚|9", "04").put("冠亚|10", "04").put("冠亚|11", "04").put("冠亚|12", "04").put("冠亚|13", "04")
			.put("冠亚|14", "04").put("冠亚|15", "04").put("冠亚|16", "04").put("冠亚|17", "04").put("冠亚|18", "04")
			.put("冠亚|19", "04").put("冠亚|大", "03").put("冠亚|小", "03").put("冠亚|单", "03").put("冠亚|双", "03").build();

}
