package com.common.config.handicap;

import com.google.common.collect.ImmutableMap;

import java.util.Map;

/**
 * @Description:
 * @Author: wwj
 * @Date: 2019/12/30 11:27
 * @Email: 97085010@qq.com
 * @Version: v1.0
 */
public interface NewWsBallConfig {


	/**
	 * 投注信息
	 */
	Map<String, String> BET_INFO_CODE = ImmutableMap.<String, String>builder().put("第1球-0", "第一球|0").put("第1球-1", "第一球|1")
			.put("第1球-2", "第一球|2").put("第1球-3", "第一球|3").put("第1球-4", "第一球|4").put("第1球-5", "第一球|5")
			.put("第1球-6", "第一球|6").put("第1球-7", "第一球|7").put("第1球-8", "第一球|8").put("第1球-9", "第一球|9")
			.put("第1球-單", "第一球|单").put("第1球-雙", "第一球|双").put("第1球-大", "第一球|大").put("第1球-小", "第一球|小")

			.put("第2球-0", "第二球|0").put("第2球-1", "第二球|1").put("第2球-2", "第二球|2").put("第2球-3", "第二球|3")
			.put("第2球-4", "第二球|4").put("第2球-5", "第二球|5").put("第2球-6", "第二球|6").put("第2球-7", "第二球|7")
			.put("第2球-8", "第二球|8").put("第2球-9", "第二球|9").put("第2球-單", "第二球|单").put("第2球-雙", "第二球|双")
			.put("第2球-大", "第二球|大").put("第2球-小", "第二球|小")

			.put("第3球-0", "第三球|0").put("第3球-1", "第三球|1").put("第3球-2", "第三球|2").put("第3球-3", "第三球|3")
			.put("第3球-4", "第三球|4").put("第3球-5", "第三球|5").put("第3球-6", "第三球|6").put("第3球-7", "第三球|7")
			.put("第3球-8", "第三球|8").put("第3球-9", "第三球|9").put("第3球-單", "第三球|单").put("第3球-雙", "第三球|双")
			.put("第3球-大", "第三球|大").put("第3球-小", "第三球|小")

			.put("第4球-0", "第四球|0").put("第4球-1", "第四球|1").put("第4球-2", "第四球|2").put("第4球-3", "第四球|3")
			.put("第4球-4", "第四球|4").put("第4球-5", "第四球|5").put("第4球-6", "第四球|6").put("第4球-7", "第四球|7")
			.put("第4球-8", "第四球|8").put("第4球-9", "第四球|9").put("第4球-單", "第四球|单").put("第4球-雙", "第四球|双")
			.put("第4球-大", "第四球|大").put("第4球-小", "第四球|小")

			.put("第5球-0", "第五球|0").put("第5球-1", "第五球|1").put("第5球-2", "第五球|2").put("第5球-3", "第五球|3")
			.put("第5球-4", "第五球|4").put("第5球-5", "第五球|5").put("第5球-6", "第五球|6").put("第5球-7", "第五球|7")
			.put("第5球-8", "第五球|8").put("第5球-9", "第五球|9").put("第5球-單", "第五球|单").put("第5球-雙", "第五球|双")
			.put("第5球-大", "第五球|大").put("第5球-小", "第五球|小")

			.put("總和-大", "总和|大").put("總和-小", "总和|小").put("總和-單", "总和|单").put("總和-雙", "总和|双")
			.put("總和-龍", "龙虎和|龙").put("總和-虎", "龙虎和|虎").put("總和-和", "龙虎和|和")
			.put("前三-豹子", "前三|豹子").put("中三-豹子", "中三|豹子").put("后三-豹子", "后三|豹子")
			.put("前三-順子", "前三|顺子").put("中三-順子", "中三|顺子").put("后三-順子", "后三|顺子")
			.put("前三-對子", "前三|对子").put("中三-對子", "中三|对子").put("后三-對子", "后三|对子")
			.put("前三-半順", "前三|半顺").put("中三-半順", "中三|半顺").put("后三-半順", "后三|半顺")
			.put("前三-雜六", "前三|杂六").put("中三-雜六", "中三|杂六").put("后三-雜六", "后三|杂六").build();


	Map<String, String> BET_LIMIT_CODE = ImmutableMap.<String, String>builder().put("第一球|0", "00").put("第一球|1", "00")
			.put("第一球|2", "00").put("第一球|3", "00").put("第一球|4", "00").put("第一球|5", "00").put("第一球|6", "00")
			.put("第一球|7", "00").put("第一球|8", "00").put("第一球|9", "00").put("第一球|大", "01").put("第一球|小", "01")
			.put("第一球|单", "01").put("第一球|双", "01")

			.put("第二球|0", "00").put("第二球|1", "00").put("第二球|2", "00").put("第二球|3", "00").put("第二球|4", "00")
			.put("第二球|5", "00").put("第二球|6", "00").put("第二球|7", "00").put("第二球|8", "00").put("第二球|9", "00")
			.put("第二球|大", "01").put("第二球|小", "01").put("第二球|单", "01").put("第二球|双", "01")

			.put("第三球|0", "00").put("第三球|1", "00").put("第三球|2", "00").put("第三球|3", "00").put("第三球|4", "00")
			.put("第三球|5", "00").put("第三球|6", "00").put("第三球|7", "00").put("第三球|8", "00").put("第三球|9", "00")
			.put("第三球|大", "01").put("第三球|小", "01").put("第三球|单", "01").put("第三球|双", "01")

			.put("第四球|0", "00").put("第四球|1", "00").put("第四球|2", "00").put("第四球|3", "00").put("第四球|4", "00")
			.put("第四球|5", "00").put("第四球|6", "00").put("第四球|7", "00").put("第四球|8", "00").put("第四球|9", "00")
			.put("第四球|大", "01").put("第四球|小", "01").put("第四球|单", "01").put("第四球|双", "01")

			.put("第五球|0", "00").put("第五球|1", "00").put("第五球|2", "00").put("第五球|3", "00").put("第五球|4", "00")
			.put("第五球|5", "00").put("第五球|6", "00").put("第五球|7", "00").put("第五球|8", "00").put("第五球|9", "00")
			.put("第五球|大", "01").put("第五球|小", "01").put("第五球|单", "01").put("第五球|双", "01")

			.put("总和|大", "01").put("总和|小", "01").put("总和|单", "01").put("总和|双", "01").put("龙虎和|龙", "02")
			.put("龙虎和|虎", "02").put("龙虎和|和", "03").put("前三|豹子", "04").put("中三|豹子", "04").put("后三|豹子", "04")
			.put("前三|顺子", "04").put("中三|顺子", "04").put("后三|顺子", "04").put("前三|对子", "04").put("中三|对子", "04")
			.put("后三|对子", "04").put("前三|半顺", "04").put("中三|半顺", "04").put("后三|半顺", "04").put("前三|杂六", "04")
			.put("中三|杂六", "04").put("后三|杂六", "04").build();
}
