package com.common.config.handicap;
import com.google.common.collect.ImmutableMap;

import java.util.Map;

/**
 * 盘口号码类
 * @Author: Dongming
 * @Date: 2020-06-06 16:00
 * @Email: job.dongming@foxmail.com
 * @Version: v1.0
 */
public interface NumberConfig {

	/**
	 * 投注限制
	 */
	Map<String, String> ITEM_TYPE = ImmutableMap.<String, String>builder().put("第一名|1", "0").put("第一名|2", "0")
			.put("第一名|3", "0").put("第一名|4", "0").put("第一名|5", "0").put("第一名|6", "0").put("第一名|7", "0").put("第一名|8", "0")
			.put("第一名|9", "0").put("第一名|10", "0").put("第一名|大", "1").put("第一名|小", "1").put("第一名|单", "1")
			.put("第一名|双", "1").put("第一名|龙", "2").put("第一名|虎", "2")

			.put("第二名|1", "0").put("第二名|2", "0").put("第二名|3", "0").put("第二名|4", "0").put("第二名|5", "0").put("第二名|6", "0")
			.put("第二名|7", "0").put("第二名|8", "0").put("第二名|9", "0").put("第二名|10", "0").put("第二名|大", "1")
			.put("第二名|小", "1").put("第二名|单", "1").put("第二名|双", "1").put("第二名|龙", "2").put("第二名|虎", "2")

			.put("第三名|1", "0").put("第三名|2", "0").put("第三名|3", "0").put("第三名|4", "0").put("第三名|5", "0").put("第三名|6", "0")
			.put("第三名|7", "0").put("第三名|8", "0").put("第三名|9", "0").put("第三名|10", "0").put("第三名|大", "1")
			.put("第三名|小", "1").put("第三名|单", "1").put("第三名|双", "1").put("第三名|龙", "2").put("第三名|虎", "2")

			.put("第四名|1", "0").put("第四名|2", "0").put("第四名|3", "0").put("第四名|4", "0").put("第四名|5", "0").put("第四名|6", "0")
			.put("第四名|7", "0").put("第四名|8", "0").put("第四名|9", "0").put("第四名|10", "0").put("第四名|大", "1")
			.put("第四名|小", "1").put("第四名|单", "1").put("第四名|双", "1").put("第四名|龙", "2").put("第四名|虎", "2")

			.put("第五名|1", "0").put("第五名|2", "0").put("第五名|3", "0").put("第五名|4", "0").put("第五名|5", "0").put("第五名|6", "0")
			.put("第五名|7", "0").put("第五名|8", "0").put("第五名|9", "0").put("第五名|10", "0").put("第五名|大", "1")
			.put("第五名|小", "1").put("第五名|单", "1").put("第五名|双", "1").put("第五名|龙", "2").put("第五名|虎", "2")

			.put("第六名|1", "0").put("第六名|2", "0").put("第六名|3", "0").put("第六名|4", "0").put("第六名|5", "0").put("第六名|6", "0")
			.put("第六名|7", "0").put("第六名|8", "0").put("第六名|9", "0").put("第六名|10", "0").put("第六名|大", "1")
			.put("第六名|小", "1").put("第六名|单", "1").put("第六名|双", "1")

			.put("第七名|1", "0").put("第七名|2", "0").put("第七名|3", "0").put("第七名|4", "0").put("第七名|5", "0").put("第七名|6", "0")
			.put("第七名|7", "0").put("第七名|8", "0").put("第七名|9", "0").put("第七名|10", "0").put("第七名|大", "1")
			.put("第七名|小", "1").put("第七名|单", "1").put("第七名|双", "1")

			.put("第八名|1", "0").put("第八名|2", "0").put("第八名|3", "0").put("第八名|4", "0").put("第八名|5", "0").put("第八名|6", "0")
			.put("第八名|7", "0").put("第八名|8", "0").put("第八名|9", "0").put("第八名|10", "0").put("第八名|大", "1")
			.put("第八名|小", "1").put("第八名|单", "1").put("第八名|双", "1")

			.put("第九名|1", "0").put("第九名|2", "0").put("第九名|3", "0").put("第九名|4", "0").put("第九名|5", "0").put("第九名|6", "0")
			.put("第九名|7", "0").put("第九名|8", "0").put("第九名|9", "0").put("第九名|10", "0").put("第九名|大", "1")
			.put("第九名|小", "1").put("第九名|单", "1").put("第九名|双", "1")

			.put("第十名|1", "0").put("第十名|2", "0").put("第十名|3", "0").put("第十名|4", "0").put("第十名|5", "0").put("第十名|6", "0")
			.put("第十名|7", "0").put("第十名|8", "0").put("第十名|9", "0").put("第十名|10", "0").put("第十名|大", "1")
			.put("第十名|小", "1").put("第十名|单", "1").put("第十名|双", "1")

			.put("冠亚|3", "4").put("冠亚|4", "4").put("冠亚|5", "4").put("冠亚|6", "4").put("冠亚|7", "4").put("冠亚|8", "4")
			.put("冠亚|9", "4").put("冠亚|10", "4").put("冠亚|11", "4").put("冠亚|12", "4").put("冠亚|13", "4").put("冠亚|14", "4")
			.put("冠亚|15", "4").put("冠亚|16", "4").put("冠亚|17", "4").put("冠亚|18", "4").put("冠亚|19", "4").put("冠亚|大", "3")
			.put("冠亚|小", "3").put("冠亚|单", "3").put("冠亚|双", "3").build();

}
