package com.common.config.handicap;

import com.google.common.collect.ImmutableMap;

import java.util.Map;

/**
 * @Description:
 * @Author: wwj
 * @Date: 2019/12/27 16:08
 * @Email: 97085010@qq.com
 * @Version: v1.0
 */
public interface UnNumberConfig {

	/**
	 * 投注限制
	 */
	Map<String, String> BET_LIMIT_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "00").put("第一名|2", "00")
			.put("第一名|3", "00").put("第一名|4", "00").put("第一名|5", "00").put("第一名|6", "00").put("第一名|7", "00")
			.put("第一名|8", "00").put("第一名|9", "00").put("第一名|10", "00").put("第一名|大", "01").put("第一名|小", "01")
			.put("第一名|单", "01").put("第一名|双", "01").put("第一名|龙", "02").put("第一名|虎", "02")

			.put("第二名|1", "00").put("第二名|2", "00").put("第二名|3", "00").put("第二名|4", "00").put("第二名|5", "00")
			.put("第二名|6", "00").put("第二名|7", "00").put("第二名|8", "00").put("第二名|9", "00").put("第二名|10", "00")
			.put("第二名|大", "01").put("第二名|小", "01").put("第二名|单", "01").put("第二名|双", "01").put("第二名|龙", "02")
			.put("第二名|虎", "02")

			.put("第三名|1", "00").put("第三名|2", "00").put("第三名|3", "00").put("第三名|4", "00").put("第三名|5", "00")
			.put("第三名|6", "00").put("第三名|7", "00").put("第三名|8", "00").put("第三名|9", "00").put("第三名|10", "00")
			.put("第三名|大", "01").put("第三名|小", "01").put("第三名|单", "01").put("第三名|双", "01").put("第三名|龙", "02")
			.put("第三名|虎", "02")

			.put("第四名|1", "00").put("第四名|2", "00").put("第四名|3", "00").put("第四名|4", "00").put("第四名|5", "00")
			.put("第四名|6", "00").put("第四名|7", "00").put("第四名|8", "00").put("第四名|9", "00").put("第四名|10", "00")
			.put("第四名|大", "01").put("第四名|小", "01").put("第四名|单", "01").put("第四名|双", "01").put("第四名|龙", "02")
			.put("第四名|虎", "02")

			.put("第五名|1", "00").put("第五名|2", "00").put("第五名|3", "00").put("第五名|4", "00").put("第五名|5", "00")
			.put("第五名|6", "00").put("第五名|7", "00").put("第五名|8", "00").put("第五名|9", "00").put("第五名|10", "00")
			.put("第五名|大", "01").put("第五名|小", "01").put("第五名|单", "01").put("第五名|双", "01").put("第五名|龙", "02")
			.put("第五名|虎", "02")

			.put("第六名|1", "00").put("第六名|2", "00").put("第六名|3", "00").put("第六名|4", "00").put("第六名|5", "00")
			.put("第六名|6", "00").put("第六名|7", "00").put("第六名|8", "00").put("第六名|9", "00").put("第六名|10", "00")
			.put("第六名|大", "01").put("第六名|小", "01").put("第六名|单", "01").put("第六名|双", "01")

			.put("第七名|1", "00").put("第七名|2", "00").put("第七名|3", "00").put("第七名|4", "00").put("第七名|5", "00")
			.put("第七名|6", "00").put("第七名|7", "00").put("第七名|8", "00").put("第七名|9", "00").put("第七名|10", "00")
			.put("第七名|大", "01").put("第七名|小", "01").put("第七名|单", "01").put("第七名|双", "01")

			.put("第八名|1", "00").put("第八名|2", "00").put("第八名|3", "00").put("第八名|4", "00").put("第八名|5", "00")
			.put("第八名|6", "00").put("第八名|7", "00").put("第八名|8", "00").put("第八名|9", "00").put("第八名|10", "00")
			.put("第八名|大", "01").put("第八名|小", "01").put("第八名|单", "01").put("第八名|双", "01")

			.put("第九名|1", "00").put("第九名|2", "00").put("第九名|3", "00").put("第九名|4", "00").put("第九名|5", "00")
			.put("第九名|6", "00").put("第九名|7", "00").put("第九名|8", "00").put("第九名|9", "00").put("第九名|10", "00")
			.put("第九名|大", "01").put("第九名|小", "01").put("第九名|单", "01").put("第九名|双", "01")

			.put("第十名|1", "00").put("第十名|2", "00").put("第十名|3", "00").put("第十名|4", "00").put("第十名|5", "00")
			.put("第十名|6", "00").put("第十名|7", "00").put("第十名|8", "00").put("第十名|9", "00").put("第十名|10", "00")
			.put("第十名|大", "01").put("第十名|小", "01").put("第十名|单", "01").put("第十名|双", "01")

			.put("冠亚|3", "03").put("冠亚|4", "03").put("冠亚|5", "03").put("冠亚|6", "03").put("冠亚|7", "03").put("冠亚|8", "03")
			.put("冠亚|9", "03").put("冠亚|10", "03").put("冠亚|11", "03").put("冠亚|12", "03").put("冠亚|13", "03")
			.put("冠亚|14", "03").put("冠亚|15", "03").put("冠亚|16", "03").put("冠亚|17", "03").put("冠亚|18", "03")
			.put("冠亚|19", "03").put("冠亚|大", "04").put("冠亚|小", "04").put("冠亚|单", "05").put("冠亚|双", "05").build();

}
