package com.ibm.old.v1.common.doming.configs;
import com.google.common.collect.ImmutableMap;

import java.util.Map;
/**
 * @Description: HQ盘口默认值
 * @Author: zjj
 * @Date: 2019-08-12 10:33
 * @Email: 543974681@qq.com
 * @Version: v1.0
 */
public interface HqConfig {

	/**
	 * 游戏code
	 */
	Map<String, String> GAME_CODE_MAP = ImmutableMap.<String, String>builder().put("PK10", "2").put("XYFT", "8")
			.build();

	//TODO,pk10
	/**
	 * 游戏code
	 */
	Map<String, String> PK10_ODDS_CODE = ImmutableMap.<String, String>builder().put("ballNO",
			"[\"2012\",\"2013\",\"2014\",\"2011\",\"2022\",\"2023\",\"2024\",\"2021\",\"2032\",\"2033\",\"2034\",\"2031\",\"2042\",\"2043\",\"2044\",\"2041\",\"2052\",\"2053\",\"2054\",\"2051\",\"2062\",\"2063\",\"2061\",\"2072\",\"2073\",\"2071\",\"2082\",\"2083\",\"2081\",\"2092\",\"2093\",\"2091\",\"2102\",\"2103\",\"2101\"]")
			.put("sumDT", "[\"2001\",\"2002\",\"2003\"]").build();

	/**
	 * 所有球码code
	 */
	Map<String, String> PK10_BALL_BET_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "201101")
			.put("第一名|2", "201102").put("第一名|3", "201103").put("第一名|4", "201104").put("第一名|5", "201105")
			.put("第一名|6", "201106").put("第一名|7", "201107").put("第一名|8", "201108").put("第一名|9", "201109")
			.put("第一名|10", "201110").put("第一名|大", "201201").put("第一名|小", "201202").put("第一名|单", "201301")
			.put("第一名|双", "201302").put("第一名|龙", "201401").put("第一名|虎", "201402")

			.put("第二名|1", "202101").put("第二名|2", "202102").put("第二名|3", "202103").put("第二名|4", "202104")
			.put("第二名|5", "202105").put("第二名|6", "202106").put("第二名|7", "202107").put("第二名|8", "202108")
			.put("第二名|9", "202109").put("第二名|10", "202110").put("第二名|大", "202201").put("第二名|小", "202202")
			.put("第二名|单", "202301").put("第二名|双", "202302").put("第二名|龙", "202401").put("第二名|虎", "202402")

			.put("第三名|1", "203101").put("第三名|2", "203102").put("第三名|3", "203103").put("第三名|4", "203104")
			.put("第三名|5", "203105").put("第三名|6", "203106").put("第三名|7", "203107").put("第三名|8", "203108")
			.put("第三名|9", "203109").put("第三名|10", "203110").put("第三名|大", "203201").put("第三名|小", "203202")
			.put("第三名|单", "203301").put("第三名|双", "203302").put("第三名|龙", "203401").put("第三名|虎", "203402")

			.put("第四名|1", "204101").put("第四名|2", "204102").put("第四名|3", "204103").put("第四名|4", "204104")
			.put("第四名|5", "204105").put("第四名|6", "204106").put("第四名|7", "204107").put("第四名|8", "204108")
			.put("第四名|9", "204109").put("第四名|10", "204110").put("第四名|大", "204201").put("第四名|小", "204202")
			.put("第四名|单", "204301").put("第四名|双", "204302").put("第四名|龙", "204401").put("第四名|虎", "204402")

			.put("第五名|1", "205101").put("第五名|2", "205102").put("第五名|3", "205103").put("第五名|4", "205104")
			.put("第五名|5", "205105").put("第五名|6", "205106").put("第五名|7", "205107").put("第五名|8", "205108")
			.put("第五名|9", "205109").put("第五名|10", "205110").put("第五名|大", "205201").put("第五名|小", "205202")
			.put("第五名|单", "205301").put("第五名|双", "205302").put("第五名|龙", "205401").put("第五名|虎", "205402")

			.put("第六名|1", "206101").put("第六名|2", "206102").put("第六名|3", "206103").put("第六名|4", "206104")
			.put("第六名|5", "206105").put("第六名|6", "206106").put("第六名|7", "206107").put("第六名|8", "206108")
			.put("第六名|9", "206109").put("第六名|10", "206110").put("第六名|大", "206201").put("第六名|小", "206202")
			.put("第六名|单", "206301").put("第六名|双", "206302")

			.put("第七名|1", "207101").put("第七名|2", "207102").put("第七名|3", "207103").put("第七名|4", "207104")
			.put("第七名|5", "207105").put("第七名|6", "207106").put("第七名|7", "207107").put("第七名|8", "207108")
			.put("第七名|9", "207109").put("第七名|10", "207110").put("第七名|大", "207201").put("第七名|小", "207202")
			.put("第七名|单", "207301").put("第七名|双", "207302")

			.put("第八名|1", "208101").put("第八名|2", "208102").put("第八名|3", "208103").put("第八名|4", "208104")
			.put("第八名|5", "208105").put("第八名|6", "208106").put("第八名|7", "208107").put("第八名|8", "208108")
			.put("第八名|9", "208109").put("第八名|10", "208110").put("第八名|大", "208201").put("第八名|小", "208202")
			.put("第八名|单", "208301").put("第八名|双", "208302")

			.put("第九名|1", "209101").put("第九名|2", "209102").put("第九名|3", "209103").put("第九名|4", "209104")
			.put("第九名|5", "209105").put("第九名|6", "209106").put("第九名|7", "209107").put("第九名|8", "209108")
			.put("第九名|9", "209109").put("第九名|10", "209110").put("第九名|大", "209201").put("第九名|小", "209202")
			.put("第九名|单", "209301").put("第九名|双", "209302")

			.put("第十名|1", "210101").put("第十名|2", "210102").put("第十名|3", "210103").put("第十名|4", "210104")
			.put("第十名|5", "210105").put("第十名|6", "210106").put("第十名|7", "210107").put("第十名|8", "210108")
			.put("第十名|9", "210109").put("第十名|10", "210110").put("第十名|大", "210201").put("第十名|小", "210202")
			.put("第十名|单", "210301").put("第十名|双", "210302")

			.put("冠亚|3", "200103").put("冠亚|4", "200104").put("冠亚|5", "200105").put("冠亚|6", "200106")
			.put("冠亚|7", "200107").put("冠亚|8", "200108").put("冠亚|9", "200109").put("冠亚|10", "200110")
			.put("冠亚|11", "200111").put("冠亚|12", "200112").put("冠亚|13", "200113").put("冠亚|14", "200114")
			.put("冠亚|15", "200115").put("冠亚|16", "200116").put("冠亚|17", "200117").put("冠亚|18", "200118")
			.put("冠亚|19", "200119").put("冠亚|大", "200201").put("冠亚|小", "200202").put("冠亚|单", "200301")
			.put("冠亚|双", "200302").build();

	/**
	 * 球码code  特号+两面盘
	 */
	Map<String, String> PK10_BALL_NO_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "201101")
			.put("第一名|2", "201102").put("第一名|3", "201103").put("第一名|4", "201104").put("第一名|5", "201105")
			.put("第一名|6", "201106").put("第一名|7", "201107").put("第一名|8", "201108").put("第一名|9", "201109")
			.put("第一名|10", "201110").put("第一名|大", "201201").put("第一名|小", "201202").put("第一名|单", "201301")
			.put("第一名|双", "201302").put("第一名|龙", "201401").put("第一名|虎", "201402")

			.put("第二名|1", "202101").put("第二名|2", "202102").put("第二名|3", "202103").put("第二名|4", "202104")
			.put("第二名|5", "202105").put("第二名|6", "202106").put("第二名|7", "202107").put("第二名|8", "202108")
			.put("第二名|9", "202109").put("第二名|10", "202110").put("第二名|大", "202201").put("第二名|小", "202202")
			.put("第二名|单", "202301").put("第二名|双", "202302").put("第二名|龙", "202401").put("第二名|虎", "202402")

			.put("第三名|1", "203101").put("第三名|2", "203102").put("第三名|3", "203103").put("第三名|4", "203104")
			.put("第三名|5", "203105").put("第三名|6", "203106").put("第三名|7", "203107").put("第三名|8", "203108")
			.put("第三名|9", "203109").put("第三名|10", "203110").put("第三名|大", "203201").put("第三名|小", "203202")
			.put("第三名|单", "203301").put("第三名|双", "203302").put("第三名|龙", "203401").put("第三名|虎", "203402")

			.put("第四名|1", "204101").put("第四名|2", "204102").put("第四名|3", "204103").put("第四名|4", "204104")
			.put("第四名|5", "204105").put("第四名|6", "204106").put("第四名|7", "204107").put("第四名|8", "204108")
			.put("第四名|9", "204109").put("第四名|10", "204110").put("第四名|大", "204201").put("第四名|小", "204202")
			.put("第四名|单", "204301").put("第四名|双", "204302").put("第四名|龙", "204401").put("第四名|虎", "204402")

			.put("第五名|1", "205101").put("第五名|2", "205102").put("第五名|3", "205103").put("第五名|4", "205104")
			.put("第五名|5", "205105").put("第五名|6", "205106").put("第五名|7", "205107").put("第五名|8", "205108")
			.put("第五名|9", "205109").put("第五名|10", "205110").put("第五名|大", "205201").put("第五名|小", "205202")
			.put("第五名|单", "205301").put("第五名|双", "205302").put("第五名|龙", "205401").put("第五名|虎", "205402")

			.put("第六名|1", "206101").put("第六名|2", "206102").put("第六名|3", "206103").put("第六名|4", "206104")
			.put("第六名|5", "206105").put("第六名|6", "206106").put("第六名|7", "206107").put("第六名|8", "206108")
			.put("第六名|9", "206109").put("第六名|10", "206110").put("第六名|大", "206201").put("第六名|小", "206202")
			.put("第六名|单", "206301").put("第六名|双", "206302")

			.put("第七名|1", "207101").put("第七名|2", "207102").put("第七名|3", "207103").put("第七名|4", "207104")
			.put("第七名|5", "207105").put("第七名|6", "207106").put("第七名|7", "207107").put("第七名|8", "207108")
			.put("第七名|9", "207109").put("第七名|10", "207110").put("第七名|大", "207201").put("第七名|小", "207202")
			.put("第七名|单", "207301").put("第七名|双", "207302")

			.put("第八名|1", "208101").put("第八名|2", "208102").put("第八名|3", "208103").put("第八名|4", "208104")
			.put("第八名|5", "208105").put("第八名|6", "208106").put("第八名|7", "208107").put("第八名|8", "208108")
			.put("第八名|9", "208109").put("第八名|10", "208110").put("第八名|大", "208201").put("第八名|小", "208202")
			.put("第八名|单", "208301").put("第八名|双", "208302")

			.put("第九名|1", "209101").put("第九名|2", "209102").put("第九名|3", "209103").put("第九名|4", "209104")
			.put("第九名|5", "209105").put("第九名|6", "209106").put("第九名|7", "209107").put("第九名|8", "209108")
			.put("第九名|9", "209109").put("第九名|10", "209110").put("第九名|大", "209201").put("第九名|小", "209202")
			.put("第九名|单", "209301").put("第九名|双", "209302")

			.put("第十名|1", "210101").put("第十名|2", "210102").put("第十名|3", "210103").put("第十名|4", "210104")
			.put("第十名|5", "210105").put("第十名|6", "210106").put("第十名|7", "210107").put("第十名|8", "210108")
			.put("第十名|9", "210109").put("第十名|10", "210110").put("第十名|大", "210201").put("第十名|小", "210202")
			.put("第十名|单", "210301").put("第十名|双", "210302").build();

	/**
	 * 球码code  冠亚盘
	 */
	Map<String, String> PK10_SUM_DT_CODE = ImmutableMap.<String, String>builder().put("冠亚|3", "200103")
			.put("冠亚|4", "200104").put("冠亚|5", "200105").put("冠亚|6", "200106").put("冠亚|7", "200107")
			.put("冠亚|8", "200108").put("冠亚|9", "200109").put("冠亚|10", "200110").put("冠亚|11", "200111")
			.put("冠亚|12", "200112").put("冠亚|13", "200113").put("冠亚|14", "200114").put("冠亚|15", "200115")
			.put("冠亚|16", "200116").put("冠亚|17", "200117").put("冠亚|18", "200118").put("冠亚|19", "200119")
			.put("冠亚|大", "200201").put("冠亚|小", "200202").put("冠亚|单", "200301").put("冠亚|双", "200302").build();

	//TODO,幸运飞艇
	/**
	 * 游戏code
	 */
	Map<String, String> XYFT_ODDS_CODE = ImmutableMap.<String, String>builder().put("ballNO",
			"[\"8012\",\"8013\",\"8014\",\"8011\",\"8022\",\"8023\",\"8024\",\"8021\",\"8032\",\"8033\",\"8034\",\"8031\",\"8042\",\"8043\",\"8044\",\"8041\",\"8052\",\"8053\",\"8054\",\"8051\",\"8062\",\"8063\",\"8061\",\"8072\",\"8073\",\"8071\",\"8082\",\"8083\",\"8081\",\"8092\",\"8093\",\"8091\",\"8102\",\"8103\",\"8101\"]")
			.put("sumDT", "[\"8001\",\"8002\",\"8003\"]").build();

	/**
	 * 所有球码code
	 */
	Map<String, String> XYFT_BALL_BET_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "801101")
			.put("第一名|2", "801102").put("第一名|3", "801103").put("第一名|4", "801104").put("第一名|5", "801105")
			.put("第一名|6", "801106").put("第一名|7", "801107").put("第一名|8", "801108").put("第一名|9", "801109")
			.put("第一名|10", "801110").put("第一名|大", "801201").put("第一名|小", "801202").put("第一名|单", "801301")
			.put("第一名|双", "801302").put("第一名|龙", "801401").put("第一名|虎", "801402")

			.put("第二名|1", "808101").put("第二名|2", "808102").put("第二名|3", "808103").put("第二名|4", "808104")
			.put("第二名|5", "808105").put("第二名|6", "808106").put("第二名|7", "808107").put("第二名|8", "808108")
			.put("第二名|9", "808109").put("第二名|10", "802110").put("第二名|大", "802201").put("第二名|小", "802202")
			.put("第二名|单", "802301").put("第二名|双", "802302").put("第二名|龙", "802401").put("第二名|虎", "802402")

			.put("第三名|1", "803101").put("第三名|2", "803102").put("第三名|3", "803103").put("第三名|4", "803104")
			.put("第三名|5", "803105").put("第三名|6", "803106").put("第三名|7", "803107").put("第三名|8", "803108")
			.put("第三名|9", "803109").put("第三名|10", "803110").put("第三名|大", "803201").put("第三名|小", "803202")
			.put("第三名|单", "803301").put("第三名|双", "803302").put("第三名|龙", "803401").put("第三名|虎", "803402")

			.put("第四名|1", "804101").put("第四名|2", "804102").put("第四名|3", "804103").put("第四名|4", "804104")
			.put("第四名|5", "804105").put("第四名|6", "804106").put("第四名|7", "804107").put("第四名|8", "804108")
			.put("第四名|9", "804109").put("第四名|10", "804110").put("第四名|大", "804201").put("第四名|小", "804202")
			.put("第四名|单", "804301").put("第四名|双", "804302").put("第四名|龙", "804401").put("第四名|虎", "804402")

			.put("第五名|1", "805101").put("第五名|2", "805102").put("第五名|3", "805103").put("第五名|4", "805104")
			.put("第五名|5", "805105").put("第五名|6", "805106").put("第五名|7", "805107").put("第五名|8", "805108")
			.put("第五名|9", "805109").put("第五名|10", "805110").put("第五名|大", "805201").put("第五名|小", "805202")
			.put("第五名|单", "805301").put("第五名|双", "805302").put("第五名|龙", "805401").put("第五名|虎", "805402")

			.put("第六名|1", "806101").put("第六名|2", "806102").put("第六名|3", "806103").put("第六名|4", "806104")
			.put("第六名|5", "806105").put("第六名|6", "806106").put("第六名|7", "806107").put("第六名|8", "806108")
			.put("第六名|9", "806109").put("第六名|10", "806110").put("第六名|大", "806201").put("第六名|小", "806202")
			.put("第六名|单", "806301").put("第六名|双", "806302")

			.put("第七名|1", "807101").put("第七名|2", "807102").put("第七名|3", "807103").put("第七名|4", "807104")
			.put("第七名|5", "807105").put("第七名|6", "807106").put("第七名|7", "807107").put("第七名|8", "807108")
			.put("第七名|9", "807109").put("第七名|10", "807110").put("第七名|大", "807201").put("第七名|小", "807202")
			.put("第七名|单", "807301").put("第七名|双", "807302")

			.put("第八名|1", "808101").put("第八名|2", "808102").put("第八名|3", "808103").put("第八名|4", "808104")
			.put("第八名|5", "808105").put("第八名|6", "808106").put("第八名|7", "808107").put("第八名|8", "808108")
			.put("第八名|9", "808109").put("第八名|10", "808110").put("第八名|大", "808201").put("第八名|小", "808202")
			.put("第八名|单", "808301").put("第八名|双", "808302")

			.put("第九名|1", "809101").put("第九名|2", "809102").put("第九名|3", "809103").put("第九名|4", "809104")
			.put("第九名|5", "809105").put("第九名|6", "809106").put("第九名|7", "809107").put("第九名|8", "809108")
			.put("第九名|9", "809109").put("第九名|10", "809110").put("第九名|大", "809201").put("第九名|小", "809202")
			.put("第九名|单", "809301").put("第九名|双", "809302")

			.put("第十名|1", "810101").put("第十名|2", "810102").put("第十名|3", "810103").put("第十名|4", "810104")
			.put("第十名|5", "810105").put("第十名|6", "810106").put("第十名|7", "810107").put("第十名|8", "810108")
			.put("第十名|9", "810109").put("第十名|10", "810110").put("第十名|大", "810201").put("第十名|小", "810202")
			.put("第十名|单", "810301").put("第十名|双", "810302")

			.put("冠亚|3", "800103").put("冠亚|4", "800104").put("冠亚|5", "800105").put("冠亚|6", "800106")
			.put("冠亚|7", "800107").put("冠亚|8", "800108").put("冠亚|9", "800109").put("冠亚|10", "800110")
			.put("冠亚|11", "800111").put("冠亚|12", "800112").put("冠亚|13", "800113").put("冠亚|14", "800114")
			.put("冠亚|15", "800115").put("冠亚|16", "800116").put("冠亚|17", "800117").put("冠亚|18", "800118")
			.put("冠亚|19", "800119").put("冠亚|大", "800201").put("冠亚|小", "800202").put("冠亚|单", "800301")
			.put("冠亚|双", "800302").build();

	/**
	 * 球码code  特号+两面盘
	 */
	Map<String, String> XYFT_BALL_NO_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "801101")
			.put("第一名|2", "801102").put("第一名|3", "801103").put("第一名|4", "801104").put("第一名|5", "801105")
			.put("第一名|6", "801106").put("第一名|7", "801107").put("第一名|8", "801108").put("第一名|9", "801109")
			.put("第一名|10", "801110").put("第一名|大", "801201").put("第一名|小", "801202").put("第一名|单", "801301")
			.put("第一名|双", "801302").put("第一名|龙", "801401").put("第一名|虎", "801402")

			.put("第二名|1", "808101").put("第二名|2", "808102").put("第二名|3", "808103").put("第二名|4", "808104")
			.put("第二名|5", "808105").put("第二名|6", "808106").put("第二名|7", "808107").put("第二名|8", "808108")
			.put("第二名|9", "808109").put("第二名|10", "802110").put("第二名|大", "802201").put("第二名|小", "802202")
			.put("第二名|单", "802301").put("第二名|双", "802302").put("第二名|龙", "802401").put("第二名|虎", "802402")

			.put("第三名|1", "803101").put("第三名|2", "803102").put("第三名|3", "803103").put("第三名|4", "803104")
			.put("第三名|5", "803105").put("第三名|6", "803106").put("第三名|7", "803107").put("第三名|8", "803108")
			.put("第三名|9", "803109").put("第三名|10", "803110").put("第三名|大", "803201").put("第三名|小", "803202")
			.put("第三名|单", "803301").put("第三名|双", "803302").put("第三名|龙", "803401").put("第三名|虎", "803402")

			.put("第四名|1", "804101").put("第四名|2", "804102").put("第四名|3", "804103").put("第四名|4", "804104")
			.put("第四名|5", "804105").put("第四名|6", "804106").put("第四名|7", "804107").put("第四名|8", "804108")
			.put("第四名|9", "804109").put("第四名|10", "804110").put("第四名|大", "804201").put("第四名|小", "804202")
			.put("第四名|单", "804301").put("第四名|双", "804302").put("第四名|龙", "804401").put("第四名|虎", "804402")

			.put("第五名|1", "805101").put("第五名|2", "805102").put("第五名|3", "805103").put("第五名|4", "805104")
			.put("第五名|5", "805105").put("第五名|6", "805106").put("第五名|7", "805107").put("第五名|8", "805108")
			.put("第五名|9", "805109").put("第五名|10", "805110").put("第五名|大", "805201").put("第五名|小", "805202")
			.put("第五名|单", "805301").put("第五名|双", "805302").put("第五名|龙", "805401").put("第五名|虎", "805402")

			.put("第六名|1", "806101").put("第六名|2", "806102").put("第六名|3", "806103").put("第六名|4", "806104")
			.put("第六名|5", "806105").put("第六名|6", "806106").put("第六名|7", "806107").put("第六名|8", "806108")
			.put("第六名|9", "806109").put("第六名|10", "806110").put("第六名|大", "806201").put("第六名|小", "806202")
			.put("第六名|单", "806301").put("第六名|双", "806302")

			.put("第七名|1", "807101").put("第七名|2", "807102").put("第七名|3", "807103").put("第七名|4", "807104")
			.put("第七名|5", "807105").put("第七名|6", "807106").put("第七名|7", "807107").put("第七名|8", "807108")
			.put("第七名|9", "807109").put("第七名|10", "807110").put("第七名|大", "807201").put("第七名|小", "807202")
			.put("第七名|单", "807301").put("第七名|双", "807302")

			.put("第八名|1", "808101").put("第八名|2", "808102").put("第八名|3", "808103").put("第八名|4", "808104")
			.put("第八名|5", "808105").put("第八名|6", "808106").put("第八名|7", "808107").put("第八名|8", "808108")
			.put("第八名|9", "808109").put("第八名|10", "808110").put("第八名|大", "808201").put("第八名|小", "808202")
			.put("第八名|单", "808301").put("第八名|双", "808302")

			.put("第九名|1", "809101").put("第九名|2", "809102").put("第九名|3", "809103").put("第九名|4", "809104")
			.put("第九名|5", "809105").put("第九名|6", "809106").put("第九名|7", "809107").put("第九名|8", "809108")
			.put("第九名|9", "809109").put("第九名|10", "809110").put("第九名|大", "809201").put("第九名|小", "809202")
			.put("第九名|单", "809301").put("第九名|双", "809302")

			.put("第十名|1", "810101").put("第十名|2", "810102").put("第十名|3", "810103").put("第十名|4", "810104")
			.put("第十名|5", "810105").put("第十名|6", "810106").put("第十名|7", "810107").put("第十名|8", "810108")
			.put("第十名|9", "810109").put("第十名|10", "810110").put("第十名|大", "810201").put("第十名|小", "810202")
			.put("第十名|单", "810301").put("第十名|双", "810302").build();

	/**
	 * 球码code  冠亚盘
	 */
	Map<String, String> XYFT_SUM_DT_CODE = ImmutableMap.<String, String>builder().put("冠亚|3", "800103")
			.put("冠亚|4", "800104").put("冠亚|5", "800105").put("冠亚|6", "800106").put("冠亚|7", "800107")
			.put("冠亚|8", "800108").put("冠亚|9", "800109").put("冠亚|10", "800110").put("冠亚|11", "800111")
			.put("冠亚|12", "800112").put("冠亚|13", "800113").put("冠亚|14", "800114").put("冠亚|15", "800115")
			.put("冠亚|16", "800116").put("冠亚|17", "800117").put("冠亚|18", "800118").put("冠亚|19", "800119")
			.put("冠亚|大", "800201").put("冠亚|小", "800202").put("冠亚|单", "800301").put("冠亚|双", "800302").build();


}
