package com.ibm.old.v1.common.doming.configs;
import com.google.common.collect.ImmutableList;
import com.google.common.collect.ImmutableMap;

import java.util.List;
import java.util.Map;
/**
 * @Description: Ws盘口默认值
 * @Author: Dongming
 * @Date: 2629-09-21 17:47
 * @Email: job.dongming@foxmail.com
 * @Version: v1.0
 */
public interface IdcConfig {
	int TIME_CLOSE = 10;

	int LIMIT_MIN = 2;



	Map<String, Map<String, String>> GAME_BET_CODE = ImmutableMap.<String, Map<String, String>>builder()
			.put("CQSSC", ImmutableMap.<String, String>builder().put("gameno", "6").put("Class", "1").build())
			.put("KLC", ImmutableMap.<String, String>builder().put("gameno", "8").put("Class", "2").build())
			.put("PK10", ImmutableMap.<String, String>builder().put("gameno", "11").put("Class", "3").build())
			.put("XYNC", ImmutableMap.<String, String>builder().put("gameno", "20").put("Class", "4").build())
			.put("XYFT", ImmutableMap.<String, String>builder().put("gameno", "21").put("Class", "5").build()).build();

	/**
	 * pk10的球码
	 */

	List<String> PK10_BALL = ImmutableList.<String>builder().add("601").add("602").add("604").add("603").add("605")
			.add("606").add("607").add("608").add("609").add("610").add("611").add("612").add("613").add("614")
			.add("615").add("616").add("617").add("618").add("619").add("620").add("621").add("622").add("623")
			.add("624").add("625").add("626").add("627").add("628").add("629").add("630").add("631").add("632")
			.add("633").add("634").add("635").add("636").add("637").add("638").build();

	Map<String, String> PK10_BALL_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "601:1")
			.put("第一名|2", "601:2").put("第一名|3", "601:3").put("第一名|4", "601:4").put("第一名|5", "601:5")
			.put("第一名|6", "601:6").put("第一名|7", "601:7").put("第一名|8", "601:8").put("第一名|9", "601:9")
			.put("第一名|10", "601:10").put("第一名|单", "611:1").put("第一名|双", "611:2").put("第一名|大", "621:1")
			.put("第一名|小", "621:2").put("第一名|龙", "631:1").put("第一名|虎", "631:2")

			.put("第二名|1", "602:1").put("第二名|2", "602:2").put("第二名|3", "602:3").put("第二名|4", "602:4")
			.put("第二名|5", "602:5").put("第二名|6", "602:6").put("第二名|7", "602:7").put("第二名|8", "602:8")
			.put("第二名|9", "602:9").put("第二名|10", "602:10").put("第二名|单", "612:1").put("第二名|双", "612:2")
			.put("第二名|大", "622:1").put("第二名|小", "622:2").put("第二名|龙", "632:1").put("第二名|虎", "632:2")

			.put("第三名|1", "603:1").put("第三名|2", "603:2").put("第三名|3", "603:3").put("第三名|4", "603:4")
			.put("第三名|5", "603:5").put("第三名|6", "603:6").put("第三名|7", "603:7").put("第三名|8", "603:8")
			.put("第三名|9", "603:9").put("第三名|10", "603:10").put("第三名|单", "613:1").put("第三名|双", "613:2")
			.put("第三名|大", "623:1").put("第三名|小", "623:2").put("第三名|龙", "633:1").put("第三名|虎", "633:2")

			.put("第四名|1", "604:1").put("第四名|2", "604:2").put("第四名|3", "604:3").put("第四名|4", "604:4")
			.put("第四名|5", "604:5").put("第四名|6", "604:6").put("第四名|7", "604:7").put("第四名|8", "604:8")
			.put("第四名|9", "604:9").put("第四名|10", "604:10").put("第四名|单", "614:1").put("第四名|双", "614:2")
			.put("第四名|大", "624:1").put("第四名|小", "624:2").put("第四名|龙", "634:1").put("第四名|虎", "634:2")

			.put("第五名|1", "605:1").put("第五名|2", "605:2").put("第五名|3", "605:3").put("第五名|4", "605:4")
			.put("第五名|5", "605:5").put("第五名|6", "605:6").put("第五名|7", "605:7").put("第五名|8", "605:8")
			.put("第五名|9", "605:9").put("第五名|10", "605:10").put("第五名|单", "615:1").put("第五名|双", "615:2")
			.put("第五名|大", "625:1").put("第五名|小", "625:2").put("第五名|龙", "635:1").put("第五名|虎", "635:2")

			.put("第六名|1", "606:1").put("第六名|2", "606:2").put("第六名|3", "606:3").put("第六名|4", "606:4")
			.put("第六名|5", "606:5").put("第六名|6", "606:6").put("第六名|7", "606:7").put("第六名|8", "606:8")
			.put("第六名|9", "606:9").put("第六名|10", "606:10").put("第六名|单", "616:1").put("第六名|双", "616:2")
			.put("第六名|大", "626:1").put("第六名|小", "626:2")

			.put("第七名|1", "607:1").put("第七名|2", "607:2").put("第七名|3", "607:3").put("第七名|4", "607:4")
			.put("第七名|5", "607:5").put("第七名|6", "607:6").put("第七名|7", "607:7").put("第七名|8", "607:8")
			.put("第七名|9", "607:9").put("第七名|10", "607:10").put("第七名|单", "617:1").put("第七名|双", "617:2")
			.put("第七名|大", "627:1").put("第七名|小", "627:2")

			.put("第八名|1", "608:1").put("第八名|2", "608:2").put("第八名|3", "608:3").put("第八名|4", "608:4")
			.put("第八名|5", "608:5").put("第八名|6", "608:6").put("第八名|7", "608:7").put("第八名|8", "608:8")
			.put("第八名|9", "608:9").put("第八名|10", "608:10").put("第八名|单", "618:1").put("第八名|双", "618:2")
			.put("第八名|大", "628:1").put("第八名|小", "628:2")

			.put("第九名|1", "609:1").put("第九名|2", "609:2").put("第九名|3", "609:3").put("第九名|4", "609:4")
			.put("第九名|5", "609:5").put("第九名|6", "609:6").put("第九名|7", "609:7").put("第九名|8", "609:8")
			.put("第九名|9", "609:9").put("第九名|10", "609:10").put("第九名|单", "619:1").put("第九名|双", "619:2")
			.put("第九名|大", "629:1").put("第九名|小", "629:2")

			.put("第十名|1", "610:1").put("第十名|2", "610:2").put("第十名|3", "610:3").put("第十名|4", "610:4")
			.put("第十名|5", "610:5").put("第十名|6", "610:6").put("第十名|7", "610:7").put("第十名|8", "610:8")
			.put("第十名|9", "610:9").put("第十名|10", "610:10").put("第十名|单", "620:1").put("第十名|双", "620:2")
			.put("第十名|大", "630:1").put("第十名|小", "630:2")

			.put("冠亚|3", "638:3").put("冠亚|4", "638:4").put("冠亚|5", "638:5").put("冠亚|6", "638:6")
			.put("冠亚|7", "638:7").put("冠亚|8", "638:8").put("冠亚|9", "638:9").put("冠亚|10", "638:20")
			.put("冠亚|11", "638:11").put("冠亚|12", "638:12").put("冠亚|13", "638:13").put("冠亚|14", "638:14")
			.put("冠亚|15", "638:15").put("冠亚|16", "638:16").put("冠亚|17", "638:17").put("冠亚|18", "638:18")
			.put("冠亚|19", "638:19").put("冠亚|单", "636:1").put("冠亚|双", "636:2").put("冠亚|大", "637:1")
			.put("冠亚|小", "637:2").build();

	Map<String, String> BET_LIMIT_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "00").put("第一名|2", "00")
			.put("第一名|3", "00").put("第一名|4", "00").put("第一名|5", "00").put("第一名|6", "00").put("第一名|7", "00")
			.put("第一名|8", "00").put("第一名|9", "00").put("第一名|10", "00").put("第一名|大", "10").put("第一名|小", "10")
			.put("第一名|单", "11").put("第一名|双", "11").put("第一名|龙", "12").put("第一名|虎", "12")

			.put("第二名|1", "01").put("第二名|2", "01").put("第二名|3", "01").put("第二名|4", "01").put("第二名|5", "01")
			.put("第二名|6", "01").put("第二名|7", "01").put("第二名|8", "01").put("第二名|9", "01").put("第二名|10", "01")
			.put("第二名|大", "10").put("第二名|小", "10").put("第二名|单", "11").put("第二名|双", "11").put("第二名|龙", "12")
			.put("第二名|虎", "12")

			.put("第三名|1", "02").put("第三名|2", "02").put("第三名|3", "02").put("第三名|4", "02").put("第三名|5", "02")
			.put("第三名|6", "02").put("第三名|7", "02").put("第三名|8", "02").put("第三名|9", "02").put("第三名|10", "02")
			.put("第三名|大", "10").put("第三名|小", "10").put("第三名|单", "11").put("第三名|双", "11").put("第三名|龙", "12")
			.put("第三名|虎", "12")

			.put("第四名|1", "03").put("第四名|2", "03").put("第四名|3", "03").put("第四名|4", "03").put("第四名|5", "03")
			.put("第四名|6", "03").put("第四名|7", "03").put("第四名|8", "03").put("第四名|9", "03").put("第四名|10", "03")
			.put("第四名|大", "10").put("第四名|小", "10").put("第四名|单", "11").put("第四名|双", "11").put("第四名|龙", "12")
			.put("第四名|虎", "12")

			.put("第五名|1", "04").put("第五名|2", "04").put("第五名|3", "04").put("第五名|4", "04").put("第五名|5", "04")
			.put("第五名|6", "04").put("第五名|7", "04").put("第五名|8", "04").put("第五名|9", "04").put("第五名|10", "04")
			.put("第五名|大", "10").put("第五名|小", "10").put("第五名|单", "11").put("第五名|双", "11").put("第五名|龙", "12")
			.put("第五名|虎", "12")

			.put("第六名|1", "05").put("第六名|2", "05").put("第六名|3", "05").put("第六名|4", "05").put("第六名|5", "05")
			.put("第六名|6", "05").put("第六名|7", "05").put("第六名|8", "05").put("第六名|9", "05").put("第六名|10", "05")
			.put("第六名|大", "10").put("第六名|小", "10").put("第六名|单", "11").put("第六名|双", "11")

			.put("第七名|1", "06").put("第七名|2", "06").put("第七名|3", "06").put("第七名|4", "06").put("第七名|5", "06")
			.put("第七名|6", "06").put("第七名|7", "06").put("第七名|8", "06").put("第七名|9", "06").put("第七名|10", "06")
			.put("第七名|大", "10").put("第七名|小", "10").put("第七名|单", "11").put("第七名|双", "11")

			.put("第八名|1", "07").put("第八名|2", "07").put("第八名|3", "07").put("第八名|4", "07").put("第八名|5", "07")
			.put("第八名|6", "07").put("第八名|7", "07").put("第八名|8", "07").put("第八名|9", "07").put("第八名|10", "07")
			.put("第八名|大", "10").put("第八名|小", "10").put("第八名|单", "11").put("第八名|双", "11")

			.put("第九名|1", "08").put("第九名|2", "08").put("第九名|3", "08").put("第九名|4", "08").put("第九名|5", "08")
			.put("第九名|6", "08").put("第九名|7", "08").put("第九名|8", "08").put("第九名|9", "08").put("第九名|10", "08")
			.put("第九名|大", "10").put("第九名|小", "10").put("第九名|单", "11").put("第九名|双", "11")

			.put("第十名|1", "09").put("第十名|2", "09").put("第十名|3", "09").put("第十名|4", "09").put("第十名|5", "09")
			.put("第十名|6", "09").put("第十名|7", "09").put("第十名|8", "09").put("第十名|9", "09").put("第十名|10", "09")
			.put("第十名|大", "10").put("第十名|小", "10").put("第十名|单", "11").put("第十名|双", "11")

			.put("冠亚|3", "15").put("冠亚|4", "15").put("冠亚|5", "15").put("冠亚|6", "15").put("冠亚|7", "15")
			.put("冠亚|8", "15").put("冠亚|9", "15").put("冠亚|10", "15").put("冠亚|11", "15").put("冠亚|12", "15")
			.put("冠亚|13", "15").put("冠亚|14", "15").put("冠亚|15", "15").put("冠亚|16", "15").put("冠亚|17", "15")
			.put("冠亚|18", "15").put("冠亚|19", "15").put("冠亚|大", "13").put("冠亚|小", "13").put("冠亚|单", "14")
			.put("冠亚|双", "14").build();


	/**
	 * xyft的球码
	 */

	List<String> XYFT_BALL = ImmutableList.<String>builder().add("601").add("602").add("604").add("603").add("605")
			.add("606").add("607").add("608").add("609").add("610").add("611").add("612").add("613").add("614")
			.add("615").add("616").add("617").add("618").add("619").add("620").add("621").add("622").add("623")
			.add("624").add("625").add("626").add("627").add("628").add("629").add("630").add("631").add("632")
			.add("633").add("634").add("635").add("636").add("637").add("638").build();

	Map<String, String> XYFT_BET_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "601:1")
			.put("第一名|2", "601:2").put("第一名|3", "601:3").put("第一名|4", "601:4").put("第一名|5", "601:5")
			.put("第一名|6", "601:6").put("第一名|7", "601:7").put("第一名|8", "601:8").put("第一名|9", "601:9")
			.put("第一名|10", "601:10").put("第一名|单", "611:1").put("第一名|双", "611:2").put("第一名|大", "621:1")
			.put("第一名|小", "621:2").put("第一名|龙", "631:1").put("第一名|虎", "631:2")

			.put("第二名|1", "602:1").put("第二名|2", "602:2").put("第二名|3", "602:3").put("第二名|4", "602:4")
			.put("第二名|5", "602:5").put("第二名|6", "602:6").put("第二名|7", "602:7").put("第二名|8", "602:8")
			.put("第二名|9", "602:9").put("第二名|10", "602:10").put("第二名|单", "612:1").put("第二名|双", "612:2")
			.put("第二名|大", "622:1").put("第二名|小", "622:2").put("第二名|龙", "632:1").put("第二名|虎", "632:2")

			.put("第三名|1", "603:1").put("第三名|2", "603:2").put("第三名|3", "603:3").put("第三名|4", "603:4")
			.put("第三名|5", "603:5").put("第三名|6", "603:6").put("第三名|7", "603:7").put("第三名|8", "603:8")
			.put("第三名|9", "603:9").put("第三名|10", "603:10").put("第三名|单", "613:1").put("第三名|双", "613:2")
			.put("第三名|大", "623:1").put("第三名|小", "623:2").put("第三名|龙", "633:1").put("第三名|虎", "633:2")

			.put("第四名|1", "604:1").put("第四名|2", "604:2").put("第四名|3", "604:3").put("第四名|4", "604:4")
			.put("第四名|5", "604:5").put("第四名|6", "604:6").put("第四名|7", "604:7").put("第四名|8", "604:8")
			.put("第四名|9", "604:9").put("第四名|10", "604:10").put("第四名|单", "614:1").put("第四名|双", "614:2")
			.put("第四名|大", "624:1").put("第四名|小", "624:2").put("第四名|龙", "634:1").put("第四名|虎", "634:2")

			.put("第五名|1", "605:1").put("第五名|2", "605:2").put("第五名|3", "605:3").put("第五名|4", "605:4")
			.put("第五名|5", "605:5").put("第五名|6", "605:6").put("第五名|7", "605:7").put("第五名|8", "605:8")
			.put("第五名|9", "605:9").put("第五名|10", "605:10").put("第五名|单", "615:1").put("第五名|双", "615:2")
			.put("第五名|大", "625:1").put("第五名|小", "625:2").put("第五名|龙", "635:1").put("第五名|虎", "635:2")

			.put("第六名|1", "606:1").put("第六名|2", "606:2").put("第六名|3", "606:3").put("第六名|4", "606:4")
			.put("第六名|5", "606:5").put("第六名|6", "606:6").put("第六名|7", "606:7").put("第六名|8", "606:8")
			.put("第六名|9", "606:9").put("第六名|10", "606:10").put("第六名|单", "616:1").put("第六名|双", "616:2")
			.put("第六名|大", "626:1").put("第六名|小", "626:2")

			.put("第七名|1", "607:1").put("第七名|2", "607:2").put("第七名|3", "607:3").put("第七名|4", "607:4")
			.put("第七名|5", "607:5").put("第七名|6", "607:6").put("第七名|7", "607:7").put("第七名|8", "607:8")
			.put("第七名|9", "607:9").put("第七名|10", "607:10").put("第七名|单", "617:1").put("第七名|双", "617:2")
			.put("第七名|大", "627:1").put("第七名|小", "627:2")

			.put("第八名|1", "608:1").put("第八名|2", "608:2").put("第八名|3", "608:3").put("第八名|4", "608:4")
			.put("第八名|5", "608:5").put("第八名|6", "608:6").put("第八名|7", "608:7").put("第八名|8", "608:8")
			.put("第八名|9", "608:9").put("第八名|10", "608:10").put("第八名|单", "618:1").put("第八名|双", "618:2")
			.put("第八名|大", "628:1").put("第八名|小", "628:2")

			.put("第九名|1", "609:2").put("第九名|2", "609:2").put("第九名|3", "609:3").put("第九名|4", "609:4")
			.put("第九名|5", "609:5").put("第九名|6", "609:6").put("第九名|7", "609:7").put("第九名|8", "609:8")
			.put("第九名|9", "609:9").put("第九名|10", "609:10").put("第九名|单", "619:1").put("第九名|双", "619:2")
			.put("第九名|大", "629:1").put("第九名|小", "629:2")

			.put("第十名|1", "610:1").put("第十名|2", "610:2").put("第十名|3", "610:3").put("第十名|4", "610:4")
			.put("第十名|5", "610:5").put("第十名|6", "610:6").put("第十名|7", "610:7").put("第十名|8", "610:8")
			.put("第十名|9", "610:9").put("第十名|10", "610:10").put("第十名|单", "620:1").put("第十名|双", "620:2")
			.put("第十名|大", "630:1").put("第十名|小", "630:2")

			.put("冠亚|3", "638:3").put("冠亚|4", "638:4").put("冠亚|5", "638:5").put("冠亚|6", "638:6")
			.put("冠亚|7", "638:7").put("冠亚|8", "638:8").put("冠亚|9", "638:9").put("冠亚|10", "638:20")
			.put("冠亚|11", "638:11").put("冠亚|12", "638:12").put("冠亚|13", "638:13").put("冠亚|14", "638:14")
			.put("冠亚|15", "638:15").put("冠亚|16", "638:16").put("冠亚|17", "638:17").put("冠亚|18", "638:18")
			.put("冠亚|19", "638:19").put("冠亚|单", "636:1").put("冠亚|双", "636:2").put("冠亚|大", "637:1")
			.put("冠亚|小", "637:2").build();

	Map<String, String> BET_INFO_CODE = ImmutableMap.<String, String>builder().put("冠军01", "第一名|1")
			.put("冠军02", "第一名|2").put("冠军03", "第一名|3").put("冠军04", "第一名|4").put("冠军05", "第一名|5").put("冠军06", "第一名|6")
			.put("冠军07", "第一名|7").put("冠军08", "第一名|8").put("冠军09", "第一名|9").put("冠军10", "第一名|10").put("冠军龙虎虎", "第一名|虎")
			.put("冠军龙虎龙", "第一名|龙").put("冠军单双单", "第一名|单").put("冠军单双双", "第一名|双").put("冠军大小大", "第一名|大")
			.put("冠军大小小", "第一名|小")

			.put("亚军01", "第二名|1").put("亚军02", "第二名|2").put("亚军03", "第二名|3").put("亚军04", "第二名|4").put("亚军05", "第二名|5")
			.put("亚军06", "第二名|6").put("亚军07", "第二名|7").put("亚军08", "第二名|8").put("亚军09", "第二名|9").put("亚军10", "第二名|10")
			.put("亚军龙虎虎", "第二名|虎").put("亚军龙虎龙", "第二名|龙").put("亚军单双单", "第二名|单").put("亚军单双双", "第二名|双")
			.put("亚军大小大", "第二名|大").put("亚军大小小", "第二名|小")

			.put("第三名01", "第三名|1").put("第三名02", "第三名|2").put("第三名03", "第三名|3").put("第三名04", "第三名|4")
			.put("第三名05", "第三名|5").put("第三名06", "第三名|6").put("第三名07", "第三名|7").put("第三名08", "第三名|8")
			.put("第三名09", "第三名|9").put("第三名10", "第三名|10").put("第三名龙虎虎", "第三名|虎").put("第三名龙虎龙", "第三名|龙")
			.put("第三名单双单", "第三名|单").put("第三名单双双", "第三名|双").put("第三名大小大", "第三名|大").put("第三名大小小", "第三名|小")

			.put("第四名01", "第四名|1").put("第四名02", "第四名|2").put("第四名03", "第四名|3").put("第四名04", "第四名|4")
			.put("第四名05", "第四名|5").put("第四名06", "第四名|6").put("第四名07", "第四名|7").put("第四名08", "第四名|8")
			.put("第四名09", "第四名|9").put("第四名10", "第四名|10").put("第四名龙虎虎", "第四名|虎").put("第四名龙虎龙", "第四名|龙")
			.put("第四名单双单", "第四名|单").put("第四名单双双", "第四名|双").put("第四名大小大", "第四名|大").put("第四名大小小", "第四名|小")

			.put("第五名01", "第五名|1").put("第五名02", "第五名|2").put("第五名03", "第五名|3").put("第五名04", "第五名|4")
			.put("第五名05", "第五名|5").put("第五名06", "第五名|6").put("第五名07", "第五名|7").put("第五名08", "第五名|8")
			.put("第五名09", "第五名|9").put("第五名10", "第五名|10").put("第五名龙虎虎", "第五名|虎").put("第五名龙虎龙", "第五名|龙")
			.put("第五名单双单", "第五名|单").put("第五名单双双", "第五名|双").put("第五名大小大", "第五名|大").put("第五名大小小", "第五名|小")

			.put("第六名01", "第六名|1").put("第六名02", "第六名|2").put("第六名03", "第六名|3").put("第六名04", "第六名|4")
			.put("第六名05", "第六名|5").put("第六名06", "第六名|6").put("第六名07", "第六名|7").put("第六名08", "第六名|8")
			.put("第六名09", "第六名|9").put("第六名10", "第六名|10").put("第六名单双单", "第六名|单").put("第六名单双双", "第六名|双")
			.put("第六名大小大", "第六名|大").put("第六名大小小", "第六名|小")

			.put("第七名01", "第七名|1").put("第七名02", "第七名|2").put("第七名03", "第七名|3").put("第七名04", "第七名|4")
			.put("第七名05", "第七名|5").put("第七名06", "第七名|6").put("第七名07", "第七名|7").put("第七名08", "第七名|8")
			.put("第七名09", "第七名|9").put("第七名10", "第七名|10").put("第七名单双单", "第七名|单").put("第七名单双双", "第七名|双")
			.put("第七名大小大", "第七名|大").put("第七名大小小", "第七名|小")

			.put("第八名01", "第八名|1").put("第八名02", "第八名|2").put("第八名03", "第八名|3").put("第八名04", "第八名|4")
			.put("第八名05", "第八名|5").put("第八名06", "第八名|6").put("第八名07", "第八名|7").put("第八名08", "第八名|8")
			.put("第八名09", "第八名|9").put("第八名10", "第八名|10").put("第八名单双单", "第八名|单").put("第八名单双双", "第八名|双")
			.put("第八名大小大", "第八名|大").put("第八名大小小", "第八名|小")

			.put("第九名01", "第九名|1").put("第九名02", "第九名|2").put("第九名03", "第九名|3").put("第九名04", "第九名|4")
			.put("第九名05", "第九名|5").put("第九名06", "第九名|6").put("第九名07", "第九名|7").put("第九名08", "第九名|8")
			.put("第九名09", "第九名|9").put("第九名10", "第九名|10").put("第九名单双单", "第九名|单").put("第九名单双双", "第九名|双")
			.put("第九名大小大", "第九名|大").put("第九名大小小", "第九名|小")

			.put("第十名01", "第十名|1").put("第十名02", "第十名|2").put("第十名03", "第十名|3").put("第十名04", "第十名|4")
			.put("第十名05", "第十名|5").put("第十名06", "第十名|6").put("第十名07", "第十名|7").put("第十名08", "第十名|8")
			.put("第十名09", "第十名|9").put("第十名10", "第十名|10").put("第十名单双单", "第十名|单").put("第十名单双双", "第十名|双")
			.put("第十名大小大", "第十名|大").put("第十名大小小", "第十名|小")

			.put("冠亚和03", "冠亚|3").put("冠亚和04", "冠亚|4").put("冠亚和05", "冠亚|5").put("冠亚和06", "冠亚|6").put("冠亚和07", "冠亚|7")
			.put("冠亚和08", "冠亚|8").put("冠亚和09", "冠亚|9").put("冠亚和10", "冠亚|10").put("冠亚和11", "冠亚|11").put("冠亚和12", "冠亚|12")
			.put("冠亚和13", "冠亚|13").put("冠亚和14", "冠亚|14").put("冠亚和15", "冠亚|15").put("冠亚和16", "冠亚|16")
			.put("冠亚和17", "冠亚|17").put("冠亚和18", "冠亚|18").put("冠亚和19", "冠亚|19").put("冠亚和龙虎虎", "冠亚|虎")
			.put("冠亚和龙虎龙", "冠亚|龙").put("冠亚和单双单", "冠亚|单").put("冠亚和单双双", "冠亚|双").put("冠亚和大小大", "冠亚|大")
			.put("冠亚和大小小", "冠亚|小").build();

	/**
	 * cqssc的球码
	 */
	Map<String, String> CQSSC_BET_LIMIT_CODE = ImmutableMap.<String, String>builder().put("第一球|0", "00").put("第一球|1", "00")
			.put("第一球|2", "00").put("第一球|3", "00").put("第一球|4", "00").put("第一球|5", "00").put("第一球|6", "00")
			.put("第一球|7", "00").put("第一球|8", "00").put("第一球|9", "00").put("第一球|大", "10").put("第一球|小", "10")
			.put("第一球|单", "11").put("第一球|双", "11")

			.put("第二球|0", "01").put("第二球|1", "01").put("第二球|2", "01").put("第二球|3", "01").put("第二球|4", "01")
			.put("第二球|5", "01").put("第二球|6", "01").put("第二球|7", "01").put("第二球|8", "01").put("第二球|9", "01")
			.put("第二球|大", "10").put("第二球|小", "10").put("第二球|单", "11").put("第二球|双", "11")

			.put("第三球|0", "02").put("第三球|1", "02").put("第三球|2", "02").put("第三球|3", "02").put("第三球|4", "02")
			.put("第三球|5", "02").put("第三球|6", "02").put("第三球|7", "02").put("第三球|8", "02").put("第三球|9", "02")
			.put("第三球|大", "10").put("第三球|小", "10").put("第三球|单", "11").put("第三球|双", "11")

			.put("第四球|0", "03").put("第四球|1", "03").put("第四球|2", "03").put("第四球|3", "03").put("第四球|4", "03")
			.put("第四球|5", "03").put("第四球|6", "03").put("第四球|7", "03").put("第四球|8", "03").put("第四球|9", "03")
			.put("第四球|大", "10").put("第四球|小", "10").put("第四球|单", "11").put("第四球|双", "11")

			.put("第五球|0", "04").put("第五球|1", "04").put("第五球|2", "04").put("第五球|3", "04").put("第五球|4", "04")
			.put("第五球|5", "04").put("第五球|6", "04").put("第五球|7", "04").put("第五球|8", "04").put("第五球|9", "04")
			.put("第五球|大", "10").put("第五球|小", "10").put("第五球|单", "11").put("第五球|双", "11")

			.build();


	List<String> CQSSC_NUMBER_BALL = ImmutableList.<String>builder().add("205").add("206").add("207").add("208")
			.add("209").add("210").add("211").add("212").add("213").add("214").add("215").add("216").add("217")
			.add("218").add("219").add("330").add("331").add("332").add("333").add("334").add("335").add("336")
			.add("337").add("338").add("339").add("340").add("341").add("342").add("343").add("344").add("345")
			.add("346").add("347").build();

	List<String> CQSSC_POKER_BALL = ImmutableList.<String>builder().add("358").add("359").add("360").add("362").build();

	List<String> CQSSC_SUM_BALL = ImmutableList.<String>builder().add("348").add("349").add("350").add("351").add("352")
			.add("353").add("354").add("355").add("356").add("357").add("368").add("369").add("370").add("371")
			.add("372").add("373").add("374").add("375").add("376").add("377").build();

	Map<String, String> CQSSC_BET_CODE = ImmutableMap.<String, String>builder().put("第一球|0", "205:0")
			.put("第一球|1", "205:1").put("第一球|2", "205:2").put("第一球|3", "205:3").put("第一球|4", "205:4")
			.put("第一球|5", "205:5").put("第一球|6", "205:6").put("第一球|7", "205:7").put("第一球|8", "205:8")
			.put("第一球|9", "205:9").put("第一球|单", "215:1").put("第一球|双", "215:2").put("第一球|大", "210:1")
			.put("第一球|小", "210:2")

			.put("第二球|0", "206:0").put("第二球|1", "206:1").put("第二球|2", "206:2").put("第二球|3", "206:3")
			.put("第二球|4", "206:4").put("第二球|5", "206:5").put("第二球|6", "206:6").put("第二球|7", "206:7")
			.put("第二球|8", "206:8").put("第二球|9", "206:9").put("第二球|单", "216:1").put("第二球|双", "216:2")
			.put("第二球|大", "211:1").put("第二球|小", "211:2")

			.put("第三球|0", "207:0").put("第三球|1", "207:1").put("第三球|2", "207:2").put("第三球|3", "207:3")
			.put("第三球|4", "207:4").put("第三球|5", "207:5").put("第三球|6", "207:6").put("第三球|7", "207:7")
			.put("第三球|8", "207:8").put("第三球|9", "207:9").put("第三球|单", "217:1").put("第三球|双", "217:2")
			.put("第三球|大", "212:1").put("第三球|小", "212:2")

			.put("第四球|0", "208:0").put("第四球|1", "208:1").put("第四球|2", "208:2").put("第四球|3", "208:3")
			.put("第四球|4", "208:4").put("第四球|5", "208:5").put("第四球|6", "208:6").put("第四球|7", "208:7")
			.put("第四球|8", "208:8").put("第四球|9", "208:9").put("第四球|单", "218:1").put("第四球|双", "218:2")
			.put("第四球|大", "213:1").put("第四球|小", "213:2")

			.put("第五球|0", "209:0").put("第五球|1", "209:1").put("第五球|2", "209:2").put("第五球|3", "209:3")
			.put("第五球|4", "209:4").put("第五球|5", "209:5").put("第五球|6", "209:6").put("第五球|7", "209:7")
			.put("第五球|8", "209:8").put("第五球|9", "209:9").put("第五球|单", "219:1").put("第五球|双", "219:2")
			.put("第五球|大", "214:1").put("第五球|小", "214:2")

			.put("总和|大", "346:1").put("总和|小", "346:2").put("总和|单", "345:1").put("总和|双", "345:2").put("总和|龙", "347:1")
			.put("总和|虎", "347:2").put("总和|和", "347:3").put("前三|豹子", "330:1").put("中三|豹子", "331:1").put("后三|豹子", "332:1")
			.put("前三|顺子", "333:1").put("中三|顺子", "334:1").put("后三|顺子", "335:1").put("前三|对子", "336:1")
			.put("中三|对子", "337:1").put("后三|对子", "338:1").put("前三|半顺", "339:1").put("中三|半顺", "340:1")
			.put("后三|半顺", "341:1").put("前三|杂六", "342:1").put("中三|杂六", "343:1").put("后三|杂六", "344:1")

			.put("牛牛|无牛", "358:0").put("牛牛|牛1", "358:1").put("牛牛|牛2", "358:2").put("牛牛|牛3", "358:3")
			.put("牛牛|牛4", "358:4").put("牛牛|牛5", "358:5").put("牛牛|牛6", "358:6").put("牛牛|牛7", "358:7")
			.put("牛牛|牛8", "358:8").put("牛牛|牛9", "358:9").put("牛牛|牛牛", "358:10").put("牛牛|单", "359:1")
			.put("牛牛|双", "359:2").put("牛牛|大", "360:1").put("牛牛|小", "360:2")

			.put("梭哈|五梅", "362:1").put("梭哈|四带一", "362:2").put("梭哈|葫芦", "362:3").put("梭哈|顺子", "362:4")
			.put("梭哈|三条", "362:5").put("梭哈|两对", "362:6").put("梭哈|单对", "362:7").put("梭哈|五不靠", "362:8")
			.put("梭哈|散号", "362:9")

			.put("合数万千|单", "348:1").put("合数万千|双", "348:2").put("合数万百|单", "349:1").put("合数万百|双", "349:2")
			.put("合数万十|单", "350:1").put("合数万十|双", "350:2").put("合数万个|单", "351:1").put("合数万个|双", "351:2")
			.put("合数千百|单", "352:1").put("合数千百|双", "352:2").put("合数千十|单", "353:1").put("合数千十|双", "353:2")
			.put("合数千个|单", "354:1").put("合数千个|双", "354:2").put("合数百十|单", "355:1").put("合数百十|双", "355:2")
			.put("合数百个|单", "356:1").put("合数百个|双", "356:2").put("合数十个|单", "357:1").put("合数十个|双", "357:2")

			.put("合数尾数万千|大", "368:1").put("合数尾数万千|小", "368:2").put("合数尾数万百|大", "369:1").put("合数尾数万百|小", "369:2")
			.put("合数尾数万十|大", "370:1").put("合数尾数万十|小", "370:2").put("合数尾数万个|大", "371:1").put("合数尾数万个|小", "371:2")
			.put("合数尾数千百|大", "372:1").put("合数尾数千百|小", "372:2").put("合数尾数千十|大", "373:1").put("合数尾数千十|小", "373:2")
			.put("合数尾数千个|大", "374:1").put("合数尾数千个|小", "374:2").put("合数尾数百十|大", "375:1").put("合数尾数百十|小", "375:2")
			.put("合数尾数百个|大", "376:1").put("合数尾数百个|小", "376:2").put("合数尾数十个|大", "377:1").put("合数尾数十个|小", "377:2")
			.build();

	Map<String, String> CQSSC_NUMBER_CODE = ImmutableMap.<String, String>builder().put("第一球|0", "205:0")
			.put("第一球|1", "205:1").put("第一球|2", "205:2").put("第一球|3", "205:3").put("第一球|4", "205:4")
			.put("第一球|5", "205:5").put("第一球|6", "205:6").put("第一球|7", "205:7").put("第一球|8", "205:8")
			.put("第一球|9", "205:9").put("第一球|单", "215:1").put("第一球|双", "215:2").put("第一球|大", "210:1")
			.put("第一球|小", "210:2")

			.put("第二球|0", "206:0").put("第二球|1", "206:1").put("第二球|2", "206:2").put("第二球|3", "206:3")
			.put("第二球|4", "206:4").put("第二球|5", "206:5").put("第二球|6", "206:6").put("第二球|7", "206:7")
			.put("第二球|8", "206:8").put("第二球|9", "206:9").put("第二球|单", "216:1").put("第二球|双", "216:2")
			.put("第二球|大", "211:1").put("第二球|小", "211:2")

			.put("第三球|0", "207:0").put("第三球|1", "207:1").put("第三球|2", "207:2").put("第三球|3", "207:3")
			.put("第三球|4", "207:4").put("第三球|5", "207:5").put("第三球|6", "207:6").put("第三球|7", "207:7")
			.put("第三球|8", "207:8").put("第三球|9", "207:9").put("第三球|单", "217:1").put("第三球|双", "217:2")
			.put("第三球|大", "212:1").put("第三球|小", "212:2")

			.put("第四球|0", "208:0").put("第四球|1", "208:1").put("第四球|2", "208:2").put("第四球|3", "208:3")
			.put("第四球|4", "208:4").put("第四球|5", "208:5").put("第四球|6", "208:6").put("第四球|7", "208:7")
			.put("第四球|8", "208:8").put("第四球|9", "208:9").put("第四球|单", "218:1").put("第四球|双", "218:2")
			.put("第四球|大", "213:1").put("第四球|小", "213:2")

			.put("第五球|0", "209:0").put("第五球|1", "209:1").put("第五球|2", "209:2").put("第五球|3", "209:3")
			.put("第五球|4", "209:4").put("第五球|5", "209:5").put("第五球|6", "209:6").put("第五球|7", "209:7")
			.put("第五球|8", "209:8").put("第五球|9", "209:9").put("第五球|单", "219:1").put("第五球|双", "219:2")
			.put("第五球|大", "214:1").put("第五球|小", "214:2")

			.put("总和|大", "346:1").put("总和|小", "346:2").put("总和|单", "345:1").put("总和|双", "345:2").put("总和|龙", "347:1")
			.put("总和|虎", "347:2").put("总和|和", "347:3").put("前三|豹子", "330:1").put("中三|豹子", "331:1").put("后三|豹子", "332:1")
			.put("前三|顺子", "333:1").put("中三|顺子", "334:1").put("后三|顺子", "335:1").put("前三|对子", "336:1")
			.put("中三|对子", "337:1").put("后三|对子", "338:1").put("前三|半顺", "339:1").put("中三|半顺", "340:1")
			.put("后三|半顺", "341:1").put("前三|杂六", "342:1").put("中三|杂六", "343:1").put("后三|杂六", "344:1").build();

	Map<String, String> CQSSC_POKER_CODE = ImmutableMap.<String, String>builder().put("牛牛|无牛", "358:0")
			.put("牛牛|牛1", "358:1").put("牛牛|牛2", "358:2").put("牛牛|牛3", "358:3").put("牛牛|牛4", "358:4")
			.put("牛牛|牛5", "358:5").put("牛牛|牛6", "358:6").put("牛牛|牛7", "358:7").put("牛牛|牛8", "358:8")
			.put("牛牛|牛9", "358:9").put("牛牛|牛牛", "358:10").put("牛牛|单", "359:1").put("牛牛|双", "359:2").put("牛牛|大", "360:1")
			.put("牛牛|小", "360:2")

			.put("梭哈|五梅", "362:1").put("梭哈|四带一", "362:2").put("梭哈|葫芦", "362:3").put("梭哈|顺子", "362:4")
			.put("梭哈|三条", "362:5").put("梭哈|两对", "362:6").put("梭哈|单对", "362:7").put("梭哈|五不靠", "362:8")
			.put("梭哈|散号", "362:9").build();

	Map<String, String> CQSSC_SUM_CODE = ImmutableMap.<String, String>builder().put("合数万千|单", "348:1")
			.put("合数万千|双", "348:2").put("合数万百|单", "349:1").put("合数万百|双", "349:2").put("合数万十|单", "350:1")
			.put("合数万十|双", "350:2").put("合数万个|单", "351:1").put("合数万个|双", "351:2").put("合数千百|单", "352:1")
			.put("合数千百|双", "352:2").put("合数千十|单", "353:1").put("合数千十|双", "353:2").put("合数千个|单", "354:1")
			.put("合数千个|双", "354:2").put("合数百十|单", "355:1").put("合数百十|双", "355:2").put("合数百个|单", "356:1")
			.put("合数百个|双", "356:2").put("合数十个|单", "357:1").put("合数十个|双", "357:2")

			.put("合数尾数万千|大", "368:1").put("合数尾数万千|小", "368:2").put("合数尾数万百|大", "369:1").put("合数尾数万百|小", "369:2")
			.put("合数尾数万十|大", "370:1").put("合数尾数万十|小", "370:2").put("合数尾数万个|大", "371:1").put("合数尾数万个|小", "371:2")
			.put("合数尾数千百|大", "372:1").put("合数尾数千百|小", "372:2").put("合数尾数千十|大", "373:1").put("合数尾数千十|小", "373:2")
			.put("合数尾数千个|大", "374:1").put("合数尾数千个|小", "374:2").put("合数尾数百十|大", "375:1").put("合数尾数百十|小", "375:2")
			.put("合数尾数百个|大", "376:1").put("合数尾数百个|小", "376:2").put("合数尾数十个|大", "377:1").put("合数尾数十个|小", "377:2")
			.build();

}
