package com.ibm.old.v1.common.doming.configs;
import com.google.common.collect.ImmutableMap;

import java.util.Map;
/**
 * @Description: Ws盘口默认值
 * @Author: Dongming
 * @Date: 2018-09-21 17:47
 * @Email: job.dongming@foxmail.com
 * @Version: v1.0
 */
public interface Ws2Config {

	int TIME_CLOSE = 10;
	String FIRST_GAME = "klc";

	/**
	 * 游戏code
	 */
	Map<String, String> GAME_CODE_MAP = ImmutableMap.<String, String>builder().put("KLC", "klc").put("PK10", "pk")
			.put("XYFT", "xyft").put("CQSSC", "ssc").put("XYNC", "nc").build();
	/**
	 * 游戏平台
	 */
	Map<String, String> GAME_PLATFORM_MAP = ImmutableMap.<String, String>builder().put("PK10", "pk10")
			.put("XYFT", "xyft").put("KLC", "klc").put("CQSSC", "ssc").put("XYNC", "nc").build();

	/**
	 * 游戏pk10投注信息code
	 */
	Map<String, String> PK10_BET_CODE = ImmutableMap.<String, String>builder().put("ballNO15", "play=ballNO15")
			.put("ballNO60", "play=ballNO60").put("sumDT", "play=sumDT_pk10&cat=15").build();

	/**
	 * 游戏xyft投注信息code
	 */
	Map<String, String> XYFT_BET_CODE = ImmutableMap.<String, String>builder().put("ballNO15", "play=ballNO15")
			.put("ballNO60", "play=ballNO60").put("sumDT", "play=sumDT_xyft&cat=15").build();

	Map<String, String> BET_INFO_CODE = ImmutableMap.<String, String>builder().put("klc", "play=bothSides&ball=&cat=13")
			.put("ssc", "action=ajax").put("pk", "play=bothSides_pk10&cat=15").put("xyft", "play=bothSides_xyft&cat=15")
			.put("nc", "action=ajax&play=bothSides_nc&ball=&cat=13").build();

	/**
	 * 球码code
	 */
	Map<String, String> BALL_BET_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "000|1")
			.put("第一名|2", "000|2").put("第一名|3", "000|3").put("第一名|4", "000|4").put("第一名|5", "000|5")
			.put("第一名|6", "000|6").put("第一名|7", "000|7").put("第一名|8", "000|8").put("第一名|9", "000|9")
			.put("第一名|10", "000|10").put("第一名|大", "010|0").put("第一名|小", "010|1").put("第一名|单", "020|0")
			.put("第一名|双", "020|1").put("第一名|龙", "030|0").put("第一名|虎", "030|1")

			.put("第二名|1", "001|1").put("第二名|2", "001|2").put("第二名|3", "001|3").put("第二名|4", "001|4")
			.put("第二名|5", "001|5").put("第二名|6", "001|6").put("第二名|7", "001|7").put("第二名|8", "001|8")
			.put("第二名|9", "001|9").put("第二名|10", "001|10").put("第二名|大", "011|0").put("第二名|小", "011|1")
			.put("第二名|单", "021|0").put("第二名|双", "021|1").put("第二名|龙", "031|0").put("第二名|虎", "031|1")

			.put("第三名|1", "002|1").put("第三名|2", "002|2").put("第三名|3", "002|3").put("第三名|4", "002|4")
			.put("第三名|5", "002|5").put("第三名|6", "002|6").put("第三名|7", "002|7").put("第三名|8", "002|8")
			.put("第三名|9", "002|9").put("第三名|10", "002|10").put("第三名|大", "012|0").put("第三名|小", "012|1")
			.put("第三名|单", "022|0").put("第三名|双", "022|1").put("第三名|龙", "032|0").put("第三名|虎", "032|1")

			.put("第四名|1", "003|1").put("第四名|2", "003|2").put("第四名|3", "003|3").put("第四名|4", "003|4")
			.put("第四名|5", "003|5").put("第四名|6", "003|6").put("第四名|7", "003|7").put("第四名|8", "003|8")
			.put("第四名|9", "003|9").put("第四名|10", "003|10").put("第四名|大", "013|0").put("第四名|小", "013|1")
			.put("第四名|单", "023|0").put("第四名|双", "023|1").put("第四名|龙", "033|0").put("第四名|虎", "033|1")

			.put("第五名|1", "004|1").put("第五名|2", "004|2").put("第五名|3", "004|3").put("第五名|4", "004|4")
			.put("第五名|5", "004|5").put("第五名|6", "004|6").put("第五名|7", "004|7").put("第五名|8", "004|8")
			.put("第五名|9", "004|9").put("第五名|10", "004|10").put("第五名|大", "014|0").put("第五名|小", "014|1")
			.put("第五名|单", "024|0").put("第五名|双", "024|1").put("第五名|龙", "034|0").put("第五名|虎", "034|1")

			.put("第六名|1", "005|1").put("第六名|2", "005|2").put("第六名|3", "005|3").put("第六名|4", "005|4")
			.put("第六名|5", "005|5").put("第六名|6", "005|6").put("第六名|7", "005|7").put("第六名|8", "005|8")
			.put("第六名|9", "005|9").put("第六名|10", "005|10").put("第六名|大", "015|0").put("第六名|小", "015|1")
			.put("第六名|单", "025|0").put("第六名|双", "025|1")

			.put("第七名|1", "006|1").put("第七名|2", "006|2").put("第七名|3", "006|3").put("第七名|4", "006|4")
			.put("第七名|5", "006|5").put("第七名|6", "006|6").put("第七名|7", "006|7").put("第七名|8", "006|8")
			.put("第七名|9", "006|9").put("第七名|10", "006|10").put("第七名|大", "016|0").put("第七名|小", "016|1")
			.put("第七名|单", "026|0").put("第七名|双", "026|1")

			.put("第八名|1", "007|1").put("第八名|2", "007|2").put("第八名|3", "007|3").put("第八名|4", "007|4")
			.put("第八名|5", "007|5").put("第八名|6", "007|6").put("第八名|7", "007|7").put("第八名|8", "007|8")
			.put("第八名|9", "007|9").put("第八名|10", "007|10").put("第八名|大", "017|0").put("第八名|小", "017|1")
			.put("第八名|单", "027|0").put("第八名|双", "027|1")

			.put("第九名|1", "008|1").put("第九名|2", "008|2").put("第九名|3", "008|3").put("第九名|4", "008|4")
			.put("第九名|5", "008|5").put("第九名|6", "008|6").put("第九名|7", "008|7").put("第九名|8", "008|8")
			.put("第九名|9", "008|9").put("第九名|10", "008|10").put("第九名|大", "018|0").put("第九名|小", "018|1")
			.put("第九名|单", "028|0").put("第九名|双", "028|1")

			.put("第十名|1", "009|1").put("第十名|2", "009|2").put("第十名|3", "009|3").put("第十名|4", "009|4")
			.put("第十名|5", "009|5").put("第十名|6", "009|6").put("第十名|7", "009|7").put("第十名|8", "009|8")
			.put("第十名|9", "009|9").put("第十名|10", "009|10").put("第十名|大", "019|0").put("第十名|小", "019|1")
			.put("第十名|单", "029|0").put("第十名|双", "029|1")

			.put("冠亚|3", "037|3").put("冠亚|4", "037|4").put("冠亚|5", "037|5").put("冠亚|6", "037|6").put("冠亚|7", "037|7")
			.put("冠亚|8", "037|8").put("冠亚|9", "037|9").put("冠亚|10", "037|10").put("冠亚|11", "037|11")
			.put("冠亚|12", "037|12").put("冠亚|13", "037|13").put("冠亚|14", "037|14").put("冠亚|15", "037|15")
			.put("冠亚|16", "037|16").put("冠亚|17", "037|17").put("冠亚|18", "037|18").put("冠亚|19", "037|19")
			.put("冠亚|大", "035|0").put("冠亚|小", "035|1").put("冠亚|单", "036|0").put("冠亚|双", "036|1").build();

	Map<String, String> BALL_LIMIT_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "00").put("第一名|2", "00")
			.put("第一名|3", "00").put("第一名|4", "00").put("第一名|5", "00").put("第一名|6", "00").put("第一名|7", "00")
			.put("第一名|8", "00").put("第一名|9", "00").put("第一名|10", "00").put("第一名|大", "10").put("第一名|小", "10")
			.put("第一名|单", "11").put("第一名|双", "11").put("第一名|龙", "12").put("第一名|虎", "12")

			.put("第二名|1", "01").put("第二名|2", "01").put("第二名|3", "01").put("第二名|4", "01").put("第二名|5", "01")
			.put("第二名|6", "01").put("第二名|7", "01").put("第二名|8", "01").put("第二名|9", "01").put("第二名|10", "01")
			.put("第二名|大", "10").put("第二名|小", "10").put("第二名|单", "11").put("第二名|双", "11").put("第二名|龙", "12")
			.put("第二名|虎", "12")

			.put("第三名|1", "02").put("第三名|2", "02").put("第三名|3", "02").put("第三名|4", "02").put("第三名|5", "02")
			.put("第三名|6", "02").put("第三名|7", "02").put("第三名|8", "02").put("第三名|9", "02").put("第三名|10", "02")
			.put("第三名|大", "10").put("第三名|小", "10").put("第三名|单", "11").put("第三名|双", "11").put("第三名|龙", "12")
			.put("第三名|虎", "12")

			.put("第四名|1", "03").put("第四名|2", "03").put("第四名|3", "03").put("第四名|4", "03").put("第四名|5", "03")
			.put("第四名|6", "03").put("第四名|7", "03").put("第四名|8", "03").put("第四名|9", "03").put("第四名|10", "03")
			.put("第四名|大", "10").put("第四名|小", "10").put("第四名|单", "11").put("第四名|双", "11").put("第四名|龙", "12")
			.put("第四名|虎", "12")

			.put("第五名|1", "04").put("第五名|2", "04").put("第五名|3", "04").put("第五名|4", "04").put("第五名|5", "04")
			.put("第五名|6", "04").put("第五名|7", "04").put("第五名|8", "04").put("第五名|9", "04").put("第五名|10", "04")
			.put("第五名|大", "10").put("第五名|小", "10").put("第五名|单", "11").put("第五名|双", "11").put("第五名|龙", "12")
			.put("第五名|虎", "12")

			.put("第六名|1", "05").put("第六名|2", "05").put("第六名|3", "05").put("第六名|4", "05").put("第六名|5", "05")
			.put("第六名|6", "05").put("第六名|7", "05").put("第六名|8", "05").put("第六名|9", "05").put("第六名|10", "05")
			.put("第六名|大", "10").put("第六名|小", "10").put("第六名|单", "11").put("第六名|双", "11")

			.put("第七名|1", "06").put("第七名|2", "06").put("第七名|3", "06").put("第七名|4", "06").put("第七名|5", "06")
			.put("第七名|6", "06").put("第七名|7", "06").put("第七名|8", "06").put("第七名|9", "06").put("第七名|10", "06")
			.put("第七名|大", "10").put("第七名|小", "10").put("第七名|单", "11").put("第七名|双", "11")

			.put("第八名|1", "07").put("第八名|2", "07").put("第八名|3", "07").put("第八名|4", "07").put("第八名|5", "07")
			.put("第八名|6", "07").put("第八名|7", "07").put("第八名|8", "07").put("第八名|9", "07").put("第八名|10", "07")
			.put("第八名|大", "10").put("第八名|小", "10").put("第八名|单", "11").put("第八名|双", "11")

			.put("第九名|1", "08").put("第九名|2", "08").put("第九名|3", "08").put("第九名|4", "08").put("第九名|5", "08")
			.put("第九名|6", "08").put("第九名|7", "08").put("第九名|8", "08").put("第九名|9", "08").put("第九名|10", "08")
			.put("第九名|大", "10").put("第九名|小", "10").put("第九名|单", "11").put("第九名|双", "11")

			.put("第十名|1", "09").put("第十名|2", "09").put("第十名|3", "09").put("第十名|4", "09").put("第十名|5", "09")
			.put("第十名|6", "09").put("第十名|7", "09").put("第十名|8", "09").put("第十名|9", "09").put("第十名|10", "09")
			.put("第十名|大", "10").put("第十名|小", "10").put("第十名|单", "11").put("第十名|双", "11")

			.put("冠亚|3", "15").put("冠亚|4", "15").put("冠亚|5", "15").put("冠亚|6", "15").put("冠亚|7", "15").put("冠亚|8", "15")
			.put("冠亚|9", "15").put("冠亚|10", "15").put("冠亚|11", "15").put("冠亚|12", "15").put("冠亚|13", "15")
			.put("冠亚|14", "15").put("冠亚|15", "15").put("冠亚|16", "15").put("冠亚|17", "15").put("冠亚|18", "15")
			.put("冠亚|19", "15").put("冠亚|大", "13").put("冠亚|小", "13").put("冠亚|单", "14").put("冠亚|双", "14").build();

	/**
	 * pk10的1-5球码
	 */
	Map<String, String> BALL_NO15_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "000|1")
			.put("第一名|2", "000|2").put("第一名|3", "000|3").put("第一名|4", "000|4").put("第一名|5", "000|5")
			.put("第一名|6", "000|6").put("第一名|7", "000|7").put("第一名|8", "000|8").put("第一名|9", "000|9")
			.put("第一名|10", "000|10").put("第一名|大", "010|0").put("第一名|小", "010|1").put("第一名|单", "020|0")
			.put("第一名|双", "020|1").put("第一名|龙", "030|0").put("第一名|虎", "030|1")

			.put("第二名|1", "001|1").put("第二名|2", "001|2").put("第二名|3", "001|3").put("第二名|4", "001|4")
			.put("第二名|5", "001|5").put("第二名|6", "001|6").put("第二名|7", "001|7").put("第二名|8", "001|8")
			.put("第二名|9", "001|9").put("第二名|10", "001|10").put("第二名|大", "011|0").put("第二名|小", "011|1")
			.put("第二名|单", "021|0").put("第二名|双", "021|1").put("第二名|龙", "031|0").put("第二名|虎", "031|1")

			.put("第三名|1", "002|1").put("第三名|2", "002|2").put("第三名|3", "002|3").put("第三名|4", "002|4")
			.put("第三名|5", "002|5").put("第三名|6", "002|6").put("第三名|7", "002|7").put("第三名|8", "002|8")
			.put("第三名|9", "002|9").put("第三名|10", "002|10").put("第三名|大", "012|0").put("第三名|小", "012|1")
			.put("第三名|单", "022|0").put("第三名|双", "022|1").put("第三名|龙", "032|0").put("第三名|虎", "032|1")

			.put("第四名|1", "003|1").put("第四名|2", "003|2").put("第四名|3", "003|3").put("第四名|4", "003|4")
			.put("第四名|5", "003|5").put("第四名|6", "003|6").put("第四名|7", "003|7").put("第四名|8", "003|8")
			.put("第四名|9", "003|9").put("第四名|10", "003|10").put("第四名|大", "013|0").put("第四名|小", "013|1")
			.put("第四名|单", "023|0").put("第四名|双", "023|1").put("第四名|龙", "033|0").put("第四名|虎", "033|1")

			.put("第五名|1", "004|1").put("第五名|2", "004|2").put("第五名|3", "004|3").put("第五名|4", "004|4")
			.put("第五名|5", "004|5").put("第五名|6", "004|6").put("第五名|7", "004|7").put("第五名|8", "004|8")
			.put("第五名|9", "004|9").put("第五名|10", "004|10").put("第五名|大", "014|0").put("第五名|小", "014|1")
			.put("第五名|单", "024|0").put("第五名|双", "024|1").put("第五名|龙", "034|0").put("第五名|虎", "034|1").build();

	/**
	 * pk10的6-10球码
	 */
	Map<String, String> BALL_NO60_CODE = ImmutableMap.<String, String>builder().put("第六名|1", "005|1")
			.put("第六名|2", "005|2").put("第六名|3", "005|3").put("第六名|4", "005|4").put("第六名|5", "005|5")
			.put("第六名|6", "005|6").put("第六名|7", "005|7").put("第六名|8", "005|8").put("第六名|9", "005|9")
			.put("第六名|10", "005|10").put("第六名|大", "015|0").put("第六名|小", "015|1").put("第六名|单", "025|0")
			.put("第六名|双", "025|1")

			.put("第七名|1", "006|1").put("第七名|2", "006|2").put("第七名|3", "006|3").put("第七名|4", "006|4")
			.put("第七名|5", "006|5").put("第七名|6", "006|6").put("第七名|7", "006|7").put("第七名|8", "006|8")
			.put("第七名|9", "006|9").put("第七名|10", "006|10").put("第七名|大", "016|0").put("第七名|小", "016|1")
			.put("第七名|单", "026|0").put("第七名|双", "026|1")

			.put("第八名|1", "007|1").put("第八名|2", "007|2").put("第八名|3", "007|3").put("第八名|4", "007|4")
			.put("第八名|5", "007|5").put("第八名|6", "007|6").put("第八名|7", "007|7").put("第八名|8", "007|8")
			.put("第八名|9", "007|9").put("第八名|10", "007|10").put("第八名|大", "017|0").put("第八名|小", "017|1")
			.put("第八名|单", "027|0").put("第八名|双", "027|1")

			.put("第九名|1", "008|1").put("第九名|2", "008|2").put("第九名|3", "008|3").put("第九名|4", "008|4")
			.put("第九名|5", "008|5").put("第九名|6", "008|6").put("第九名|7", "008|7").put("第九名|8", "008|8")
			.put("第九名|9", "008|9").put("第九名|10", "008|10").put("第九名|大", "018|0").put("第九名|小", "018|1")
			.put("第九名|单", "028|0").put("第九名|双", "028|1")

			.put("第十名|1", "009|1").put("第十名|2", "009|2").put("第十名|3", "009|3").put("第十名|4", "009|4")
			.put("第十名|5", "009|5").put("第十名|6", "009|6").put("第十名|7", "009|7").put("第十名|8", "009|8")
			.put("第十名|9", "009|9").put("第十名|10", "009|10").put("第十名|大", "019|0").put("第十名|小", "019|1")
			.put("第十名|单", "029|0").put("第十名|双", "029|1").build();

	/**
	 * pk10的冠亚球码
	 */
	Map<String, String> BALL_SUMDT_CODE = ImmutableMap.<String, String>builder().put("冠亚|3", "037|3").put("冠亚|4", "037|4")
			.put("冠亚|5", "037|5").put("冠亚|6", "037|6").put("冠亚|7", "037|7").put("冠亚|8", "037|8").put("冠亚|9", "037|9")
			.put("冠亚|10", "037|10").put("冠亚|11", "037|11").put("冠亚|12", "037|12").put("冠亚|13", "037|13")
			.put("冠亚|14", "037|14").put("冠亚|15", "037|15").put("冠亚|16", "037|16").put("冠亚|17", "037|17")
			.put("冠亚|18", "037|18").put("冠亚|19", "037|19").put("冠亚|大", "035|0").put("冠亚|小", "035|1")
			.put("冠亚|单", "036|0").put("冠亚|双", "036|1").build();

	//=============================================pk10和幸运飞艇区域=============================================

	/**
	 * CQSSC的球码
	 */
	Map<String, String> CQSSC_BET_CODE = ImmutableMap.<String, String>builder().put("第一球|0", "000|0")
			.put("第一球|1", "000|1").put("第一球|2", "000|2").put("第一球|3", "000|3").put("第一球|4", "000|4")
			.put("第一球|5", "000|5").put("第一球|6", "000|6").put("第一球|7", "000|7").put("第一球|8", "000|8")
			.put("第一球|9", "000|9")

			.put("第二球|0", "001|0").put("第二球|1", "001|1").put("第二球|2", "001|2").put("第二球|3", "001|3")
			.put("第二球|4", "001|4").put("第二球|5", "001|5").put("第二球|6", "001|6").put("第二球|7", "001|7")
			.put("第二球|8", "001|8").put("第二球|9", "001|9")

			.put("第三球|0", "002|0").put("第三球|1", "002|1").put("第三球|2", "002|2").put("第三球|3", "002|3")
			.put("第三球|4", "002|4").put("第三球|5", "002|5").put("第三球|6", "002|6").put("第三球|7", "002|7")
			.put("第三球|8", "002|8").put("第三球|9", "002|9")

			.put("第四球|0", "003|0").put("第四球|1", "003|1").put("第四球|2", "003|2").put("第四球|3", "003|3")
			.put("第四球|4", "003|4").put("第四球|5", "003|5").put("第四球|6", "003|6").put("第四球|7", "003|7")
			.put("第四球|8", "003|8").put("第四球|9", "003|9")

			.put("第五球|0", "004|0").put("第五球|1", "004|1").put("第五球|2", "004|2").put("第五球|3", "004|3")
			.put("第五球|4", "004|4").put("第五球|5", "004|5").put("第五球|6", "004|6").put("第五球|7", "004|7")
			.put("第五球|8", "004|8").put("第五球|9", "004|9")

			.put("第一球|大", "005|2").put("第一球|小", "005|3").put("第一球|单", "005|0").put("第一球|双", "005|1")
			.put("第二球|大", "006|2").put("第二球|小", "006|3").put("第二球|单", "006|0").put("第二球|双", "006|1")
			.put("第三球|大", "007|2").put("第三球|小", "007|3").put("第三球|单", "007|0").put("第三球|双", "007|1")
			.put("第四球|大", "008|2").put("第四球|小", "008|3").put("第四球|单", "008|0").put("第四球|双", "008|1")
			.put("第五球|大", "009|2").put("第五球|小", "009|3").put("第五球|单", "009|0").put("第五球|双", "009|1")

			.put("总和|大", "010|2").put("总和|小", "010|3").put("总和|单", "010|0").put("总和|双", "010|1").put("总和|龙", "011|0")
			.put("总和|虎", "012|0").put("总和|和", "013|0")

			.put("前三|豹子", "014|0").put("中三|豹子", "015|0").put("后三|豹子", "016|0").put("前三|顺子", "017|0")
			.put("中三|顺子", "018|0").put("后三|顺子", "019|0").put("前三|对子", "020|0").put("中三|对子", "021|0")
			.put("后三|对子", "022|0").put("前三|半顺", "023|0").put("中三|半顺", "024|0").put("后三|半顺", "025|0")
			.put("前三|杂六", "026|0").put("中三|杂六", "027|0").put("后三|杂六", "028|0").build();

	Map<String, String> CQSSC_LIMIT_CODE = ImmutableMap.<String, String>builder().put("第一球|0", "00").put("第一球|1", "00")
			.put("第一球|2", "00").put("第一球|3", "00").put("第一球|4", "00").put("第一球|5", "00").put("第一球|6", "00")
			.put("第一球|7", "00").put("第一球|8", "00").put("第一球|9", "00")

			.put("第二球|0", "00").put("第二球|1", "00").put("第二球|2", "00").put("第二球|3", "00").put("第二球|4", "00")
			.put("第二球|5", "00").put("第二球|6", "00").put("第二球|7", "00").put("第二球|8", "00").put("第二球|9", "00")

			.put("第三球|0", "00").put("第三球|1", "00").put("第三球|2", "00").put("第三球|3", "00").put("第三球|4", "00")
			.put("第三球|5", "00").put("第三球|6", "00").put("第三球|7", "00").put("第三球|8", "00").put("第三球|9", "00")

			.put("第四球|0", "00").put("第四球|1", "00").put("第四球|2", "00").put("第四球|3", "00").put("第四球|4", "00")
			.put("第四球|5", "00").put("第四球|6", "00").put("第四球|7", "00").put("第四球|8", "00").put("第四球|9", "00")

			.put("第五球|0", "00").put("第五球|1", "00").put("第五球|2", "00").put("第五球|3", "00").put("第五球|4", "00")
			.put("第五球|5", "00").put("第五球|6", "00").put("第五球|7", "00").put("第五球|8", "00").put("第五球|9", "00")

			.put("第一球|大", "01").put("第一球|小", "01").put("第一球|单", "01").put("第一球|双", "01").put("第二球|大", "01")
			.put("第二球|小", "01").put("第二球|单", "01").put("第二球|双", "01").put("第三球|大", "01").put("第三球|小", "01")
			.put("第三球|单", "01").put("第三球|双", "01").put("第四球|大", "01").put("第四球|小", "01").put("第四球|单", "01")
			.put("第四球|双", "01").put("第五球|大", "01").put("第五球|小", "01").put("第五球|单", "01").put("第五球|双", "01")
			.put("总和|大", "01").put("总和|小", "01").put("总和|单", "01").put("总和|双", "01").put("总和|龙", "02").put("总和|虎", "02")
			.put("总和|和", "03")

			.put("前三|豹子", "04").put("中三|豹子", "04").put("后三|豹子", "04").put("前三|顺子", "05").put("中三|顺子", "05")
			.put("后三|顺子", "05").put("前三|对子", "06").put("中三|对子", "06").put("后三|对子", "06").put("前三|半顺", "07")
			.put("中三|半顺", "07").put("后三|半顺", "07").put("前三|杂六", "08").put("中三|杂六", "08").put("后三|杂六", "08").build();

	//=============================================CQSSC和幸运飞艇区域=============================================

	/**
	 * 游戏KLC投注信息code
	 */
	Map<String, String> KLC_BET_CODE = ImmutableMap.<String, String>builder().put("ball1", "play=ball1&ball=00&cat=00")
			.put("ball2", "play=ball2&ball=01&cat=01").put("ball3", "play=ball3&ball=02&cat=02")
			.put("ball4", "play=ball4&ball=03&cat=03").put("ball5", "play=ball5&ball=04&cat=04")
			.put("ball6", "play=ball6&ball=05&cat=05").put("ball7", "play=ball7&ball=06&cat=06")
			.put("ball8", "play=ball8&ball=07&cat=07").put("sumDT", "play=sumDT&ball=''&cat=13")
			.put("evenCode", "play=evenCode&ball=''").build();

	/**
	 * KLC的1球码
	 */
	Map<String, String>  KLC_BET_CODE_1 = ImmutableMap.<String, String>builder().put("第一球|1", "000|01")
			.put("第一球|2", "000|02").put("第一球|3", "000|03").put("第一球|4", "000|04").put("第一球|5", "000|05")
			.put("第一球|6", "000|06").put("第一球|7", "000|07").put("第一球|8", "000|08").put("第一球|9", "000|09")
			.put("第一球|10", "000|10").put("第一球|11", "000|11").put("第一球|12", "000|12").put("第一球|13", "000|13")
			.put("第一球|14", "000|14").put("第一球|15", "000|15").put("第一球|16", "000|16").put("第一球|17", "000|17")
			.put("第一球|18", "000|18").put("第一球|19", "000|19").put("第一球|20", "000|20").put("第一球|大", "016|23")
			.put("第一球|小", "016|24").put("第一球|单", "008|21").put("第一球|双", "008|22").put("第一球|尾大", "024|25")
			.put("第一球|尾小", "024|26").put("第一球|合数单", "032|27").put("第一球|合数双", "032|28").put("第一球|东", "051|38")
			.put("第一球|南", "051|39").put("第一球|西", "051|40").put("第一球|北", "051|41").put("第一球|中", "043|35")
			.put("第一球|发", "043|36").put("第一球|白", "043|37").put("第一球|龙", "059|42").put("第一球|虎", "060|43").build();

	//=============================================KLC区域=============================================

	/**
	 * 将游戏code 转换为盘口的游戏code
	 *
	 * @param game 游戏code
	 * @return 盘口的游戏code
	 */
	static String getGameCode(String game) {
		if (GAME_CODE_MAP.containsKey(game)) {
			return GAME_CODE_MAP.get(game);
		}
		throw new RuntimeException("未知的游戏Code");
	}

	/**
	 * 根据游戏code 和所属投注盘口获取投注code
	 *
	 * @param game        游戏code
	 * @param betHandicap 投注盘口
	 * @return 投注code
	 */
	static String getBetCode(String game, String betHandicap) {
		switch (game) {
			case "PK10":
				return PK10_BET_CODE.get(betHandicap);
			case "XYFT":
				return XYFT_BET_CODE.get(betHandicap);
			default:
				throw new RuntimeException("获取投注code异常");
		}
	}

}
