package com.ibm.common.utils.handicap.config;
import com.google.common.collect.ImmutableList;
import com.google.common.collect.ImmutableMap;

import java.util.List;
import java.util.Map;
/**
 * @Description: 盘口球类
 * @Author: zjj
 * @Date: 2019-10-29 14:42
 * @Email: 543974681@qq.com
 * @Version: v1.0
 */
public interface BallConfig {
	/**
	 * 投注限额
	 */
	Map<String, String> ITEM_TYPE_CODE = ImmutableMap.<String, String>builder().put("第一球|0", "0").put("第一球|1", "0")
			.put("第一球|2", "0").put("第一球|3", "0").put("第一球|4", "0").put("第一球|5", "0").put("第一球|6", "0").put("第一球|7", "0")
			.put("第一球|8", "0").put("第一球|9", "0").put("第一球|大", "1").put("第一球|小", "1").put("第一球|单", "1").put("第一球|双", "1")

			.put("第二球|0", "0").put("第二球|1", "0").put("第二球|2", "0").put("第二球|3", "0").put("第二球|4", "0").put("第二球|5", "0")
			.put("第二球|6", "0").put("第二球|7", "0").put("第二球|8", "0").put("第二球|9", "0").put("第二球|大", "1").put("第二球|小", "1")
			.put("第二球|单", "1").put("第二球|双", "1")

			.put("第三球|0", "0").put("第三球|1", "0").put("第三球|2", "0").put("第三球|3", "0").put("第三球|4", "0").put("第三球|5", "0")
			.put("第三球|6", "0").put("第三球|7", "0").put("第三球|8", "0").put("第三球|9", "0").put("第三球|大", "1").put("第三球|小", "1")
			.put("第三球|单", "1").put("第三球|双", "1")

			.put("第四球|0", "0").put("第四球|1", "0").put("第四球|2", "0").put("第四球|3", "0").put("第四球|4", "0").put("第四球|5", "0")
			.put("第四球|6", "0").put("第四球|7", "0").put("第四球|8", "0").put("第四球|9", "0").put("第四球|大", "1").put("第四球|小", "1")
			.put("第四球|单", "1").put("第四球|双", "1")

			.put("第五球|0", "0").put("第五球|1", "0").put("第五球|2", "0").put("第五球|3", "0").put("第五球|4", "0").put("第五球|5", "0")
			.put("第五球|6", "0").put("第五球|7", "0").put("第五球|8", "0").put("第五球|9", "0").put("第五球|大", "1").put("第五球|小", "1")
			.put("第五球|单", "1").put("第五球|双", "1")

			.put("总和|大", "7").put("总和|小", "7").put("总和|单", "7").put("总和|双", "7").put("龙虎和|龙", "8").put("龙虎和|虎", "8")
			.put("龙虎和|和", "8").put("前三|豹子", "2").put("中三|豹子", "2").put("后三|豹子", "2").put("前三|顺子", "3").put("中三|顺子", "3")
			.put("后三|顺子", "3").put("前三|对子", "4").put("中三|对子", "4").put("后三|对子", "4").put("前三|半顺", "5").put("中三|半顺", "5")
			.put("后三|半顺", "5").put("前三|杂六", "6").put("中三|杂六", "6").put("后三|杂六", "6").build();

	List<String> BET_ITEM = ImmutableList.<String>builder().add("第一球|0").add("第一球|1").add("第一球|2")
			.add("第一球|3").add("第一球|4").add("第一球|5").add("第一球|6").add("第一球|7").add("第一球|8").add("第一球|9").add("第一球|大")
			.add("第一球|小").add("第一球|单").add("第一球|双")

			.add("第二球|0").add("第二球|1").add("第二球|2").add("第二球|3").add("第二球|4").add("第二球|5").add("第二球|6").add("第二球|7")
			.add("第二球|8").add("第二球|9").add("第二球|大").add("第二球|小").add("第二球|单").add("第二球|双")

			.add("第三球|0").add("第三球|1").add("第三球|2").add("第三球|3").add("第三球|4").add("第三球|5").add("第三球|6").add("第三球|7")
			.add("第三球|8").add("第三球|9").add("第三球|大").add("第三球|小").add("第三球|单").add("第三球|双")

			.add("第四球|0").add("第四球|1").add("第四球|2").add("第四球|3").add("第四球|4").add("第四球|5").add("第四球|6").add("第四球|7")
			.add("第四球|8").add("第四球|9").add("第四球|大").add("第四球|小").add("第四球|单").add("第四球|双")

			.add("第五球|0").add("第五球|1").add("第五球|2").add("第五球|3").add("第五球|4").add("第五球|5").add("第五球|6").add("第五球|7")
			.add("第五球|8").add("第五球|9").add("第五球|大").add("第五球|小").add("第五球|单").add("第五球|双")

			.add("总和|大").add("总和|小").add("总和|单").add("总和|双").add("龙虎和|龙").add("龙虎和|虎").add("龙虎和|和").add("前三|豹子")
			.add("中三|豹子").add("后三|豹子").add("前三|顺子").add("中三|顺子").add("后三|顺子").add("前三|对子").add("中三|对子").add("后三|对子")
			.add("前三|半顺").add("中三|半顺").add("后三|半顺").add("前三|杂六").add("中三|杂六").add("后三|杂六").build();
}
