package com.ibm.common.utils.handicap.config;

import com.google.common.collect.ImmutableMap;
import com.ibm.common.core.configs.BWConfig;

import java.util.Map;

/**
 * @Description:
 * @Author: wwj
 * @Date: 2020/1/9 17:23
 * @Email: 97085010@qq.com
 * @Version: v1.0
 */
public interface BWNumberConfig extends BWConfig {


    /**
     * PK10所有球码code
     */
    Map<String, String> PK10_BALL_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "380101")
            .put("第一名|2", "380102").put("第一名|3", "380103").put("第一名|4", "380104").put("第一名|5", "380105")
            .put("第一名|6", "380106").put("第一名|7", "380107").put("第一名|8", "380108").put("第一名|9", "380109")
            .put("第一名|10", "380110").put("第一名|大", "310101").put("第一名|小", "310102").put("第一名|单", "320101")
            .put("第一名|双", "320102").put("第一名|龙", "350101").put("第一名|虎", "350102")

            .put("第二名|1", "380201").put("第二名|2", "380202").put("第二名|3", "380203").put("第二名|4", "380204")
            .put("第二名|5", "380205").put("第二名|6", "380206").put("第二名|7", "380207").put("第二名|8", "380208")
            .put("第二名|9", "380209").put("第二名|10", "380210").put("第二名|大", "310201").put("第二名|小", "310202")
            .put("第二名|单", "320201").put("第二名|双", "320202").put("第二名|龙", "350201").put("第二名|虎", "350202")

            .put("第三名|1", "380301").put("第三名|2", "380302").put("第三名|3", "380303").put("第三名|4", "380304")
            .put("第三名|5", "380305").put("第三名|6", "380306").put("第三名|7", "380307").put("第三名|8", "380308")
            .put("第三名|9", "380309").put("第三名|10", "380310").put("第三名|大", "310301").put("第三名|小", "310302")
            .put("第三名|单", "320301").put("第三名|双", "320302").put("第三名|龙", "350301").put("第三名|虎", "350302")

            .put("第四名|1", "380401").put("第四名|2", "380402").put("第四名|3", "380403").put("第四名|4", "380404")
            .put("第四名|5", "380405").put("第四名|6", "380406").put("第四名|7", "380407").put("第四名|8", "380408")
            .put("第四名|9", "380409").put("第四名|10", "380410").put("第四名|大", "310401").put("第四名|小", "310402")
            .put("第四名|单", "320401").put("第四名|双", "320402").put("第四名|龙", "350401").put("第四名|虎", "350402")

            .put("第五名|1", "380501").put("第五名|2", "380502").put("第五名|3", "380503").put("第五名|4", "380504")
            .put("第五名|5", "380505").put("第五名|6", "380506").put("第五名|7", "380507").put("第五名|8", "380508")
            .put("第五名|9", "380509").put("第五名|10", "380510").put("第五名|大", "310501").put("第五名|小", "310502")
            .put("第五名|单", "320501").put("第五名|双", "320502").put("第五名|龙", "350501").put("第五名|虎", "350502")

            .put("第六名|1", "380601").put("第六名|2", "380602").put("第六名|3", "380603").put("第六名|4", "380604")
            .put("第六名|5", "380605").put("第六名|6", "380606").put("第六名|7", "380607").put("第六名|8", "380608")
            .put("第六名|9", "380609").put("第六名|10", "380610").put("第六名|大", "310601").put("第六名|小", "310602")
            .put("第六名|单", "320601").put("第六名|双", "320602")

            .put("第七名|1", "380701").put("第七名|2", "380702").put("第七名|3", "380703").put("第七名|4", "380704")
            .put("第七名|5", "380705").put("第七名|6", "380706").put("第七名|7", "380707").put("第七名|8", "380708")
            .put("第七名|9", "380709").put("第七名|10", "380710").put("第七名|大", "310701").put("第七名|小", "310702")
            .put("第七名|单", "320701").put("第七名|双", "320702")

            .put("第八名|1", "380801").put("第八名|2", "380802").put("第八名|3", "380803").put("第八名|4", "380804")
            .put("第八名|5", "380805").put("第八名|6", "380806").put("第八名|7", "380807").put("第八名|8", "380808")
            .put("第八名|9", "380809").put("第八名|10", "380810").put("第八名|大", "310801").put("第八名|小", "310802")
            .put("第八名|单", "320801").put("第八名|双", "320802")

            .put("第九名|1", "380901").put("第九名|2", "380902").put("第九名|3", "380903").put("第九名|4", "380904")
            .put("第九名|5", "380905").put("第九名|6", "380906").put("第九名|7", "380907").put("第九名|8", "380908")
            .put("第九名|9", "380909").put("第九名|10", "380910").put("第九名|大", "310901").put("第九名|小", "310902")
            .put("第九名|单", "320901").put("第九名|双", "320902")

            .put("第十名|1", "381001").put("第十名|2", "381002").put("第十名|3", "381003").put("第十名|4", "381004")
            .put("第十名|5", "381005").put("第十名|6", "381006").put("第十名|7", "381007").put("第十名|8", "381008")
            .put("第十名|9", "381009").put("第十名|10", "381010").put("第十名|大", "311001").put("第十名|小", "311002")
            .put("第十名|单", "321001").put("第十名|双", "321002")

            .put("冠亚|3", "390003").put("冠亚|4", "390004").put("冠亚|5", "390005").put("冠亚|6", "390006").put("冠亚|7", "390007")
            .put("冠亚|8", "390008").put("冠亚|9", "390009").put("冠亚|10", "390010").put("冠亚|11", "390011").put("冠亚|12", "390012")
            .put("冠亚|13", "390013").put("冠亚|14", "390014").put("冠亚|15", "390015").put("冠亚|16", "390016")
            .put("冠亚|17", "390017").put("冠亚|18", "390018").put("冠亚|19", "390019").put("冠亚|大", "310001").put("冠亚|小", "310002")
            .put("冠亚|单", "320001").put("冠亚|双", "320002").build();

    /**
     * XYFT所有球码code
     */
    Map<String, String> XYFT_BALL_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "480101")
            .put("第一名|2", "480102").put("第一名|3", "480103").put("第一名|4", "480104").put("第一名|5", "480105")
            .put("第一名|6", "480106").put("第一名|7", "480107").put("第一名|8", "480108").put("第一名|9", "480109")
            .put("第一名|10", "480110").put("第一名|大", "410101").put("第一名|小", "410102").put("第一名|单", "420101")
            .put("第一名|双", "420102").put("第一名|龙", "450101").put("第一名|虎", "450102")

            .put("第二名|1", "480201").put("第二名|2", "480202").put("第二名|3", "480203").put("第二名|4", "480204")
            .put("第二名|5", "480205").put("第二名|6", "480206").put("第二名|7", "480207").put("第二名|8", "480208")
            .put("第二名|9", "480209").put("第二名|10", "480210").put("第二名|大", "410201").put("第二名|小", "410202")
            .put("第二名|单", "420201").put("第二名|双", "420202").put("第二名|龙", "450201").put("第二名|虎", "450202")

            .put("第三名|1", "480301").put("第三名|2", "480302").put("第三名|3", "480303").put("第三名|4", "480304")
            .put("第三名|5", "480305").put("第三名|6", "480306").put("第三名|7", "480307").put("第三名|8", "480308")
            .put("第三名|9", "480309").put("第三名|10", "480310").put("第三名|大", "410301").put("第三名|小", "410302")
            .put("第三名|单", "420301").put("第三名|双", "420302").put("第三名|龙", "450301").put("第三名|虎", "450302")

            .put("第四名|1", "480401").put("第四名|2", "480402").put("第四名|3", "480403").put("第四名|4", "480404")
            .put("第四名|5", "480405").put("第四名|6", "480406").put("第四名|7", "480407").put("第四名|8", "480408")
            .put("第四名|9", "480409").put("第四名|10", "480410").put("第四名|大", "410401").put("第四名|小", "410402")
            .put("第四名|单", "420401").put("第四名|双", "420402").put("第四名|龙", "450401").put("第四名|虎", "450402")

            .put("第五名|1", "480501").put("第五名|2", "480502").put("第五名|3", "480503").put("第五名|4", "480504")
            .put("第五名|5", "480505").put("第五名|6", "480506").put("第五名|7", "480507").put("第五名|8", "480508")
            .put("第五名|9", "480509").put("第五名|10", "480510").put("第五名|大", "410501").put("第五名|小", "410502")
            .put("第五名|单", "420501").put("第五名|双", "420502").put("第五名|龙", "450501").put("第五名|虎", "450501")

            .put("第六名|1", "480601").put("第六名|2", "480602").put("第六名|3", "480603").put("第六名|4", "480604")
            .put("第六名|5", "480605").put("第六名|6", "480606").put("第六名|7", "480607").put("第六名|8", "480608")
            .put("第六名|9", "480609").put("第六名|10", "480610").put("第六名|大", "410601").put("第六名|小", "410602")
            .put("第六名|单", "420601").put("第六名|双", "420602")

            .put("第七名|1", "480701").put("第七名|2", "480702").put("第七名|3", "480703").put("第七名|4", "480704")
            .put("第七名|5", "480705").put("第七名|6", "480706").put("第七名|7", "480707").put("第七名|8", "480708")
            .put("第七名|9", "480709").put("第七名|10", "480710").put("第七名|大", "410701").put("第七名|小", "410702")
            .put("第七名|单", "420701").put("第七名|双", "420702")

            .put("第八名|1", "480801").put("第八名|2", "480802").put("第八名|3", "480803").put("第八名|4", "480804")
            .put("第八名|5", "480805").put("第八名|6", "480806").put("第八名|7", "480807").put("第八名|8", "480808")
            .put("第八名|9", "480809").put("第八名|10", "480810").put("第八名|大", "410801").put("第八名|小", "410802")
            .put("第八名|单", "420801").put("第八名|双", "420802")

            .put("第九名|1", "480901").put("第九名|2", "480902").put("第九名|3", "480903").put("第九名|4", "480904")
            .put("第九名|5", "480905").put("第九名|6", "480906").put("第九名|7", "480907").put("第九名|8", "480908")
            .put("第九名|9", "480909").put("第九名|10", "480910").put("第九名|大", "410901").put("第九名|小", "410902")
            .put("第九名|单", "420901").put("第九名|双", "420902")

            .put("第十名|1", "481001").put("第十名|2", "481002").put("第十名|3", "481003").put("第十名|4", "481004")
            .put("第十名|5", "481005").put("第十名|6", "481006").put("第十名|7", "481007").put("第十名|8", "481008")
            .put("第十名|9", "481009").put("第十名|10", "481010").put("第十名|大", "411001").put("第十名|小", "411002")
            .put("第十名|单", "421001").put("第十名|双", "421002")

            .put("冠亚|3", "490003").put("冠亚|4", "490004").put("冠亚|5", "490005").put("冠亚|6", "490006").put("冠亚|7", "490007")
            .put("冠亚|8", "490008").put("冠亚|9", "490009").put("冠亚|10", "490010").put("冠亚|11", "490011").put("冠亚|12", "490012")
            .put("冠亚|13", "490013").put("冠亚|14", "490014").put("冠亚|15", "490015").put("冠亚|16", "490016")
            .put("冠亚|17", "490017").put("冠亚|18", "490018").put("冠亚|19", "490019").put("冠亚|大", "410001").put("冠亚|小", "410002")
            .put("冠亚|单", "420001").put("冠亚|双", "420002").build();


    /**
     * 投注信息
     */
    Map<String, String> BET_INFO_CODE = ImmutableMap.<String, String>builder().put("冠軍1", "第一名|1").put("冠軍2", "第一名|2")
            .put("冠軍3", "第一名|3").put("冠軍4", "第一名|4").put("冠軍5", "第一名|5").put("冠軍6", "第一名|6").put("冠軍7", "第一名|7")
            .put("冠軍8", "第一名|8").put("冠軍9", "第一名|9").put("冠軍10", "第一名|10").put("冠軍虎", "第一名|虎").put("冠軍龍", "第一名|龙")
            .put("冠軍單", "第一名|单").put("冠軍雙", "第一名|双").put("冠軍大", "第一名|大").put("冠軍小", "第一名|小")

            .put("亞軍1", "第二名|1").put("亞軍2", "第二名|2").put("亞軍3", "第二名|3").put("亞軍4", "第二名|4").put("亞軍5", "第二名|5")
            .put("亞軍6", "第二名|6").put("亞軍7", "第二名|7").put("亞軍8", "第二名|8").put("亞軍9", "第二名|9").put("亞軍10", "第二名|10")
            .put("亞軍虎", "第二名|虎").put("亞軍龍", "第二名|龙").put("亞軍單", "第二名|单").put("亞軍雙", "第二名|双").put("亞軍大", "第二名|大")
            .put("亞軍小", "第二名|小")

            .put("第三名1", "第三名|1").put("第三名2", "第三名|2").put("第三名3", "第三名|3").put("第三名4", "第三名|4").put("第三名5", "第三名|5")
            .put("第三名6", "第三名|6").put("第三名7", "第三名|7").put("第三名8", "第三名|8").put("第三名9", "第三名|9").put("第三名10", "第三名|10")
            .put("第三名虎", "第三名|虎").put("第三名龍", "第三名|龙").put("第三名單", "第三名|单").put("第三名雙", "第三名|双").put("第三名大", "第三名|大")
            .put("第三名小", "第三名|小")

            .put("第四名1", "第四名|1").put("第四名2", "第四名|2").put("第四名3", "第四名|3").put("第四名4", "第四名|4").put("第四名5", "第四名|5")
            .put("第四名6", "第四名|6").put("第四名7", "第四名|7").put("第四名8", "第四名|8").put("第四名9", "第四名|9").put("第四名10", "第四名|10")
            .put("第四名虎", "第四名|虎").put("第四名龍", "第四名|龙").put("第四名單", "第四名|单").put("第四名雙", "第四名|双").put("第四名大", "第四名|大")
            .put("第四名小", "第四名|小")

            .put("第五名1", "第五名|1").put("第五名2", "第五名|2").put("第五名3", "第五名|3").put("第五名4", "第五名|4").put("第五名5", "第五名|5")
            .put("第五名6", "第五名|6").put("第五名7", "第五名|7").put("第五名8", "第五名|8").put("第五名9", "第五名|9").put("第五名10", "第五名|10")
            .put("第五名虎", "第五名|虎").put("第五名龍", "第五名|龙").put("第五名單", "第五名|单").put("第五名雙", "第五名|双").put("第五名大", "第五名|大")
            .put("第五名小", "第五名|小")

            .put("第六名1", "第六名|1").put("第六名2", "第六名|2").put("第六名3", "第六名|3").put("第六名4", "第六名|4").put("第六名5", "第六名|5")
            .put("第六名6", "第六名|6").put("第六名7", "第六名|7").put("第六名8", "第六名|8").put("第六名9", "第六名|9").put("第六名10", "第六名|10")
            .put("第六名單", "第六名|单").put("第六名雙", "第六名|双").put("第六名大", "第六名|大").put("第六名小", "第六名|小")

            .put("第七名1", "第七名|1").put("第七名2", "第七名|2").put("第七名3", "第七名|3").put("第七名4", "第七名|4").put("第七名5", "第七名|5")
            .put("第七名6", "第七名|6").put("第七名7", "第七名|7").put("第七名8", "第七名|8").put("第七名9", "第七名|9").put("第七名10", "第七名|10")
            .put("第七名單", "第七名|单").put("第七名雙", "第七名|双").put("第七名大", "第七名|大").put("第七名小", "第七名|小")

            .put("第八名1", "第八名|1").put("第八名2", "第八名|2").put("第八名3", "第八名|3").put("第八名4", "第八名|4").put("第八名5", "第八名|5")
            .put("第八名6", "第八名|6").put("第八名7", "第八名|7").put("第八名8", "第八名|8").put("第八名9", "第八名|9").put("第八名10", "第八名|10")
            .put("第八名單", "第八名|单").put("第八名雙", "第八名|双").put("第八名大", "第八名|大").put("第八名小", "第八名|小")

            .put("第九名1", "第九名|1").put("第九名2", "第九名|2").put("第九名3", "第九名|3").put("第九名4", "第九名|4").put("第九名5", "第九名|5")
            .put("第九名6", "第九名|6").put("第九名7", "第九名|7").put("第九名8", "第九名|8").put("第九名9", "第九名|9").put("第九名10", "第九名|10")
            .put("第九名單", "第九名|单").put("第九名雙", "第九名|双").put("第九名大", "第九名|大").put("第九名小", "第九名|小")

            .put("第十名1", "第十名|1").put("第十名2", "第十名|2").put("第十名3", "第十名|3").put("第十名4", "第十名|4").put("第十名5", "第十名|5")
            .put("第十名6", "第十名|6").put("第十名7", "第十名|7").put("第十名8", "第十名|8").put("第十名9", "第十名|9").put("第十名10", "第十名|10")
            .put("第十名單", "第十名|单").put("第十名雙", "第十名|双").put("第十名大", "第十名|大").put("第十名小", "第十名|小")

            .put("冠亞和3", "冠亚|3").put("冠亞和4", "冠亚|4").put("冠亞和5", "冠亚|5").put("冠亞和6", "冠亚|6").put("冠亞和7", "冠亚|7")
            .put("冠亞和8", "冠亚|8").put("冠亞和9", "冠亚|9").put("冠亞和10", "冠亚|10").put("冠亞和11", "冠亚|11")
            .put("冠亞和12", "冠亚|12").put("冠亞和13", "冠亚|13").put("冠亞和14", "冠亚|14").put("冠亞和15", "冠亚|15")
            .put("冠亞和16", "冠亚|16").put("冠亞和17", "冠亚|17").put("冠亞和18", "冠亚|18").put("冠亞和19", "冠亚|19")
            .put("冠亞單", "冠亚|单").put("冠亞雙", "冠亚|双").put("冠亞大", "冠亚|大").put("冠亞小", "冠亚|小").build();

    /**
     * 投注限制
     */
    Map<String, String> BET_LIMIT_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "00").put("第一名|2", "00")
            .put("第一名|3", "00").put("第一名|4", "00").put("第一名|5", "00").put("第一名|6", "00").put("第一名|7", "00")
            .put("第一名|8", "00").put("第一名|9", "00").put("第一名|10", "00").put("第一名|大", "00").put("第一名|小", "00")
            .put("第一名|单", "00").put("第一名|双", "00").put("第一名|龙", "00").put("第一名|虎", "00")

            .put("第二名|1", "00").put("第二名|2", "00").put("第二名|3", "00").put("第二名|4", "00").put("第二名|5", "00")
            .put("第二名|6", "00").put("第二名|7", "00").put("第二名|8", "00").put("第二名|9", "00").put("第二名|10", "00")
            .put("第二名|大", "00").put("第二名|小", "00").put("第二名|单", "00").put("第二名|双", "00").put("第二名|龙", "00")
            .put("第二名|虎", "00")

            .put("第三名|1", "00").put("第三名|2", "00").put("第三名|3", "00").put("第三名|4", "00").put("第三名|5", "00")
            .put("第三名|6", "00").put("第三名|7", "00").put("第三名|8", "00").put("第三名|9", "00").put("第三名|10", "00")
            .put("第三名|大", "00").put("第三名|小", "00").put("第三名|单", "00").put("第三名|双", "00").put("第三名|龙", "00")
            .put("第三名|虎", "00")

            .put("第四名|1", "00").put("第四名|2", "00").put("第四名|3", "00").put("第四名|4", "00").put("第四名|5", "00")
            .put("第四名|6", "00").put("第四名|7", "00").put("第四名|8", "00").put("第四名|9", "00").put("第四名|10", "00")
            .put("第四名|大", "00").put("第四名|小", "00").put("第四名|单", "00").put("第四名|双", "00").put("第四名|龙", "00")
            .put("第四名|虎", "00")

            .put("第五名|1", "00").put("第五名|2", "00").put("第五名|3", "00").put("第五名|4", "00").put("第五名|5", "00")
            .put("第五名|6", "00").put("第五名|7", "00").put("第五名|8", "00").put("第五名|9", "00").put("第五名|10", "00")
            .put("第五名|大", "00").put("第五名|小", "00").put("第五名|单", "00").put("第五名|双", "00").put("第五名|龙", "00")
            .put("第五名|虎", "00")

            .put("第六名|1", "00").put("第六名|2", "00").put("第六名|3", "00").put("第六名|4", "00").put("第六名|5", "00")
            .put("第六名|6", "00").put("第六名|7", "00").put("第六名|8", "00").put("第六名|9", "00").put("第六名|10", "00")
            .put("第六名|大", "00").put("第六名|小", "00").put("第六名|单", "00").put("第六名|双", "00")

            .put("第七名|1", "00").put("第七名|2", "00").put("第七名|3", "00").put("第七名|4", "00").put("第七名|5", "00")
            .put("第七名|6", "00").put("第七名|7", "00").put("第七名|8", "00").put("第七名|9", "00").put("第七名|10", "00")
            .put("第七名|大", "00").put("第七名|小", "00").put("第七名|单", "00").put("第七名|双", "00")

            .put("第八名|1", "00").put("第八名|2", "00").put("第八名|3", "00").put("第八名|4", "00").put("第八名|5", "00")
            .put("第八名|6", "00").put("第八名|7", "00").put("第八名|8", "00").put("第八名|9", "00").put("第八名|10", "00")
            .put("第八名|大", "00").put("第八名|小", "00").put("第八名|单", "00").put("第八名|双", "00")

            .put("第九名|1", "00").put("第九名|2", "00").put("第九名|3", "00").put("第九名|4", "00").put("第九名|5", "00")
            .put("第九名|6", "00").put("第九名|7", "00").put("第九名|8", "00").put("第九名|9", "00").put("第九名|10", "00")
            .put("第九名|大", "00").put("第九名|小", "00").put("第九名|单", "00").put("第九名|双", "00")

            .put("第十名|1", "00").put("第十名|2", "00").put("第十名|3", "00").put("第十名|4", "00").put("第十名|5", "00")
            .put("第十名|6", "00").put("第十名|7", "00").put("第十名|8", "00").put("第十名|9", "00").put("第十名|10", "00")
            .put("第十名|大", "00").put("第十名|小", "00").put("第十名|单", "00").put("第十名|双", "00")

            .put("冠亚|3", "00").put("冠亚|4", "00").put("冠亚|5", "00").put("冠亚|6", "00").put("冠亚|7", "00").put("冠亚|8", "00")
            .put("冠亚|9", "00").put("冠亚|10", "00").put("冠亚|11", "00").put("冠亚|12", "00").put("冠亚|13", "00")
            .put("冠亚|14", "00").put("冠亚|15", "00").put("冠亚|16", "00").put("冠亚|17", "00").put("冠亚|18", "00")
            .put("冠亚|19", "00").put("冠亚|大", "00").put("冠亚|小", "00").put("冠亚|单", "00").put("冠亚|双", "00").build();



}
