package com.ibm.common.utils.handicap.config;

import com.google.common.collect.ImmutableMap;

import java.util.Map;

/**
 * @Description:
 * @Author: wwj
 * @Date: 2019/12/27 16:08
 * @Email: 97085010@qq.com
 * @Version: v1.0
 */
public interface FCNumberConfig {

    Map<String, String> GAME_TYPE_CODE = ImmutableMap.<String, String>builder().put("dobleSides",
            "lmp").put("ballNO", "d1_10").put("sumDT", "12").build();

    Map<String,String> GAME_ODDS_ID = ImmutableMap.<String, String>builder().put("ballNO","1,5,9,13,17,21,24,27,30,33").
            put("dobleSides","2,3,4,6,7,8,10,11,12,14,15,16,18,19,20,22,23,25,26,28,29,31,32,34,35,37,38")
            .put("sumDT","1,2,3,4,5,6,7,8,36,37,38").build();



    /**
     * 所有球码code
     */
    Map<String, String> BALL_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "1")
            .put("第一名|2", "2").put("第一名|3", "3").put("第一名|4", "4").put("第一名|5", "5")
            .put("第一名|6", "6").put("第一名|7", "7").put("第一名|8", "8").put("第一名|9", "9")
            .put("第一名|10", "10").put("第一名|大", "11").put("第一名|小", "12").put("第一名|单", "13")
            .put("第一名|双", "14").put("第一名|龙", "15").put("第一名|虎", "16")

            .put("第二名|1", "17").put("第二名|2", "18").put("第二名|3", "19").put("第二名|4", "20")
            .put("第二名|5", "21").put("第二名|6", "22").put("第二名|7", "23").put("第二名|8", "24")
            .put("第二名|9", "25").put("第二名|10", "26").put("第二名|大", "27").put("第二名|小", "28")
            .put("第二名|单", "29").put("第二名|双", "30").put("第二名|龙", "31").put("第二名|虎", "32")

            .put("第三名|1", "33").put("第三名|2", "34").put("第三名|3", "35").put("第三名|4", "36")
            .put("第三名|5", "37").put("第三名|6", "38").put("第三名|7", "39").put("第三名|8", "40")
            .put("第三名|9", "41").put("第三名|10", "42").put("第三名|大", "43").put("第三名|小", "44")
            .put("第三名|单", "45").put("第三名|双", "46").put("第三名|龙", "47").put("第三名|虎", "48")

            .put("第四名|1", "49").put("第四名|2", "50").put("第四名|3", "51").put("第四名|4", "52")
            .put("第四名|5", "53").put("第四名|6", "54").put("第四名|7", "55").put("第四名|8", "56")
            .put("第四名|9", "57").put("第四名|10", "58").put("第四名|大", "59").put("第四名|小", "60")
            .put("第四名|单", "61").put("第四名|双", "62").put("第四名|龙", "63").put("第四名|虎", "64")

            .put("第五名|1", "65").put("第五名|2", "66").put("第五名|3", "67").put("第五名|4", "68")
            .put("第五名|5", "69").put("第五名|6", "70").put("第五名|7", "71").put("第五名|8", "72")
            .put("第五名|9", "73").put("第五名|10", "74").put("第五名|大", "75").put("第五名|小", "76")
            .put("第五名|单", "77").put("第五名|双", "78").put("第五名|龙", "79").put("第五名|虎", "80")

            .put("第六名|1", "81").put("第六名|2", "82").put("第六名|3", "83").put("第六名|4", "84")
            .put("第六名|5", "85").put("第六名|6", "86").put("第六名|7", "87").put("第六名|8", "88")
            .put("第六名|9", "89").put("第六名|10", "90").put("第六名|大", "91").put("第六名|小", "92")
            .put("第六名|单", "93").put("第六名|双", "94")

            .put("第七名|1", "95").put("第七名|2", "96").put("第七名|3", "97").put("第七名|4", "98")
            .put("第七名|5", "99").put("第七名|6", "100").put("第七名|7", "101").put("第七名|8", "102")
            .put("第七名|9", "103").put("第七名|10", "104").put("第七名|大", "105").put("第七名|小", "106")
            .put("第七名|单", "107").put("第七名|双", "108")

            .put("第八名|1", "109").put("第八名|2", "110").put("第八名|3", "111").put("第八名|4", "112")
            .put("第八名|5", "113").put("第八名|6", "114").put("第八名|7", "115").put("第八名|8", "116")
            .put("第八名|9", "117").put("第八名|10", "118").put("第八名|大", "119").put("第八名|小", "120")
            .put("第八名|单", "121").put("第八名|双", "122")

            .put("第九名|1", "123").put("第九名|2", "124").put("第九名|3", "125").put("第九名|4", "126")
            .put("第九名|5", "127").put("第九名|6", "128").put("第九名|7", "129").put("第九名|8", "130")
            .put("第九名|9", "131").put("第九名|10", "132").put("第九名|大", "133").put("第九名|小", "134")
            .put("第九名|单", "135").put("第九名|双", "136")

            .put("第十名|1", "137").put("第十名|2", "138").put("第十名|3", "139").put("第十名|4", "140")
            .put("第十名|5", "141").put("第十名|6", "142").put("第十名|7", "143").put("第十名|8", "144")
            .put("第十名|9", "145").put("第十名|10", "146").put("第十名|大", "147").put("第十名|小", "148")
            .put("第十名|单", "149").put("第十名|双", "150")

            .put("冠亚|3", "151").put("冠亚|4", "152").put("冠亚|5", "153").put("冠亚|6", "154").put("冠亚|7", "155")
            .put("冠亚|8", "156").put("冠亚|9", "157").put("冠亚|10", "158").put("冠亚|11", "159").put("冠亚|12", "160")
            .put("冠亚|13", "161").put("冠亚|14", "162").put("冠亚|15", "163").put("冠亚|16", "164")
            .put("冠亚|17", "165").put("冠亚|18", "166").put("冠亚|19", "167").put("冠亚|大", "168").put("冠亚|小", "169")
            .put("冠亚|单", "170").put("冠亚|双", "171").build();

    /**
     * 投注信息
     */
    Map<String, String> BET_INFO_CODE = ImmutableMap.<String, String>builder().put("冠軍1", "第一名|1").put("冠軍2", "第一名|2")
            .put("冠軍3", "第一名|3").put("冠軍4", "第一名|4").put("冠軍5", "第一名|5").put("冠軍6", "第一名|6").put("冠軍7", "第一名|7")
            .put("冠軍8", "第一名|8").put("冠軍9", "第一名|9").put("冠軍10", "第一名|10").put("冠軍龍虎虎", "第一名|虎").put("冠军龍虎龍", "第一名|龙")
            .put("冠軍單雙單", "第一名|单").put("冠軍單雙雙", "第一名|双").put("冠軍大小大", "第一名|大").put("冠軍大小小", "第一名|小")

            .put("亞軍1", "第二名|1").put("亞軍2", "第二名|2").put("亞軍3", "第二名|3").put("亞軍4", "第二名|4").put("亞軍5", "第二名|5")
            .put("亞軍6", "第二名|6").put("亞軍7", "第二名|7").put("亞軍8", "第二名|8").put("亞軍9", "第二名|9").put("亞軍10", "第二名|10")
            .put("亞軍龍虎虎", "第二名|虎").put("亞軍龍虎龍", "第二名|龙").put("亞軍單雙單", "第二名|单").put("亞軍單雙雙", "第二名|双").put("亞軍大小大", "第二名|大")
            .put("亞軍大小小", "第二名|小")

            .put("季軍1", "第三名|1").put("季軍2", "第三名|2").put("季軍3", "第三名|3").put("季軍4", "第三名|4").put("季軍5", "第三名|5")
            .put("季軍6", "第三名|6").put("季軍7", "第三名|7").put("季軍8", "第三名|8").put("季軍9", "第三名|9").put("季軍10", "第三名|10")
            .put("季軍龍虎虎", "第三名|虎").put("季軍龍虎龍", "第三名|龙").put("季軍單雙單", "第三名|单").put("季軍單雙雙", "第三名|双").put("季軍大小大", "第三名|大")
            .put("季軍大小小", "第三名|小")

            .put("第四名1", "第四名|1").put("第四名2", "第四名|2").put("第四名3", "第四名|3").put("第四名4", "第四名|4").put("第四名5", "第四名|5")
            .put("第四名6", "第四名|6").put("第四名7", "第四名|7").put("第四名8", "第四名|8").put("第四名9", "第四名|9").put("第四名10", "第四名|10")
            .put("第四名龍虎虎", "第四名|虎").put("第四名龍虎龍", "第四名|龙").put("第四名單雙單", "第四名|单").put("第四名單雙雙", "第四名|双").put("第四名大小大", "第四名|大")
            .put("第四名大小小", "第四名|小")

            .put("第五名1", "第五名|1").put("第五名2", "第五名|2").put("第五名3", "第五名|3").put("第五名4", "第五名|4").put("第五名5", "第五名|5")
            .put("第五名6", "第五名|6").put("第五名7", "第五名|7").put("第五名8", "第五名|8").put("第五名9", "第五名|9").put("第五名10", "第五名|10")
            .put("第五名龍虎虎", "第五名|虎").put("第五名龍虎龍", "第五名|龙").put("第五名單雙單", "第五名|单").put("第五名單雙雙", "第五名|双").put("第五名大小大", "第五名|大")
            .put("第五名大小小", "第五名|小")

            .put("第六名1", "第六名|1").put("第六名2", "第六名|2").put("第六名3", "第六名|3").put("第六名4", "第六名|4").put("第六名5", "第六名|5")
            .put("第六名6", "第六名|6").put("第六名7", "第六名|7").put("第六名8", "第六名|8").put("第六名9", "第六名|9").put("第六名10", "第六名|10")
            .put("第六名單雙單", "第六名|单").put("第六名單雙雙", "第六名|双").put("第六名大小大", "第六名|大").put("第六名大小小", "第六名|小")

            .put("第七名1", "第七名|1").put("第七名2", "第七名|2").put("第七名3", "第七名|3").put("第七名4", "第七名|4").put("第七名5", "第七名|5")
            .put("第七名6", "第七名|6").put("第七名7", "第七名|7").put("第七名8", "第七名|8").put("第七名9", "第七名|9").put("第七名10", "第七名|10")
            .put("第七名單雙單", "第七名|单").put("第七名單雙雙", "第七名|双").put("第七名大小大", "第七名|大").put("第七名大小小", "第七名|小")

            .put("第八名1", "第八名|1").put("第八名2", "第八名|2").put("第八名3", "第八名|3").put("第八名4", "第八名|4").put("第八名5", "第八名|5")
            .put("第八名6", "第八名|6").put("第八名7", "第八名|7").put("第八名8", "第八名|8").put("第八名9", "第八名|9").put("第八名10", "第八名|10")
            .put("第八名單雙單", "第八名|单").put("第八名單雙雙", "第八名|双").put("第八名大小大", "第八名|大").put("第八名大小小", "第八名|小")

            .put("第九名1", "第九名|1").put("第九名2", "第九名|2").put("第九名3", "第九名|3").put("第九名4", "第九名|4").put("第九名5", "第九名|5")
            .put("第九名6", "第九名|6").put("第九名7", "第九名|7").put("第九名8", "第九名|8").put("第九名9", "第九名|9").put("第九名10", "第九名|10")
            .put("第九名單雙單", "第九名|单").put("第九名單雙雙", "第九名|双").put("第九名大小大", "第九名|大").put("第九名大小小", "第九名|小")

            .put("第十名1", "第十名|1").put("第十名2", "第十名|2").put("第十名3", "第十名|3").put("第十名4", "第十名|4").put("第十名5", "第十名|5")
            .put("第十名6", "第十名|6").put("第十名7", "第十名|7").put("第十名8", "第十名|8").put("第十名9", "第十名|9").put("第十名10", "第十名|10")
            .put("第十名單雙單", "第十名|单").put("第十名單雙雙", "第十名|双").put("第十名大小大", "第十名|大").put("第十名大小小", "第十名|小")

            .put("冠、亞軍和 指定3", "冠亚|3").put("冠、亞軍和 指定4", "冠亚|4").put("冠、亞軍和 指定5", "冠亚|5").put("冠、亞軍和 指定6", "冠亚|6").put("冠、亞軍和 指定7", "冠亚|7")
            .put("冠、亞軍和 指定8", "冠亚|8").put("冠、亞軍和 指定9", "冠亚|9").put("冠、亞軍和 指定10", "冠亚|10").put("冠、亞軍和 指定11", "冠亚|11")
            .put("冠、亞軍和 指定12", "冠亚|12").put("冠、亞軍和 指定13", "冠亚|13").put("冠、亞軍和 指定14", "冠亚|14").put("冠、亞軍和 指定15", "冠亚|15")
            .put("冠、亞軍和 指定16", "冠亚|16").put("冠、亞軍和 指定17", "冠亚|17").put("冠、亞軍和 指定18", "冠亚|18").put("冠、亞軍和 指定19", "冠亚|19")
            .put("冠、亞軍和單雙單", "冠亚|单").put("冠、亞軍和單雙雙", "冠亚|双").put("冠、亞軍和大小大", "冠亚|大").put("冠、亞軍和大小小", "冠亚|小").build();



    /**
     * 投注限制
     */
    Map<String, String> BET_LIMIT_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "00").put("第一名|2", "00")
            .put("第一名|3", "00").put("第一名|4", "00").put("第一名|5", "00").put("第一名|6", "00").put("第一名|7", "00")
            .put("第一名|8", "00").put("第一名|9", "00").put("第一名|10", "00").put("第一名|大", "01").put("第一名|小", "01")
            .put("第一名|单", "02").put("第一名|双", "02").put("第一名|龙", "03").put("第一名|虎", "03")

            .put("第二名|1", "00").put("第二名|2", "00").put("第二名|3", "00").put("第二名|4", "00").put("第二名|5", "00")
            .put("第二名|6", "00").put("第二名|7", "00").put("第二名|8", "00").put("第二名|9", "00").put("第二名|10", "00")
            .put("第二名|大", "01").put("第二名|小", "01").put("第二名|单", "02").put("第二名|双", "02").put("第二名|龙", "03")
            .put("第二名|虎", "03")

            .put("第三名|1", "00").put("第三名|2", "00").put("第三名|3", "00").put("第三名|4", "00").put("第三名|5", "00")
            .put("第三名|6", "00").put("第三名|7", "00").put("第三名|8", "00").put("第三名|9", "00").put("第三名|10", "00")
            .put("第三名|大", "01").put("第三名|小", "01").put("第三名|单", "02").put("第三名|双", "02").put("第三名|龙", "03")
            .put("第三名|虎", "03")

            .put("第四名|1", "00").put("第四名|2", "00").put("第四名|3", "00").put("第四名|4", "00").put("第四名|5", "00")
            .put("第四名|6", "00").put("第四名|7", "00").put("第四名|8", "00").put("第四名|9", "00").put("第四名|10", "00")
            .put("第四名|大", "01").put("第四名|小", "01").put("第四名|单", "02").put("第四名|双", "02").put("第四名|龙", "03")
            .put("第四名|虎", "03")

            .put("第五名|1", "00").put("第五名|2", "00").put("第五名|3", "00").put("第五名|4", "00").put("第五名|5", "00")
            .put("第五名|6", "00").put("第五名|7", "00").put("第五名|8", "00").put("第五名|9", "00").put("第五名|10", "00")
            .put("第五名|大", "01").put("第五名|小", "01").put("第五名|单", "02").put("第五名|双", "02").put("第五名|龙", "03")
            .put("第五名|虎", "03")

            .put("第六名|1", "00").put("第六名|2", "00").put("第六名|3", "00").put("第六名|4", "00").put("第六名|5", "00")
            .put("第六名|6", "00").put("第六名|7", "00").put("第六名|8", "00").put("第六名|9", "00").put("第六名|10", "00")
            .put("第六名|大", "01").put("第六名|小", "01").put("第六名|单", "02").put("第六名|双", "02")

            .put("第七名|1", "00").put("第七名|2", "00").put("第七名|3", "00").put("第七名|4", "00").put("第七名|5", "00")
            .put("第七名|6", "00").put("第七名|7", "00").put("第七名|8", "00").put("第七名|9", "00").put("第七名|10", "00")
            .put("第七名|大", "01").put("第七名|小", "01").put("第七名|单", "02").put("第七名|双", "02")

            .put("第八名|1", "00").put("第八名|2", "00").put("第八名|3", "00").put("第八名|4", "00").put("第八名|5", "00")
            .put("第八名|6", "00").put("第八名|7", "00").put("第八名|8", "00").put("第八名|9", "00").put("第八名|10", "00")
            .put("第八名|大", "01").put("第八名|小", "01").put("第八名|单", "02").put("第八名|双", "02")

            .put("第九名|1", "00").put("第九名|2", "00").put("第九名|3", "00").put("第九名|4", "00").put("第九名|5", "00")
            .put("第九名|6", "00").put("第九名|7", "00").put("第九名|8", "00").put("第九名|9", "00").put("第九名|10", "00")
            .put("第九名|大", "01").put("第九名|小", "01").put("第九名|单", "02").put("第九名|双", "02")

            .put("第十名|1", "00").put("第十名|2", "00").put("第十名|3", "00").put("第十名|4", "00").put("第十名|5", "00")
            .put("第十名|6", "00").put("第十名|7", "00").put("第十名|8", "00").put("第十名|9", "00").put("第十名|10", "00")
            .put("第十名|大", "01").put("第十名|小", "01").put("第十名|单", "02").put("第十名|双", "02")

            .put("冠亚|3", "04").put("冠亚|4", "04").put("冠亚|5", "04").put("冠亚|6", "04").put("冠亚|7", "04").put("冠亚|8", "04")
            .put("冠亚|9", "04").put("冠亚|10", "04").put("冠亚|11", "04").put("冠亚|12", "04").put("冠亚|13", "04")
            .put("冠亚|14", "04").put("冠亚|15", "04").put("冠亚|16", "04").put("冠亚|17", "04").put("冠亚|18", "04")
            .put("冠亚|19", "04").put("冠亚|大", "05").put("冠亚|小", "05").put("冠亚|单", "06").put("冠亚|双", "06").build();

}
