package com.ibm.common.utils.handicap.config;
import com.google.common.collect.ImmutableMap;
import com.ibm.common.core.configs.HqConfig;

import java.util.Map;
/**
 * @Description: HQ球类
 * @Author: zjj
 * @Date: 2019-10-29 11:40
 * @Email: 543974681@qq.com
 * @Version: v1.0
 */
public interface HqBallConfig extends HqConfig {

	/**
	 * 游戏code
	 */
	Map<String, String> BALL_CODE = ImmutableMap.<String, String>builder().put("第一球|0", "01100").put("第一球|1", "01101")
			.put("第一球|2", "01102").put("第一球|3", "01103").put("第一球|4", "01104").put("第一球|5", "01105")
			.put("第一球|6", "01106").put("第一球|7", "01107").put("第一球|8", "01108").put("第一球|9", "01109")
			.put("第一球|大", "01201").put("第一球|小", "01202").put("第一球|单", "01301").put("第一球|双", "01302")

			.put("第二球|0", "02100").put("第二球|1", "02101").put("第二球|2", "02102").put("第二球|3", "02103")
			.put("第二球|4", "02104").put("第二球|5", "02105").put("第二球|6", "02106").put("第二球|7", "02107")
			.put("第二球|8", "02108").put("第二球|9", "02109").put("第二球|大", "02201").put("第二球|小", "02202")
			.put("第二球|单", "02301").put("第二球|双", "02302")

			.put("第三球|0", "03100").put("第三球|1", "03101").put("第三球|2", "03102").put("第三球|3", "03103")
			.put("第三球|4", "03104").put("第三球|5", "03105").put("第三球|6", "03106").put("第三球|7", "03107")
			.put("第三球|8", "03108").put("第三球|9", "03109").put("第三球|大", "03201").put("第三球|小", "03202")
			.put("第三球|单", "03301").put("第三球|双", "03302")

			.put("第四球|0", "04100").put("第四球|1", "04101").put("第四球|2", "04102").put("第四球|3", "04103")
			.put("第四球|4", "04104").put("第四球|5", "04105").put("第四球|6", "04106").put("第四球|7", "04107")
			.put("第四球|8", "04108").put("第四球|9", "04109").put("第四球|大", "04201").put("第四球|小", "04202")
			.put("第四球|单", "04301").put("第四球|双", "04302")

			.put("第五球|0", "05100").put("第五球|1", "05101").put("第五球|2", "05102").put("第五球|3", "05103")
			.put("第五球|4", "05104").put("第五球|5", "05105").put("第五球|6", "05106").put("第五球|7", "05107")
			.put("第五球|8", "05108").put("第五球|9", "05109").put("第五球|大", "05201").put("第五球|小", "05202")
			.put("第五球|单", "05301").put("第五球|双", "05302")

			.put("总和|大", "00201").put("总和|小", "00202").put("总和|单", "00301").put("总和|双", "00302").put("龙虎和|龙", "01401")
			.put("龙虎和|虎", "01402").put("龙虎和|和", "01403").put("前三|豹子", "12501").put("中三|豹子", "13501")
			.put("后三|豹子", "14501").put("前三|顺子", "12502").put("中三|顺子", "13502").put("后三|顺子", "14502")
			.put("前三|对子", "12503").put("中三|对子", "13503").put("后三|对子", "14503").put("前三|半顺", "12504")
			.put("中三|半顺", "13504").put("后三|半顺", "14504").put("前三|杂六", "12505").put("中三|杂六", "13505")
			.put("后三|杂六", "14505").build();

	/**
	 * 投注限制
	 */
	Map<String, String> BET_LIMIT_CODE = ImmutableMap.<String, String>builder().put("第一球|0", "00").put("第一球|1", "00")
			.put("第一球|2", "00").put("第一球|3", "00").put("第一球|4", "00").put("第一球|5", "00").put("第一球|6", "00")
			.put("第一球|7", "00").put("第一球|8", "00").put("第一球|9", "00").put("第一球|大", "01").put("第一球|小", "01")
			.put("第一球|单", "01").put("第一球|双", "01")

			.put("第二球|0", "00").put("第二球|1", "00").put("第二球|2", "00").put("第二球|3", "00").put("第二球|4", "00")
			.put("第二球|5", "00").put("第二球|6", "00").put("第二球|7", "00").put("第二球|8", "00").put("第二球|9", "00")
			.put("第二球|大", "01").put("第二球|小", "01").put("第二球|单", "01").put("第二球|双", "01")

			.put("第三球|0", "00").put("第三球|1", "00").put("第三球|2", "00").put("第三球|3", "00").put("第三球|4", "00")
			.put("第三球|5", "00").put("第三球|6", "00").put("第三球|7", "00").put("第三球|8", "00").put("第三球|9", "00")
			.put("第三球|大", "01").put("第三球|小", "01").put("第三球|单", "01").put("第三球|双", "01")

			.put("第四球|0", "00").put("第四球|1", "00").put("第四球|2", "00").put("第四球|3", "00").put("第四球|4", "00")
			.put("第四球|5", "00").put("第四球|6", "00").put("第四球|7", "00").put("第四球|8", "00").put("第四球|9", "00")
			.put("第四球|大", "01").put("第四球|小", "01").put("第四球|单", "01").put("第四球|双", "01")

			.put("第五球|0", "00").put("第五球|1", "00").put("第五球|2", "00").put("第五球|3", "00").put("第五球|4", "00")
			.put("第五球|5", "00").put("第五球|6", "00").put("第五球|7", "00").put("第五球|8", "00").put("第五球|9", "00")
			.put("第五球|大", "01").put("第五球|小", "01").put("第五球|单", "01").put("第五球|双", "01")

			.put("总和|大", "01").put("总和|小", "01").put("总和|单", "01").put("总和|双", "01").put("龙虎和|龙", "02")
			.put("龙虎和|虎", "02").put("龙虎和|和", "03").put("前三|豹子", "04").put("中三|豹子", "04").put("后三|豹子", "04")
			.put("前三|顺子", "05").put("中三|顺子", "05").put("后三|顺子", "05").put("前三|对子", "06").put("中三|对子", "06")
			.put("后三|对子", "06").put("前三|半顺", "07").put("中三|半顺", "07").put("后三|半顺", "07").put("前三|杂六", "08")
			.put("中三|杂六", "08").put("后三|杂六", "08").build();

	/**
	 * CQSSC投注限制
	 */
	Map<String, String> CQSSC_LIMIT_CODE = ImmutableMap.<String, String>builder().put("第一球|0", "00").put("第一球|1", "00")
			.put("第一球|2", "00").put("第一球|3", "00").put("第一球|4", "00").put("第一球|5", "00").put("第一球|6", "00")
			.put("第一球|7", "00").put("第一球|8", "00").put("第一球|9", "00").put("第一球|大", "01").put("第一球|小", "01")
			.put("第一球|单", "01").put("第一球|双", "01")

			.put("第二球|0", "00").put("第二球|1", "00").put("第二球|2", "00").put("第二球|3", "00").put("第二球|4", "00")
			.put("第二球|5", "00").put("第二球|6", "00").put("第二球|7", "00").put("第二球|8", "00").put("第二球|9", "00")
			.put("第二球|大", "01").put("第二球|小", "01").put("第二球|单", "01").put("第二球|双", "01")

			.put("第三球|0", "00").put("第三球|1", "00").put("第三球|2", "00").put("第三球|3", "00").put("第三球|4", "00")
			.put("第三球|5", "00").put("第三球|6", "00").put("第三球|7", "00").put("第三球|8", "00").put("第三球|9", "00")
			.put("第三球|大", "01").put("第三球|小", "01").put("第三球|单", "01").put("第三球|双", "01")

			.put("第四球|0", "00").put("第四球|1", "00").put("第四球|2", "00").put("第四球|3", "00").put("第四球|4", "00")
			.put("第四球|5", "00").put("第四球|6", "00").put("第四球|7", "00").put("第四球|8", "00").put("第四球|9", "00")
			.put("第四球|大", "01").put("第四球|小", "01").put("第四球|单", "01").put("第四球|双", "01")

			.put("第五球|0", "00").put("第五球|1", "00").put("第五球|2", "00").put("第五球|3", "00").put("第五球|4", "00")
			.put("第五球|5", "00").put("第五球|6", "00").put("第五球|7", "00").put("第五球|8", "00").put("第五球|9", "00")
			.put("第五球|大", "01").put("第五球|小", "01").put("第五球|单", "01").put("第五球|双", "01")

			.put("总和|大", "01").put("总和|小", "01").put("总和|单", "01").put("总和|双", "01").put("龙虎和|龙", "02")
			.put("龙虎和|虎", "02").put("龙虎和|和", "03").put("前三|豹子", "12").put("中三|豹子", "12").put("后三|豹子", "12")
			.put("前三|顺子", "13").put("中三|顺子", "13").put("后三|顺子", "13").put("前三|对子", "14").put("中三|对子", "14")
			.put("后三|对子", "14").put("前三|半顺", "15").put("中三|半顺", "15").put("后三|半顺", "15").put("前三|杂六", "16")
			.put("中三|杂六", "16").put("后三|杂六", "16").build();

	Map<String, String> BET_INFO_CODE = ImmutableMap.<String, String>builder().put("01100", "第一球|0")
			.put("01101", "第一球|1").put("01102", "第一球|2").put("01103", "第一球|3").put("01104", "第一球|4")
			.put("01105", "第一球|5").put("01106", "第一球|6").put("01107", "第一球|7").put("01108", "第一球|8")
			.put("01109", "第一球|9").put("01201", "第一球|大").put("01202", "第一球|小").put("01301", "第一球|单")
			.put("01302", "第一球|双")

			.put("02100", "第二球|0").put("02101", "第二球|1").put("02102", "第二球|2").put("02103", "第二球|3")
			.put("02104", "第二球|4").put("02105", "第二球|5").put("02106", "第二球|6").put("02107", "第二球|7")
			.put("02108", "第二球|8").put("02109", "第二球|9").put("02201", "第二球|大").put("02202", "第二球|小")
			.put("02301", "第二球|单").put("02302", "第二球|双")

			.put("03100", "第三球|0").put("03101", "第三球|1").put("03102", "第三球|2").put("03103", "第三球|3")
			.put("03104", "第三球|4").put("03105", "第三球|5").put("03106", "第三球|6").put("03107", "第三球|7")
			.put("03108", "第三球|8").put("03109", "第三球|9").put("03201", "第三球|大").put("03202", "第三球|小")
			.put("03301", "第三球|单").put("03302", "第三球|双")

			.put("04100", "第四球|0").put("04101", "第四球|1").put("04102", "第四球|2").put("04103", "第四球|3")
			.put("04104", "第四球|4").put("04105", "第四球|5").put("04106", "第四球|6").put("04107", "第四球|7")
			.put("04108", "第四球|8").put("04109", "第四球|9").put("04201", "第四球|大").put("04202", "第四球|小")
			.put("04301", "第四球|单").put("04302", "第四球|双")

			.put("05100", "第五球|0").put("05101", "第五球|1").put("05102", "第五球|2").put("05103", "第五球|3")
			.put("05104", "第五球|4").put("05105", "第五球|5").put("05106", "第五球|6").put("05107", "第五球|7")
			.put("05108", "第五球|8").put("05109", "第五球|9").put("05201", "第五球|大").put("05202", "第五球|小")
			.put("05301", "第五球|单").put("05302", "第五球|双")

			.put("00201", "总和|大").put("00202", "总和|小").put("00301", "总和|单").put("00302", "总和|双").put("01401", "龙虎和|龙")
			.put("01402", "龙虎和|虎").put("01403", "龙虎和|和").put("12501", "前三|豹子").put("13501", "中三|豹子")
			.put("14501", "后三|豹子").put("12502", "前三|顺子").put("13502", "中三|顺子").put("14502", "后三|顺子")
			.put("12503", "前三|对子").put("13503", "中三|对子").put("14503", "后三|对子").put("12504", "前三|半顺")
			.put("13504", "中三|半顺").put("14504", "后三|半顺").put("12505", "前三|杂六").put("13505", "中三|杂六")
			.put("14505", "后三|杂六").build();

	Map<String, String> BET_RESULT_CODE = ImmutableMap.<String, String>builder().put("第一球0", "第一球|0")
			.put("第一球1", "第一球|1").put("第一球2", "第一球|2").put("第一球3", "第一球|3").put("第一球4", "第一球|4").put("第一球5", "第一球|5")
			.put("第一球6", "第一球|6").put("第一球7", "第一球|7").put("第一球8", "第一球|8").put("第一球9", "第一球|9").put("第一球单", "第一球|单")
			.put("第一球双", "第一球|双").put("第一球大", "第一球|大").put("第一球小", "第一球|小")

			.put("第二球0", "第二球|0").put("第二球1", "第二球|1").put("第二球2", "第二球|2").put("第二球3", "第二球|3").put("第二球4", "第二球|4")
			.put("第二球5", "第二球|5").put("第二球6", "第二球|6").put("第二球7", "第二球|7").put("第二球8", "第二球|8").put("第二球9", "第二球|9")
			.put("第二球单", "第二球|单").put("第二球双", "第二球|双").put("第二球大", "第二球|大").put("第二球小", "第二球|小")

			.put("第三球0", "第三球|0").put("第三球1", "第三球|1").put("第三球2", "第三球|2").put("第三球3", "第三球|3").put("第三球4", "第三球|4")
			.put("第三球5", "第三球|5").put("第三球6", "第三球|6").put("第三球7", "第三球|7").put("第三球8", "第三球|8").put("第三球9", "第三球|9")
			.put("第三球单", "第三球|单").put("第三球双", "第三球|双").put("第三球大", "第三球|大").put("第三球小", "第三球|小")

			.put("第四球0", "第四球|0").put("第四球1", "第四球|1").put("第四球2", "第四球|2").put("第四球3", "第四球|3").put("第四球4", "第四球|4")
			.put("第四球5", "第四球|5").put("第四球6", "第四球|6").put("第四球7", "第四球|7").put("第四球8", "第四球|8").put("第四球9", "第四球|9")
			.put("第四球单", "第四球|单").put("第四球双", "第四球|双").put("第四球大", "第四球|大").put("第四球小", "第四球|小")

			.put("第五球0", "第五球|0").put("第五球1", "第五球|1").put("第五球2", "第五球|2").put("第五球3", "第五球|3").put("第五球4", "第五球|4")
			.put("第五球5", "第五球|5").put("第五球6", "第五球|6").put("第五球7", "第五球|7").put("第五球8", "第五球|8").put("第五球9", "第五球|9")
			.put("第五球单", "第五球|单").put("第五球双", "第五球|双").put("第五球大", "第五球|大").put("第五球小", "第五球|小")

			.put("总和大", "总和|大").put("总和小", "总和|小").put("总和单", "总和|单").put("总和双", "总和|双").put("第一球龙", "龙虎和|龙")
			.put("第一球虎", "龙虎和|虎").put("第一球和", "龙虎和|和").put("前三豹子", "前三|豹子").put("中三豹子", "中三|豹子").put("后三豹子", "后三|豹子")
			.put("前三顺子", "前三|顺子").put("中三顺子", "中三|顺子").put("后三顺子", "后三|顺子").put("前三对子", "前三|对子").put("中三对子", "中三|对子")
			.put("后三对子", "后三|对子").put("前三半顺", "前三|半顺").put("中三半顺", "中三|半顺").put("后三半顺", "后三|半顺").put("前三杂六", "前三|杂六")
			.put("中三杂六", "中三|杂六").put("后三杂六", "后三|杂六").build();
}
