package com.ibm.common.utils.handicap.config;

import com.google.common.collect.ImmutableMap;
import com.ibm.common.core.configs.Ncom1Config;

import java.util.Map;

/**
 * @Description: 新com1号码
 * @Author: null
 * @Date: 2019-12-26 17:17
 * @Version: v1.0
 */
public interface Ncom1NumberConfig extends Ncom1Config {



    /**
     * 所有球码code
     */
    Map<String, String> BALL_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "p-1_1")
            .put("第一名|2", "p-1_2").put("第一名|3", "p-1_3").put("第一名|4", "p-1_4").put("第一名|5", "p-1_5")
            .put("第一名|6", "p-1_6").put("第一名|7", "p-1_7").put("第一名|8", "p-1_8").put("第一名|9", "p-1_9")
            .put("第一名|10", "p-1_10").put("第一名|大", "lm-1_dxd").put("第一名|小", "lm-1_dxx").put("第一名|单", "lm-1_dsd")
            .put("第一名|双", "lm-1_dss").put("第一名|龙", "lh-1_l").put("第一名|虎", "lh-1_h")

            .put("第二名|1", "p-2_1").put("第二名|2", "p-2_2").put("第二名|3", "p-2_3").put("第二名|4", "p-2_4")
            .put("第二名|5", "p-2_5").put("第二名|6", "p-2_6").put("第二名|7", "p-2_7").put("第二名|8", "p-2_8")
            .put("第二名|9", "p-2_9").put("第二名|10", "p-2_10").put("第二名|大", "lm-1_dxd").put("第二名|小", "lm-1_dxx")
            .put("第二名|单", "lm-1_dsd").put("第二名|双", "lm-1_dss").put("第二名|龙", "lh-2_l").put("第二名|虎", "lh-2_h")

            .put("第三名|1", "p-3_1").put("第三名|2", "p-3_2").put("第三名|3", "p-3_3").put("第三名|4", "p-3_4")
            .put("第三名|5", "p-3_5").put("第三名|6", "p-3_6").put("第三名|7", "p-3_7").put("第三名|8", "p-3_8")
            .put("第三名|9", "p-3_9").put("第三名|10", "p-3_10").put("第三名|大", "lm-3_dxd").put("第三名|小", "lm-3_dxx")
            .put("第三名|单", "lm-3_dsd").put("第三名|双", "lm-3_dss").put("第三名|龙", "lh-3_l").put("第三名|虎", "lh-3_h")

            .put("第四名|1", "p-4_1").put("第四名|2", "p-4_2").put("第四名|3", "p-4_3").put("第四名|4", "p-4_4")
            .put("第四名|5", "p-4_5").put("第四名|6", "p-4_6").put("第四名|7", "p-4_7").put("第四名|8", "p-4_8")
            .put("第四名|9", "p-4_9").put("第四名|10", "p-4_10").put("第四名|大", "lm-4_dxd").put("第四名|小", "lm-4_dxx")
            .put("第四名|单", "lm-4_dsd").put("第四名|双", "lm-4_dss").put("第四名|龙", "lh-4_l").put("第四名|虎", "lh-4_h")

            .put("第五名|1", "p-5_1").put("第五名|2", "p-5_2").put("第五名|3", "p-5_3").put("第五名|4", "p-5_4")
            .put("第五名|5", "p-5_5").put("第五名|6", "p-5_6").put("第五名|7", "p-5_7").put("第五名|8", "p-5_8")
            .put("第五名|9", "p-5_9").put("第五名|10", "p-5_10").put("第五名|大", "lm-5_dxd").put("第五名|小", "lm-5_dxx")
            .put("第五名|单", "lm-5_dsd").put("第五名|双", "lm-5_dss").put("第五名|龙", "lh-5_l").put("第五名|虎", "lh-5_h")

            .put("第六名|1", "p-6_1").put("第六名|2", "p-6_2").put("第六名|3", "p-6_3").put("第六名|4", "p-6_4")
            .put("第六名|5", "p-6_5").put("第六名|6", "p-6_6").put("第六名|7", "p-6_7").put("第六名|8", "p-6_8")
            .put("第六名|9", "p-6_9").put("第六名|10", "p-6_10").put("第六名|大", "lm-6_dxd").put("第六名|小", "lm-6_dxx")
            .put("第六名|单", "lm-6_dsd").put("第六名|双", "lm-6_dss")

            .put("第七名|1", "p-7_1").put("第七名|2", "p-7_2").put("第七名|3", "p-7_3").put("第七名|4", "p-7_4")
            .put("第七名|5", "p-7_5").put("第七名|6", "p-7_6").put("第七名|7", "p-7_7").put("第七名|8", "p-7_8")
            .put("第七名|9", "p-7_9").put("第七名|10", "p-7_10").put("第七名|大", "lm-7_dxd").put("第七名|小", "lm-7_dxx")
            .put("第七名|单", "lm-7_dsd").put("第七名|双", "lm-7_dss")

            .put("第八名|1", "p-8_1").put("第八名|2", "p-8_2").put("第八名|3", "p-8_3").put("第八名|4", "p-8_4")
            .put("第八名|5", "p-8_5").put("第八名|6", "p-8_6").put("第八名|7", "p-8_7").put("第八名|8", "p-8_8")
            .put("第八名|9", "p-8_9").put("第八名|10", "p-8_10").put("第八名|大", "lm-8_dxd").put("第八名|小", "lm-8_dxx")
            .put("第八名|单", "lm-8_dsd").put("第八名|双", "lm-8_dss")

            .put("第九名|1", "p-9_1").put("第九名|2", "p-9_2").put("第九名|3", "p-9_3").put("第九名|4", "p-9_4")
            .put("第九名|5", "p-9_5").put("第九名|6", "p-9_6").put("第九名|7", "p-9_7").put("第九名|8", "p-9_8")
            .put("第九名|9", "p-9_9").put("第九名|10", "p-9_10").put("第九名|大", "lm-9_dxd").put("第九名|小", "lm-9_dxx")
            .put("第九名|单", "lm-9_dsd").put("第九名|双", "lm-9_dss")

            .put("第十名|1", "p-10_1").put("第十名|2", "p-10_2").put("第十名|3", "p-10_3").put("第十名|4", "p-10_4")
            .put("第十名|5", "p-10_5").put("第十名|6", "p-10_6").put("第十名|7", "p-10_7").put("第十名|8", "p-10_8")
            .put("第十名|9", "p-10_9").put("第十名|10", "p-10_10").put("第十名|大", "lm-10_dxd").put("第十名|小", "lm-10_dxx")
            .put("第十名|单", "lm-10_dsd").put("第十名|双", "lm-10_dss")

            .put("冠亚|3", "gy3-3").put("冠亚|4", "gy3-4").put("冠亚|5", "gy5-5").put("冠亚|6", "gy5-6")
            .put("冠亚|7", "gy7-7").put("冠亚|8", "gy7-8").put("冠亚|9", "gy9-9").put("冠亚|10", "gy9-10")
            .put("冠亚|11", "gy11-11").put("冠亚|12", "gy9-12").put("冠亚|13", "gy9-13").put("冠亚|14", "gy7-14")
            .put("冠亚|15", "gy7-15").put("冠亚|16", "gy5-16").put("冠亚|17", "gy5-17").put("冠亚|18", "gy3-18")
            .put("冠亚|19", "gy3-19").put("冠亚|大", "gydxd-gydxd").put("冠亚|小", "gydxx-gydxx").put("冠亚|单", "gydsd-gydsd")
            .put("冠亚|双", "gydss-gydss").build();


    Map<String, String> BET_INFO_CODE = ImmutableMap.<String, String>builder().put("冠军1", "第一名|1").put("冠军2", "第一名|2")
            .put("冠军3", "第一名|3").put("冠军4", "第一名|4").put("冠军5", "第一名|5").put("冠军6", "第一名|6").put("冠军7", "第一名|7")
            .put("冠军8", "第一名|8").put("冠军9", "第一名|9").put("冠军10", "第一名|10").put("冠军虎", "第一名|虎").put("冠军龙", "第一名|龙")
            .put("冠军单", "第一名|单").put("冠军双", "第一名|双").put("冠军大", "第一名|大").put("冠军小", "第一名|小")

            .put("亚军1", "第二名|1").put("亚军2", "第二名|2").put("亚军3", "第二名|3").put("亚军4", "第二名|4").put("亚军5", "第二名|5")
            .put("亚军6", "第二名|6").put("亚军7", "第二名|7").put("亚军8", "第二名|8").put("亚军9", "第二名|9").put("亚军10", "第二名|10")
            .put("亚军虎", "第二名|虎").put("亚军龙", "第二名|龙").put("亚军单", "第二名|单").put("亚军双", "第二名|双").put("亚军大", "第二名|大")
            .put("亚军小", "第二名|小")

            .put("第三名1", "第三名|1").put("第三名2", "第三名|2").put("第三名3", "第三名|3").put("第三名4", "第三名|4").put("第三名5", "第三名|5")
            .put("第三名6", "第三名|6").put("第三名7", "第三名|7").put("第三名8", "第三名|8").put("第三名9", "第三名|9").put("第三名10", "第三名|10")
            .put("第三名虎", "第三名|虎").put("第三名龙", "第三名|龙").put("第三名单", "第三名|单").put("第三名双", "第三名|双").put("第三名大", "第三名|大")
            .put("第三名小", "第三名|小")

            .put("第四名1", "第四名|1").put("第四名2", "第四名|2").put("第四名3", "第四名|3").put("第四名4", "第四名|4").put("第四名5", "第四名|5")
            .put("第四名6", "第四名|6").put("第四名7", "第四名|7").put("第四名8", "第四名|8").put("第四名9", "第四名|9").put("第四名10", "第四名|10")
            .put("第四名虎", "第四名|虎").put("第四名龙", "第四名|龙").put("第四名单", "第四名|单").put("第四名双", "第四名|双").put("第四名大", "第四名|大")
            .put("第四名小", "第四名|小")

            .put("第五名1", "第五名|1").put("第五名2", "第五名|2").put("第五名3", "第五名|3").put("第五名4", "第五名|4").put("第五名5", "第五名|5")
            .put("第五名6", "第五名|6").put("第五名7", "第五名|7").put("第五名8", "第五名|8").put("第五名9", "第五名|9").put("第五名10", "第五名|10")
            .put("第五名虎", "第五名|虎").put("第五名龙", "第五名|龙").put("第五名单", "第五名|单").put("第五名双", "第五名|双").put("第五名大", "第五名|大")
            .put("第五名小", "第五名|小")

            .put("第六名1", "第六名|1").put("第六名2", "第六名|2").put("第六名3", "第六名|3").put("第六名4", "第六名|4").put("第六名5", "第六名|5")
            .put("第六名6", "第六名|6").put("第六名7", "第六名|7").put("第六名8", "第六名|8").put("第六名9", "第六名|9").put("第六名10", "第六名|10")
            .put("第六名单", "第六名|单").put("第六名双", "第六名|双").put("第六名大", "第六名|大").put("第六名小", "第六名|小")

            .put("第七名1", "第七名|1").put("第七名2", "第七名|2").put("第七名3", "第七名|3").put("第七名4", "第七名|4").put("第七名5", "第七名|5")
            .put("第七名6", "第七名|6").put("第七名7", "第七名|7").put("第七名8", "第七名|8").put("第七名9", "第七名|9").put("第七名10", "第七名|10")
            .put("第七名单", "第七名|单").put("第七名双", "第七名|双").put("第七名大", "第七名|大").put("第七名小", "第七名|小")

            .put("第八名1", "第八名|1").put("第八名2", "第八名|2").put("第八名3", "第八名|3").put("第八名4", "第八名|4").put("第八名5", "第八名|5")
            .put("第八名6", "第八名|6").put("第八名7", "第八名|7").put("第八名8", "第八名|8").put("第八名9", "第八名|9").put("第八名10", "第八名|10")
            .put("第八名单", "第八名|单").put("第八名双", "第八名|双").put("第八名大", "第八名|大").put("第八名小", "第八名|小")

            .put("第九名1", "第九名|1").put("第九名2", "第九名|2").put("第九名3", "第九名|3").put("第九名4", "第九名|4").put("第九名5", "第九名|5")
            .put("第九名6", "第九名|6").put("第九名7", "第九名|7").put("第九名8", "第九名|8").put("第九名9", "第九名|9").put("第九名10", "第九名|10")
            .put("第九名单", "第九名|单").put("第九名双", "第九名|双").put("第九名大", "第九名|大").put("第九名小", "第九名|小")

            .put("第十名1", "第十名|1").put("第十名2", "第十名|2").put("第十名3", "第十名|3").put("第十名4", "第十名|4").put("第十名5", "第十名|5")
            .put("第十名6", "第十名|6").put("第十名7", "第十名|7").put("第十名8", "第十名|8").put("第十名9", "第十名|9").put("第十名10", "第十名|10")
            .put("第十名单", "第十名|单").put("第十名双", "第十名|双").put("第十名大", "第十名|大").put("第十名小", "第十名|小")

            .put("冠亚军和3", "冠亚|3").put("冠亚军和4", "冠亚|4").put("冠亚军和5", "冠亚|5").put("冠亚军和6", "冠亚|6").put("冠亚军和7", "冠亚|7")
            .put("冠亚军和8", "冠亚|8").put("冠亚军和9", "冠亚|9").put("冠亚军和10", "冠亚|10").put("冠亚军和11", "冠亚|11")
            .put("冠亚军和12", "冠亚|12").put("冠亚军和13", "冠亚|13").put("冠亚军和14", "冠亚|14").put("冠亚军和15", "冠亚|15")
            .put("冠亚军和16", "冠亚|16").put("冠亚军和17", "冠亚|17").put("冠亚军和18", "冠亚|18").put("冠亚军和19", "冠亚|19")
            .put("冠亚军和单", "冠亚|单").put("冠亚军和双", "冠亚|双").put("冠亚军和大", "冠亚|大").put("冠亚军和小", "冠亚|小").build();


    /**
     * 投注限制
     */
    Map<String, String> BET_LIMIT_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "00").put("第一名|2", "00")
            .put("第一名|3", "00").put("第一名|4", "00").put("第一名|5", "00").put("第一名|6", "00").put("第一名|7", "00")
            .put("第一名|8", "00").put("第一名|9", "00").put("第一名|10", "00").put("第一名|大", "01").put("第一名|小", "01")
            .put("第一名|单", "01").put("第一名|双", "01").put("第一名|龙", "02").put("第一名|虎", "02")

            .put("第二名|1", "00").put("第二名|2", "00").put("第二名|3", "00").put("第二名|4", "00").put("第二名|5", "00")
            .put("第二名|6", "00").put("第二名|7", "00").put("第二名|8", "00").put("第二名|9", "00").put("第二名|10", "00")
            .put("第二名|大", "01").put("第二名|小", "01").put("第二名|单", "01").put("第二名|双", "01").put("第二名|龙", "02")
            .put("第二名|虎", "02")

            .put("第三名|1", "00").put("第三名|2", "00").put("第三名|3", "00").put("第三名|4", "00").put("第三名|5", "00")
            .put("第三名|6", "00").put("第三名|7", "00").put("第三名|8", "00").put("第三名|9", "00").put("第三名|10", "00")
            .put("第三名|大", "01").put("第三名|小", "01").put("第三名|单", "01").put("第三名|双", "01").put("第三名|龙", "02")
            .put("第三名|虎", "02")

            .put("第四名|1", "00").put("第四名|2", "00").put("第四名|3", "00").put("第四名|4", "00").put("第四名|5", "00")
            .put("第四名|6", "00").put("第四名|7", "00").put("第四名|8", "00").put("第四名|9", "00").put("第四名|10", "00")
            .put("第四名|大", "01").put("第四名|小", "01").put("第四名|单", "01").put("第四名|双", "01").put("第四名|龙", "02")
            .put("第四名|虎", "02")

            .put("第五名|1", "00").put("第五名|2", "00").put("第五名|3", "00").put("第五名|4", "00").put("第五名|5", "00")
            .put("第五名|6", "00").put("第五名|7", "00").put("第五名|8", "00").put("第五名|9", "00").put("第五名|10", "00")
            .put("第五名|大", "01").put("第五名|小", "01").put("第五名|单", "01").put("第五名|双", "01").put("第五名|龙", "02")
            .put("第五名|虎", "02")

            .put("第六名|1", "00").put("第六名|2", "00").put("第六名|3", "00").put("第六名|4", "00").put("第六名|5", "00")
            .put("第六名|6", "00").put("第六名|7", "00").put("第六名|8", "00").put("第六名|9", "00").put("第六名|10", "00")
            .put("第六名|大", "01").put("第六名|小", "01").put("第六名|单", "01").put("第六名|双", "01")

            .put("第七名|1", "00").put("第七名|2", "00").put("第七名|3", "00").put("第七名|4", "00").put("第七名|5", "00")
            .put("第七名|6", "00").put("第七名|7", "00").put("第七名|8", "00").put("第七名|9", "00").put("第七名|10", "00")
            .put("第七名|大", "01").put("第七名|小", "01").put("第七名|单", "01").put("第七名|双", "01")

            .put("第八名|1", "00").put("第八名|2", "00").put("第八名|3", "00").put("第八名|4", "00").put("第八名|5", "00")
            .put("第八名|6", "00").put("第八名|7", "00").put("第八名|8", "00").put("第八名|9", "00").put("第八名|10", "00")
            .put("第八名|大", "01").put("第八名|小", "01").put("第八名|单", "01").put("第八名|双", "01")

            .put("第九名|1", "00").put("第九名|2", "00").put("第九名|3", "00").put("第九名|4", "00").put("第九名|5", "00")
            .put("第九名|6", "00").put("第九名|7", "00").put("第九名|8", "00").put("第九名|9", "00").put("第九名|10", "00")
            .put("第九名|大", "01").put("第九名|小", "01").put("第九名|单", "01").put("第九名|双", "01")

            .put("第十名|1", "00").put("第十名|2", "00").put("第十名|3", "00").put("第十名|4", "00").put("第十名|5", "00")
            .put("第十名|6", "00").put("第十名|7", "00").put("第十名|8", "00").put("第十名|9", "00").put("第十名|10", "00")
            .put("第十名|大", "01").put("第十名|小", "01").put("第十名|单", "01").put("第十名|双", "01")

            .put("冠亚|3", "07").put("冠亚|4", "07").put("冠亚|5", "08").put("冠亚|6", "08").put("冠亚|7", "09").put("冠亚|8", "09")
            .put("冠亚|9", "10").put("冠亚|10", "10").put("冠亚|11", "11").put("冠亚|12", "10").put("冠亚|13", "10")
            .put("冠亚|14", "09").put("冠亚|15", "09").put("冠亚|16", "08").put("冠亚|17", "08").put("冠亚|18", "07")
            .put("冠亚|19", "07").put("冠亚|大", "03").put("冠亚|小", "04").put("冠亚|单", "05").put("冠亚|双", "06").build();

}
