package com.ibm.common.utils.handicap.config;

import com.google.common.collect.ImmutableMap;
import com.ibm.common.utils.game.GameUtil;

import java.util.Map;

/**
 * @Description:
 * @Author: wwj
 * @Date: 2019/12/27 16:08
 * @Email: 97085010@qq.com
 * @Version: v1.0
 */
public interface NewCcNumberConfig {

    /**
     * 所有球码code
     */
    Map<String, String> BALL_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "00")
            .put("第一名|2", "01").put("第一名|3", "02").put("第一名|4", "03").put("第一名|5", "04")
            .put("第一名|6", "05").put("第一名|7", "06").put("第一名|8", "07").put("第一名|9", "08")
            .put("第一名|10", "09").put("第一名|大", "10").put("第一名|小", "11").put("第一名|单", "12")
            .put("第一名|双", "13").put("第一名|龙", "14").put("第一名|虎", "15")

            .put("第二名|1", "16").put("第二名|2", "17").put("第二名|3", "18").put("第二名|4", "19")
            .put("第二名|5", "20").put("第二名|6", "21").put("第二名|7", "22").put("第二名|8", "23")
            .put("第二名|9", "24").put("第二名|10", "25").put("第二名|大", "26").put("第二名|小", "27")
            .put("第二名|单", "28").put("第二名|双", "29").put("第二名|龙", "30").put("第二名|虎", "31")

            .put("第三名|1", "32").put("第三名|2", "33").put("第三名|3", "34").put("第三名|4", "35")
            .put("第三名|5", "36").put("第三名|6", "37").put("第三名|7", "38").put("第三名|8", "39")
            .put("第三名|9", "40").put("第三名|10", "41").put("第三名|大", "42").put("第三名|小", "43")
            .put("第三名|单", "44").put("第三名|双", "45").put("第三名|龙", "46").put("第三名|虎", "47")

            .put("第四名|1", "48").put("第四名|2", "49").put("第四名|3", "50").put("第四名|4", "51")
            .put("第四名|5", "52").put("第四名|6", "53").put("第四名|7", "54").put("第四名|8", "55")
            .put("第四名|9", "56").put("第四名|10", "57").put("第四名|大", "58").put("第四名|小", "59")
            .put("第四名|单", "60").put("第四名|双", "61").put("第四名|龙", "62").put("第四名|虎", "63")

            .put("第五名|1", "64").put("第五名|2", "65").put("第五名|3", "66").put("第五名|4", "67")
            .put("第五名|5", "68").put("第五名|6", "69").put("第五名|7", "70").put("第五名|8", "71")
            .put("第五名|9", "72").put("第五名|10", "73").put("第五名|大", "74").put("第五名|小", "75")
            .put("第五名|单", "76").put("第五名|双", "77").put("第五名|龙", "78").put("第五名|虎", "79")

            .put("第六名|1", "80").put("第六名|2", "81").put("第六名|3", "82").put("第六名|4", "83")
            .put("第六名|5", "84").put("第六名|6", "85").put("第六名|7", "86").put("第六名|8", "87")
            .put("第六名|9", "88").put("第六名|10", "89").put("第六名|大", "90").put("第六名|小", "91")
            .put("第六名|单", "92").put("第六名|双", "93")

            .put("第七名|1", "94").put("第七名|2", "95").put("第七名|3", "96").put("第七名|4", "97")
            .put("第七名|5", "98").put("第七名|6", "99").put("第七名|7", "100").put("第七名|8", "101")
            .put("第七名|9", "102").put("第七名|10", "103").put("第七名|大", "104").put("第七名|小", "105")
            .put("第七名|单", "106").put("第七名|双", "107")

            .put("第八名|1", "108").put("第八名|2", "109").put("第八名|3", "110").put("第八名|4", "111")
            .put("第八名|5", "112").put("第八名|6", "113").put("第八名|7", "114").put("第八名|8", "115")
            .put("第八名|9", "116").put("第八名|10", "117").put("第八名|大", "118").put("第八名|小", "119")
            .put("第八名|单", "120").put("第八名|双", "121")

            .put("第九名|1", "122").put("第九名|2", "123").put("第九名|3", "124").put("第九名|4", "125")
            .put("第九名|5", "126").put("第九名|6", "127").put("第九名|7", "128").put("第九名|8", "129")
            .put("第九名|9", "130").put("第九名|10", "131").put("第九名|大", "132").put("第九名|小", "133")
            .put("第九名|单", "134").put("第九名|双", "135")

            .put("第十名|1", "136").put("第十名|2", "137").put("第十名|3", "138").put("第十名|4", "139")
            .put("第十名|5", "1").put("第十名|6", "141").put("第十名|7", "142").put("第十名|8", "143")
            .put("第十名|9", "144").put("第十名|10", "145").put("第十名|大", "146").put("第十名|小", "147")
            .put("第十名|单", "148").put("第十名|双", "149")

            .put("冠亚|3", "150").put("冠亚|4", "151").put("冠亚|5", "152").put("冠亚|6", "153").put("冠亚|7", "154")
            .put("冠亚|8", "155").put("冠亚|9", "156").put("冠亚|10", "157").put("冠亚|11", "158").put("冠亚|12", "159")
            .put("冠亚|13", "160").put("冠亚|14", "161").put("冠亚|15", "162").put("冠亚|16", "163")
            .put("冠亚|17", "164").put("冠亚|18", "165").put("冠亚|19", "166").put("冠亚|大", "167").put("冠亚|小", "168")
            .put("冠亚|单", "169").put("冠亚|双", "170").build();

    /**
     * 投注信息
     */
    Map<String, String> BET_INFO_CODE = ImmutableMap.<String, String>builder().put("冠军-1", "第一名|1").put("冠军-2", "第一名|2")
            .put("冠军-3", "第一名|3").put("冠军-4", "第一名|4").put("冠军-5", "第一名|5").put("冠军-6", "第一名|6").put("冠军-7", "第一名|7")
            .put("冠军-8", "第一名|8").put("冠军-9", "第一名|9").put("冠军-10", "第一名|10").put("冠军-虎", "第一名|虎").put("冠军-龙", "第一名|龙")
            .put("冠军-单", "第一名|单").put("冠军-双", "第一名|双").put("冠军-大", "第一名|大").put("冠军-小", "第一名|小")

            .put("亚军-1", "第二名|1").put("亚军-2", "第二名|2").put("亚军-3", "第二名|3").put("亚军-4", "第二名|4").put("亚军-5", "第二名|5")
            .put("亚军-6", "第二名|6").put("亚军-7", "第二名|7").put("亚军-8", "第二名|8").put("亚军-9", "第二名|9").put("亚军-10", "第二名|10")
            .put("亚军-虎", "第二名|虎").put("亚军-龙", "第二名|龙").put("亚军-单", "第二名|单").put("亚军-双", "第二名|双").put("亚军-大", "第二名|大")
            .put("亚军-小", "第二名|小")

            .put("第三名-1", "第三名|1").put("第三名-2", "第三名|2").put("第三名-3", "第三名|3").put("第三名-4", "第三名|4").put("第三名-5", "第三名|5")
            .put("第三名-6", "第三名|6").put("第三名-7", "第三名|7").put("第三名-8", "第三名|8").put("第三名-9", "第三名|9").put("第三名-10", "第三名|10")
            .put("第三名-虎", "第三名|虎").put("第三名-龙", "第三名|龙").put("第三名-单", "第三名|单").put("第三名-双", "第三名|双").put("第三名-大", "第三名|大")
            .put("第三名-小", "第三名|小")

            .put("第四名-1", "第四名|1").put("第四名-2", "第四名|2").put("第四名-3", "第四名|3").put("第四名-4", "第四名|4").put("第四名-5", "第四名|5")
            .put("第四名-6", "第四名|6").put("第四名-7", "第四名|7").put("第四名-8", "第四名|8").put("第四名-9", "第四名|9").put("第四名-10", "第四名|10")
            .put("第四名-虎", "第四名|虎").put("第四名-龙", "第四名|龙").put("第四名-单", "第四名|单").put("第四名-双", "第四名|双").put("第四名-大", "第四名|大")
            .put("第四名-小", "第四名|小")

            .put("第五名-1", "第五名|1").put("第五名-2", "第五名|2").put("第五名-3", "第五名|3").put("第五名-4", "第五名|4").put("第五名-5", "第五名|5")
            .put("第五名-6", "第五名|6").put("第五名-7", "第五名|7").put("第五名-8", "第五名|8").put("第五名-9", "第五名|9").put("第五名-10", "第五名|10")
            .put("第五名-虎", "第五名|虎").put("第五名-龙", "第五名|龙").put("第五名-单", "第五名|单").put("第五名-双", "第五名|双").put("第五名-大", "第五名|大")
            .put("第五名-小", "第五名|小")

            .put("第六名-1", "第六名|1").put("第六名-2", "第六名|2").put("第六名-3", "第六名|3").put("第六名-4", "第六名|4").put("第六名-5", "第六名|5")
            .put("第六名-6", "第六名|6").put("第六名-7", "第六名|7").put("第六名-8", "第六名|8").put("第六名-9", "第六名|9").put("第六名-10", "第六名|10")
            .put("第六名-单", "第六名|单").put("第六名-双", "第六名|双").put("第六名-大", "第六名|大").put("第六名-小", "第六名|小")

            .put("第七名-1", "第七名|1").put("第七名-2", "第七名|2").put("第七名-3", "第七名|3").put("第七名-4", "第七名|4").put("第七名-5", "第七名|5")
            .put("第七名-6", "第七名|6").put("第七名-7", "第七名|7").put("第七名-8", "第七名|8").put("第七名-9", "第七名|9").put("第七名-10", "第七名|10")
            .put("第七名-单", "第七名|单").put("第七名-双", "第七名|双").put("第七名-大", "第七名|大").put("第七名-小", "第七名|小")

            .put("第八名-1", "第八名|1").put("第八名-2", "第八名|2").put("第八名-3", "第八名|3").put("第八名-4", "第八名|4").put("第八名-5", "第八名|5")
            .put("第八名-6", "第八名|6").put("第八名-7", "第八名|7").put("第八名-8", "第八名|8").put("第八名-9", "第八名|9").put("第八名-10", "第八名|10")
            .put("第八名-单", "第八名|单").put("第八名-双", "第八名|双").put("第八名-大", "第八名|大").put("第八名-小", "第八名|小")

            .put("第九名-1", "第九名|1").put("第九名-2", "第九名|2").put("第九名-3", "第九名|3").put("第九名-4", "第九名|4").put("第九名-5", "第九名|5")
            .put("第九名-6", "第九名|6").put("第九名-7", "第九名|7").put("第九名-8", "第九名|8").put("第九名-9", "第九名|9").put("第九名-10", "第九名|10")
            .put("第九名-单", "第九名|单").put("第九名-双", "第九名|双").put("第九名-大", "第九名|大").put("第九名-小", "第九名|小")

            .put("第十名-1", "第十名|1").put("第十名-2", "第十名|2").put("第十名-3", "第十名|3").put("第十名-4", "第十名|4").put("第十名-5", "第十名|5")
            .put("第十名-6", "第十名|6").put("第十名-7", "第十名|7").put("第十名-8", "第十名|8").put("第十名-9", "第十名|9").put("第十名-10", "第十名|10")
            .put("第十名-单", "第十名|单").put("第十名-双", "第十名|双").put("第十名-大", "第十名|大").put("第十名-小", "第十名|小")

            .put("冠亚和-3", "冠亚|3").put("冠亚和-4", "冠亚|4").put("冠亚和-5", "冠亚|5").put("冠亚和-6", "冠亚|6").put("冠亚和-7", "冠亚|7")
            .put("冠亚和-8", "冠亚|8").put("冠亚和-9", "冠亚|9").put("冠亚和-10", "冠亚|10").put("冠亚和-11", "冠亚|11")
            .put("冠亚和-12", "冠亚|12").put("冠亚和-13", "冠亚|13").put("冠亚和-14", "冠亚|14").put("冠亚和-15", "冠亚|15")
            .put("冠亚和-16", "冠亚|16").put("冠亚和-17", "冠亚|17").put("冠亚和-18", "冠亚|18").put("冠亚和-19", "冠亚|19")
            .put("冠亚单", "冠亚|单").put("冠亚双", "冠亚|双").put("冠亚大", "冠亚|大").put("冠亚小", "冠亚|小").build();



    /**
     * 投注限制
     */
    Map<String, String> BET_LIMIT_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "00").put("第一名|2", "00")
            .put("第一名|3", "00").put("第一名|4", "00").put("第一名|5", "00").put("第一名|6", "00").put("第一名|7", "00")
            .put("第一名|8", "00").put("第一名|9", "00").put("第一名|10", "00").put("第一名|大", "01").put("第一名|小", "01")
            .put("第一名|单", "01").put("第一名|双", "01").put("第一名|龙", "01").put("第一名|虎", "01")

            .put("第二名|1", "00").put("第二名|2", "00").put("第二名|3", "00").put("第二名|4", "00").put("第二名|5", "00")
            .put("第二名|6", "00").put("第二名|7", "00").put("第二名|8", "00").put("第二名|9", "00").put("第二名|10", "00")
            .put("第二名|大", "01").put("第二名|小", "01").put("第二名|单", "01").put("第二名|双", "01").put("第二名|龙", "01")
            .put("第二名|虎", "01")

            .put("第三名|1", "00").put("第三名|2", "00").put("第三名|3", "00").put("第三名|4", "00").put("第三名|5", "00")
            .put("第三名|6", "00").put("第三名|7", "00").put("第三名|8", "00").put("第三名|9", "00").put("第三名|10", "00")
            .put("第三名|大", "01").put("第三名|小", "01").put("第三名|单", "01").put("第三名|双", "01").put("第三名|龙", "01")
            .put("第三名|虎", "01")

            .put("第四名|1", "00").put("第四名|2", "00").put("第四名|3", "00").put("第四名|4", "00").put("第四名|5", "00")
            .put("第四名|6", "00").put("第四名|7", "00").put("第四名|8", "00").put("第四名|9", "00").put("第四名|10", "00")
            .put("第四名|大", "01").put("第四名|小", "01").put("第四名|单", "01").put("第四名|双", "01").put("第四名|龙", "01")
            .put("第四名|虎", "01")

            .put("第五名|1", "00").put("第五名|2", "00").put("第五名|3", "00").put("第五名|4", "00").put("第五名|5", "00")
            .put("第五名|6", "00").put("第五名|7", "00").put("第五名|8", "00").put("第五名|9", "00").put("第五名|10", "00")
            .put("第五名|大", "01").put("第五名|小", "01").put("第五名|单", "01").put("第五名|双", "01").put("第五名|龙", "01")
            .put("第五名|虎", "01")

            .put("第六名|1", "00").put("第六名|2", "00").put("第六名|3", "00").put("第六名|4", "00").put("第六名|5", "00")
            .put("第六名|6", "00").put("第六名|7", "00").put("第六名|8", "00").put("第六名|9", "00").put("第六名|10", "00")
            .put("第六名|大", "01").put("第六名|小", "01").put("第六名|单", "01").put("第六名|双", "01")

            .put("第七名|1", "00").put("第七名|2", "00").put("第七名|3", "00").put("第七名|4", "00").put("第七名|5", "00")
            .put("第七名|6", "00").put("第七名|7", "00").put("第七名|8", "00").put("第七名|9", "00").put("第七名|10", "00")
            .put("第七名|大", "01").put("第七名|小", "01").put("第七名|单", "01").put("第七名|双", "01")

            .put("第八名|1", "00").put("第八名|2", "00").put("第八名|3", "00").put("第八名|4", "00").put("第八名|5", "00")
            .put("第八名|6", "00").put("第八名|7", "00").put("第八名|8", "00").put("第八名|9", "00").put("第八名|10", "00")
            .put("第八名|大", "01").put("第八名|小", "01").put("第八名|单", "01").put("第八名|双", "01")

            .put("第九名|1", "00").put("第九名|2", "00").put("第九名|3", "00").put("第九名|4", "00").put("第九名|5", "00")
            .put("第九名|6", "00").put("第九名|7", "00").put("第九名|8", "00").put("第九名|9", "00").put("第九名|10", "00")
            .put("第九名|大", "01").put("第九名|小", "01").put("第九名|单", "01").put("第九名|双", "01")

            .put("第十名|1", "00").put("第十名|2", "00").put("第十名|3", "00").put("第十名|4", "00").put("第十名|5", "00")
            .put("第十名|6", "00").put("第十名|7", "00").put("第十名|8", "00").put("第十名|9", "00").put("第十名|10", "00")
            .put("第十名|大", "01").put("第十名|小", "01").put("第十名|单", "01").put("第十名|双", "01")

            .put("冠亚|3", "04").put("冠亚|4", "04").put("冠亚|5", "04").put("冠亚|6", "04").put("冠亚|7", "04").put("冠亚|8", "04")
            .put("冠亚|9", "04").put("冠亚|10", "04").put("冠亚|11", "04").put("冠亚|12", "04").put("冠亚|13", "04")
            .put("冠亚|14", "04").put("冠亚|15", "04").put("冠亚|16", "04").put("冠亚|17", "04").put("冠亚|18", "04")
            .put("冠亚|19", "04").put("冠亚|大", "03").put("冠亚|小", "03").put("冠亚|单", "02").put("冠亚|双", "02").build();

}
