package com.ibm.common.utils.handicap.config;

import com.google.common.collect.ImmutableMap;
import com.ibm.common.core.configs.ComConfig;

import java.util.Map;

/**
 * @Description:
 * @Author: zjj
 * @Date: 2020-05-07 14:45
 * @Email: 543974681@qq.com
 * @Version: v1.0
 */
public interface NewCcHappyConfig {

	/**
	 * 所有球码code
	 */
	Map<String, String> BALL_CODE = ImmutableMap.<String, String>builder().put("第一球|1", "00").put("第一球|2", "01")
			.put("第一球|3", "02").put("第一球|4", "03").put("第一球|5", "04").put("第一球|6", "05")
			.put("第一球|7", "06").put("第一球|8", "07").put("第一球|9", "08").put("第一球|10", "09")
			.put("第一球|11", "10").put("第一球|12", "11").put("第一球|13", "12").put("第一球|14", "14")
			.put("第一球|15", "14").put("第一球|16", "15").put("第一球|17", "16").put("第一球|18", "17")
			.put("第一球|19", "18").put("第一球|20", "19")

			.put("第一球|大", "20").put("第一球|小", "21").put("第一球|单", "22").put("第一球|双", "23")
			.put("第一球|尾大", "24").put("第一球|尾小", "25").put("第一球|合单", "26").put("第一球|合双", "27")
			.put("第一球|中", "28").put("第一球|发", "29").put("第一球|白", "30")
			.put("第一球|东", "31").put("第一球|南", "32").put("第一球|西", "33").put("第一球|北", "34")


			.put("第二球|1", "35").put("第二球|2", "36").put("第二球|3", "37").put("第二球|4", "38")
			.put("第二球|5", "39").put("第二球|6", "40").put("第二球|7", "41").put("第二球|8", "42")
			.put("第二球|9", "43").put("第二球|10", "44").put("第二球|11", "45").put("第二球|12", "46")
			.put("第二球|13", "47").put("第二球|14", "48").put("第二球|15", "49").put("第二球|16", "50")
			.put("第二球|17", "51").put("第二球|18", "52").put("第二球|19", "53").put("第二球|20", "54")

			.put("第二球|大", "55").put("第二球|小", "56").put("第二球|单", "57").put("第二球|双", "58")
			.put("第二球|尾大", "59").put("第二球|尾小", "60").put("第二球|合单", "61").put("第二球|合双", "62")
			.put("第二球|中", "63").put("第二球|发", "64").put("第二球|白", "65")
			.put("第二球|东", "66").put("第二球|南", "67").put("第二球|西", "68").put("第二球|北", "69")


			.put("第三球|1", "70").put("第三球|2", "71").put("第三球|3", "72").put("第三球|4", "73")
			.put("第三球|5", "74").put("第三球|6", "75").put("第三球|7", "76").put("第三球|8", "77")
			.put("第三球|9", "78").put("第三球|10", "79").put("第三球|11", "80").put("第三球|12", "81")
			.put("第三球|13", "82").put("第三球|14", "83").put("第三球|15", "84").put("第三球|16", "85")
			.put("第三球|17", "86").put("第三球|18", "87").put("第三球|19", "88").put("第三球|20", "89")

			.put("第三球|大", "90").put("第三球|小", "91").put("第三球|单", "92").put("第三球|双", "93")
			.put("第三球|尾大", "94").put("第三球|尾小", "95").put("第三球|合单", "96").put("第三球|合双", "97")
			.put("第三球|中", "98").put("第三球|发", "99").put("第三球|白", "100")
			.put("第三球|东", "101").put("第三球|南", "102").put("第三球|西", "103").put("第三球|北", "104")


			.put("第四球|1", "105").put("第四球|2", "106").put("第四球|3", "107").put("第四球|4", "108")
			.put("第四球|5", "109").put("第四球|6", "110").put("第四球|7", "111").put("第四球|8", "112")
			.put("第四球|9", "113").put("第四球|10", "114").put("第四球|11", "115").put("第四球|12", "116")
			.put("第四球|13", "117").put("第四球|14", "118").put("第四球|15", "119").put("第四球|16", "120")
			.put("第四球|17", "121").put("第四球|18", "122").put("第四球|19", "123").put("第四球|20", "124")

			.put("第四球|大", "125").put("第四球|小", "126").put("第四球|单", "127").put("第四球|双", "128")
			.put("第四球|尾大", "129").put("第四球|尾小", "130").put("第四球|合单", "131").put("第四球|合双", "132")
			.put("第四球|中", "133").put("第四球|发", "134").put("第四球|白", "135")
			.put("第四球|东", "136").put("第四球|南", "137").put("第四球|西", "138").put("第四球|北", "139")


			.put("第五球|1", "140").put("第五球|2", "141").put("第五球|3", "142").put("第五球|4", "143")
			.put("第五球|5", "144").put("第五球|6", "145").put("第五球|7", "146").put("第五球|8", "147")
			.put("第五球|9", "148").put("第五球|10", "149").put("第五球|11", "150").put("第五球|12", "151")
			.put("第五球|13", "152").put("第五球|14", "153").put("第五球|15", "154").put("第五球|16", "155")
			.put("第五球|17", "156").put("第五球|18", "157").put("第五球|19", "158").put("第五球|20", "159")

			.put("第五球|大", "160").put("第五球|小", "161").put("第五球|单", "162").put("第五球|双", "163")
			.put("第五球|尾大", "164").put("第五球|尾小", "165").put("第五球|合单", "166").put("第五球|合双", "167")
			.put("第五球|中", "168").put("第五球|发", "169").put("第五球|白", "170")
			.put("第五球|东", "171").put("第五球|南", "172").put("第五球|西", "173").put("第五球|北", "174")


			.put("第六球|1", "175").put("第六球|2", "176").put("第六球|3", "177").put("第六球|4", "178")
			.put("第六球|5", "179").put("第六球|6", "180").put("第六球|7", "181").put("第六球|8", "182")
			.put("第六球|9", "183").put("第六球|10", "184").put("第六球|11", "185").put("第六球|12", "186")
			.put("第六球|13", "187").put("第六球|14", "188").put("第六球|15", "189").put("第六球|16", "190")
			.put("第六球|17", "191").put("第六球|18", "192").put("第六球|19", "193").put("第六球|20", "194")

			.put("第六球|大", "195").put("第六球|小", "196").put("第六球|单", "197").put("第六球|双", "198")
			.put("第六球|尾大", "199").put("第六球|尾小", "200").put("第六球|合单", "201").put("第六球|合双", "202")
			.put("第六球|中", "203").put("第六球|发", "204").put("第六球|白", "205")
			.put("第六球|东", "206").put("第六球|南", "207").put("第六球|西", "208").put("第六球|北", "209")


			.put("第七球|1", "210").put("第七球|2", "211").put("第七球|3", "212").put("第七球|4", "213")
			.put("第七球|5", "214").put("第七球|6", "215").put("第七球|7", "216").put("第七球|8", "217")
			.put("第七球|9", "218").put("第七球|10", "219").put("第七球|11", "220").put("第七球|12", "221")
			.put("第七球|13", "222").put("第七球|14", "223").put("第七球|15", "224").put("第七球|16", "225")
			.put("第七球|17", "226").put("第七球|18", "227").put("第七球|19", "228").put("第七球|20", "229")

			.put("第七球|大", "230").put("第七球|小", "231").put("第七球|单", "232").put("第七球|双", "233")
			.put("第七球|尾大", "234").put("第七球|尾小", "235").put("第七球|合单", "236").put("第七球|合双", "237")
			.put("第七球|中", "238").put("第七球|发", "239").put("第七球|白", "240")
			.put("第七球|东", "241").put("第七球|南", "242").put("第七球|西", "243").put("第七球|北", "244")


			.put("第八球|1", "245").put("第八球|2", "246").put("第八球|3", "247").put("第八球|4", "248")
			.put("第八球|5", "249").put("第八球|6", "250").put("第八球|7", "251").put("第八球|8", "252")
			.put("第八球|9", "253").put("第八球|10", "254").put("第八球|11", "255").put("第八球|12", "256")
			.put("第八球|13", "257").put("第八球|14", "258").put("第八球|15", "259").put("第八球|16", "260")
			.put("第八球|17", "261").put("第八球|18", "262").put("第八球|19", "263").put("第八球|20", "264")

			.put("第八球|大", "265").put("第八球|小", "266").put("第八球|单", "267").put("第八球|双", "268")
			.put("第八球|尾大", "269").put("第八球|尾小", "270").put("第八球|合单", "271").put("第八球|合双", "272")
			.put("第八球|中", "273").put("第八球|发", "274").put("第八球|白", "275")
			.put("第八球|东", "276").put("第八球|南", "277").put("第八球|西", "278").put("第八球|北", "279")


			.put("总和|大", "280").put("总和|小", "281").put("总和|单", "282").put("总和|双", "283")
			.put("总和|尾大", "284").put("总和|尾小", "285").put("总和|龙", "286").put("总和|虎", "287")
			.build();

	/**
	 * 投注信息
	 */
	Map<String, String> BET_INFO_CODE = ImmutableMap.<String, String>builder().put("第一球-1", "第一球|1")
			.put("第一球-2", "第一球|2").put("第一球-3", "第一球|3").put("第一球-4", "第一球|4").put("第一球-5", "第一球|5")
			.put("第一球-6", "第一球|6").put("第一球-7", "第一球|7").put("第一球-8", "第一球|8").put("第一球-9", "第一球|9")
			.put("第一球-10", "第一球|10").put("第一球-11", "第一球|11").put("第一球-12", "第一球|12").put("第一球-13", "第一球|13")
			.put("第一球-14", "第一球|14").put("第一球-15", "第一球|15").put("第一球-16", "第一球|16").put("第一球-17", "第一球|17")
			.put("第一球-18", "第一球|18").put("第一球-19", "第一球|19").put("第一球-20", "第一球|20")

			.put("第一球-单", "第一球|单").put("第一球-双", "第一球|双").put("第一球-大", "第一球|大").put("第一球-小", "第一球|小")
			.put("第一球-合单", "第一球|合单").put("第一球-合双", "第一球|合双").put("第一球-尾大", "第一球|尾大").put("第一球-尾小", "第一球|尾小")
			.put("第一球-东", "第一球|东").put("第一球-南", "第一球|南").put("第一球-西", "第一球|西").put("第一球-北", "第一球|北")
			.put("第一球中-中", "第一球|中").put("第一球-发", "第一球|发").put("第一球-白", "第一球|白")

			.put("第二球-1", "第二球|1").put("第二球-2", "第二球|2").put("第二球-3", "第二球|3").put("第二球-4", "第二球|4")
			.put("第二球-5", "第二球|5").put("第二球-6", "第二球|6").put("第二球-7", "第二球|7").put("第二球-8", "第二球|8")
			.put("第二球-9", "第二球|9").put("第二球-10", "第二球|10").put("第二球-11", "第二球|11").put("第二球-12", "第二球|12")
			.put("第二球-13", "第二球|13").put("第二球-14", "第二球|14").put("第二球-15", "第二球|15").put("第二球-16", "第二球|16")
			.put("第二球-17", "第二球|17").put("第二球-18", "第二球|18").put("第二球-19", "第二球|19").put("第二球-20", "第二球|20")

			.put("第二球-单", "第二球|单").put("第二球双", "第二球|双").put("第二球大", "第二球|大").put("第二球小", "第二球|小")
			.put("第二球-合单", "第二球|合单").put("第二球-合双", "第二球|合双").put("第二球-尾大", "第二球|尾大").put("第二球-尾小", "第二球|尾小")
			.put("第二球-东", "第二球|东").put("第二球-南", "第二球|南").put("第二球-西", "第二球|西").put("第二球-北", "第二球|北")
			.put("第二球-中", "第二球|中").put("第二球-发", "第二球|发").put("第二球-白", "第二球|白")

			.put("第三球-1", "第三球|1").put("第三球-2", "第三球|2").put("第三球-3", "第三球|3").put("第三球-4", "第三球|4")
			.put("第三球-5", "第三球|5").put("第三球-6", "第三球|6").put("第三球-7", "第三球|7").put("第三球-8", "第三球|8")
			.put("第三球-9", "第三球|9").put("第三球-10", "第三球|10").put("第三球-11", "第三球|11").put("第三球-12", "第三球|12")
			.put("第三球-13", "第三球|13").put("第三球-14", "第三球|14").put("第三球-15", "第三球|15").put("第三球-16", "第三球|16")
			.put("第三球-17", "第三球|17").put("第三球-18", "第三球|18").put("第三球-19", "第三球|19").put("第三球-20", "第三球|20")

			.put("第三球-单", "第三球|单").put("第三球-双", "第三球|双").put("第三球-大", "第三球|大").put("第三球-小", "第三球|小")
			.put("第三球-合单", "第三球|合单").put("第三球-合双", "第三球|合双").put("第三球-尾大", "第三球|尾大").put("第三球-尾小", "第三球|尾小")
			.put("第三球-东", "第三球|东").put("第三球-南", "第三球|南").put("第三球-西", "第三球|西").put("第三球-北", "第三球|北")
			.put("第三球-中", "第三球|中").put("第三球中-发", "第三球|发").put("第三球-白", "第三球|白")

			.put("第四球-1", "第四球|1").put("第四球-2", "第四球|2").put("第四球-3", "第四球|3").put("第四球-4", "第四球|4")
			.put("第四球-5", "第四球|5").put("第四球-6", "第四球|6").put("第四球-7", "第四球|7").put("第四球-8", "第四球|8")
			.put("第四球-9", "第四球|9").put("第四球-10", "第四球|10").put("第四球-11", "第四球|11").put("第四球-12", "第四球|12")
			.put("第四球-13", "第四球|13").put("第四球-14", "第四球|14").put("第四球-15", "第四球|15").put("第四球-16", "第四球|16")
			.put("第四球-17", "第四球|17").put("第四球-18", "第四球|18").put("第四球-19", "第四球|19").put("第四球-20", "第四球|20")

			.put("第四球-单", "第四球|单").put("第四球-双", "第四球|双").put("第四球-大", "第四球|大").put("第四球-小", "第四球|小")
			.put("第四球-合单", "第四球|合单").put("第四球-合双", "第四球|合双").put("第四球-尾大", "第四球|尾大").put("第四球-尾小", "第四球|尾小")
			.put("第四球-东", "第四球|东").put("第四球-南", "第四球|南").put("第四球-西", "第四球|西").put("第四球-北", "第四球|北")
			.put("第四球-中", "第四球|中").put("第四球-发", "第四球|发").put("第四球-白", "第四球|白")

			.put("第五球-1", "第五球|1").put("第五球-2", "第五球|2").put("第五球-3", "第五球|3").put("第五球-4", "第五球|4")
			.put("第五球-5", "第五球|5").put("第五球-6", "第五球|6").put("第五球-7", "第五球|7").put("第五球-8", "第五球|8")
			.put("第五球-9", "第五球|9").put("第五球-10", "第五球|10").put("第五球-11", "第五球|11").put("第五球-12", "第五球|12")
			.put("第五球-13", "第五球|13").put("第五球-14", "第五球|14").put("第五球-15", "第五球|15").put("第五球-16", "第五球|16")
			.put("第五球-17", "第五球|17").put("第五球-18", "第五球|18").put("第五球-19", "第五球|19").put("第五球-20", "第五球|20")

			.put("第五球-单", "第五球|单").put("第五球-双", "第五球|双").put("第五球-大", "第五球|大").put("第五球-小", "第五球|小")
			.put("第五球-合单", "第五球|合单").put("第五球-合双", "第五球|合双").put("第五球-尾大", "第五球|尾大").put("第五球-尾小", "第五球|尾小")
			.put("第五球-东", "第五球|东").put("第五球-南", "第五球|南").put("第五球-西", "第五球|西").put("第五球-北", "第五球|北")
			.put("第五球-中", "第五球|中").put("第五球-发", "第五球|发").put("第五球-白", "第五球|白")

			.put("第六球-1", "第六球|1").put("第六球-2", "第六球|2").put("第六球-3", "第六球|3").put("第六球-4", "第六球|4")
			.put("第六球-5", "第六球|5").put("第六球-6", "第六球|6").put("第六球-7", "第六球|7").put("第六球-8", "第六球|8")
			.put("第六球-9", "第六球|9").put("第六球-10", "第六球|10").put("第六球-11", "第六球|11").put("第六球-12", "第六球|12")
			.put("第六球-13", "第六球|13").put("第六球-14", "第六球|14").put("第六球-15", "第六球|15").put("第六球-16", "第六球|16")
			.put("第六球-17", "第六球|17").put("第六球-18", "第六球|18").put("第六球-19", "第六球|19").put("第六球-20", "第六球|20")

			.put("第六球-单", "第六球|单").put("第六球-双", "第六球|双").put("第六球-大", "第六球|大").put("第六球-小", "第六球|小")
			.put("第六球-合单", "第六球|合单").put("第六球-合双", "第六球|合双").put("第六球-尾大", "第六球|尾大").put("第六球-尾小", "第六球|尾小")
			.put("第六球-东", "第六球|东").put("第六球-南", "第六球|南").put("第六球-西", "第六球|西").put("第六球-北", "第六球|北")
			.put("第六球-中", "第六球|中").put("第六球-发", "第六球|发").put("第六球-白", "第六球|白")

			.put("第七球-1", "第七球|1").put("第七球-2", "第七球|2").put("第七球-3", "第七球|3").put("第七球-4", "第七球|4")
			.put("第七球-5", "第七球|5").put("第七球-6", "第七球|6").put("第七球-7", "第七球|7").put("第七球-8", "第七球|8")
			.put("第七球-9", "第七球|9").put("第七球-10", "第七球|10").put("第七球-11", "第七球|11").put("第七球-12", "第七球|12")
			.put("第七球-13", "第七球|13").put("第七球-14", "第七球|14").put("第七球-15", "第七球|15").put("第七球-16", "第七球|16")
			.put("第七球-17", "第七球|17").put("第七球-18", "第七球|18").put("第七球-19", "第七球|19").put("第七球-20", "第七球|20")

			.put("第七球-单", "第七球|单").put("第七球-双", "第七球|双").put("第七球-大", "第七球|大").put("第七球-小", "第七球|小")
			.put("第七球-合单", "第七球|合单").put("第七球-合双", "第七球|合双").put("第七球-尾大", "第七球|尾大").put("第七球-尾小", "第七球|尾小")
			.put("第七球-东", "第七球|东").put("第七球-南", "第七球|南").put("第七球-西", "第七球|西").put("第七球-北", "第七球|北")
			.put("第七球-中", "第七球|中").put("第七球-发", "第七球|发").put("第七球-白", "第七球|白")

			.put("第八球-1", "第八球|1").put("第八球-2", "第八球|2").put("第八球-3", "第八球|3").put("第八球-4", "第八球|4")
			.put("第八球-5", "第八球|5").put("第八球-6", "第八球|6").put("第八球-7", "第八球|7").put("第八球-8", "第八球|8")
			.put("第八球-9", "第八球|9").put("第八球-10", "第八球|10").put("第八球-11", "第八球|11").put("第八球-12", "第八球|12")
			.put("第八球-13", "第八球|13").put("第八球-14", "第八球|14").put("第八球-15", "第八球|15").put("第八球-16", "第八球|16")
			.put("第八球-17", "第八球|17").put("第八球-18", "第八球|18").put("第八球-19", "第八球|19").put("第八球-20", "第八球|20")

			.put("第八球-单", "第八球|单").put("第八球-双", "第八球|双").put("第八球-大", "第八球|大").put("第八球-小", "第八球|小")
			.put("第八球-合单", "第八球|合单").put("第八球-合双", "第八球|合双").put("第八球-尾大", "第八球|尾大").put("第八球-尾小", "第八球|尾小")
			.put("第八球-东", "第八球|东").put("第八球-南", "第八球|南").put("第八球-西", "第八球|西").put("第八球-北", "第八球|北")
			.put("第八球-中", "第八球|中").put("第八球-发", "第八球|发").put("第八球-白", "第八球|白")

			.put("总和大", "总和|大").put("总和小", "总和|小").put("总和单", "总和|单").put("总和双", "总和|双").put("总和尾大", "总和|尾大")
			.put("总和尾小", "总和|尾小").put("虎", "总和|虎").put("龙", "总和|龙").build();


	Map<String, String> BET_LIMIT_CODE = ImmutableMap.<String, String>builder()
			.put("第一球|1", "0").put("第一球|2", "0").put("第一球|3", "0").put("第一球|4", "0").put("第一球|5", "0").put("第一球|6", "0")
			.put("第一球|7", "0").put("第一球|8", "0").put("第一球|9", "0").put("第一球|10", "0").put("第一球|11", "0")
			.put("第一球|12", "0").put("第一球|13", "0").put("第一球|14", "0").put("第一球|15", "0").put("第一球|16", "0")
			.put("第一球|17", "0").put("第一球|18", "0").put("第一球|19", "0").put("第一球|20", "0")

			.put("第一球|单", "1").put("第一球|双", "1").put("第一球|大", "1").put("第一球|小", "1").put("第一球|合单", "1")
			.put("第一球|合双", "1").put("第一球|尾大", "1").put("第一球|尾小", "1").put("第一球|东", "2").put("第一球|南", "2")
			.put("第一球|西", "2").put("第一球|北", "2").put("第一球|中", "3").put("第一球|发", "3").put("第一球|白", "3")

			.put("第二球|1", "0").put("第二球|2", "0").put("第二球|3", "0").put("第二球|4", "0").put("第二球|5", "0").put("第二球|6", "0")
			.put("第二球|7", "0").put("第二球|8", "0").put("第二球|9", "0").put("第二球|10", "0").put("第二球|11", "0")
			.put("第二球|12", "0").put("第二球|13", "0").put("第二球|14", "0").put("第二球|15", "0").put("第二球|16", "0")
			.put("第二球|17", "0").put("第二球|18", "0").put("第二球|19", "0").put("第二球|20", "0")

			.put("第二球|单", "1").put("第二球|双", "1").put("第二球|大", "1").put("第二球|小", "1").put("第二球|合单", "1")
			.put("第二球|合双", "1").put("第二球|尾大", "1").put("第二球|尾小", "1").put("第二球|东", "2").put("第二球|南", "2")
			.put("第二球|西", "2").put("第二球|北", "2").put("第二球|中", "3").put("第二球|发", "3").put("第二球|白", "3")

			.put("第三球|1", "0").put("第三球|2", "0").put("第三球|3", "0").put("第三球|4", "0").put("第三球|5", "0").put("第三球|6", "0")
			.put("第三球|7", "0").put("第三球|8", "0").put("第三球|9", "0").put("第三球|10", "0").put("第三球|11", "0")
			.put("第三球|12", "0").put("第三球|13", "0").put("第三球|14", "0").put("第三球|15", "0").put("第三球|16", "0")
			.put("第三球|17", "0").put("第三球|18", "0").put("第三球|19", "0").put("第三球|20", "0")

			.put("第三球|单", "1").put("第三球|双", "1").put("第三球|大", "1").put("第三球|小", "1").put("第三球|合单", "1")
			.put("第三球|合双", "1").put("第三球|尾大", "1").put("第三球|尾小", "1").put("第三球|东", "2").put("第三球|南", "2")
			.put("第三球|西", "2").put("第三球|北", "2").put("第三球|中", "3").put("第三球|发", "3").put("第三球|白", "3")

			.put("第四球|1", "0").put("第四球|2", "0").put("第四球|3", "0").put("第四球|4", "0").put("第四球|5", "0").put("第四球|6", "0")
			.put("第四球|7", "0").put("第四球|8", "0").put("第四球|9", "0").put("第四球|10", "0").put("第四球|11", "0")
			.put("第四球|12", "0").put("第四球|13", "0").put("第四球|14", "0").put("第四球|15", "0").put("第四球|16", "0")
			.put("第四球|17", "0").put("第四球|18", "0").put("第四球|19", "0").put("第四球|20", "0")

			.put("第四球|单", "1").put("第四球|双", "1").put("第四球|大", "1").put("第四球|小", "1").put("第四球|合单", "1")
			.put("第四球|合双", "1").put("第四球|尾大", "1").put("第四球|尾小", "1").put("第四球|东", "2").put("第四球|南", "2")
			.put("第四球|西", "2").put("第四球|北", "2").put("第四球|中", "3").put("第四球|发", "3").put("第四球|白", "3")

			.put("第五球|1", "0").put("第五球|2", "0").put("第五球|3", "0").put("第五球|4", "0").put("第五球|5", "0").put("第五球|6", "0")
			.put("第五球|7", "0").put("第五球|8", "0").put("第五球|9", "0").put("第五球|10", "0").put("第五球|11", "0")
			.put("第五球|12", "0").put("第五球|13", "0").put("第五球|14", "0").put("第五球|15", "0").put("第五球|16", "0")
			.put("第五球|17", "0").put("第五球|18", "0").put("第五球|19", "0").put("第五球|20", "0")

			.put("第五球|单", "1").put("第五球|双", "1").put("第五球|大", "1").put("第五球|小", "1").put("第五球|合单", "4")
			.put("第五球|合双", "1").put("第五球|尾大", "1").put("第五球|尾小", "1").put("第五球|东", "2").put("第五球|南", "2")
			.put("第五球|西", "2").put("第五球|北", "2").put("第五球|中", "3").put("第五球|发", "3").put("第五球|白", "3")

			.put("第六球|1", "0").put("第六球|2", "0").put("第六球|3", "0").put("第六球|4", "0").put("第六球|5", "0").put("第六球|6", "0")
			.put("第六球|7", "0").put("第六球|8", "0").put("第六球|9", "0").put("第六球|10", "0").put("第六球|11", "0")
			.put("第六球|12", "0").put("第六球|13", "0").put("第六球|14", "0").put("第六球|15", "0").put("第六球|16", "0")
			.put("第六球|17", "0").put("第六球|18", "0").put("第六球|19", "0").put("第六球|20", "0")

			.put("第六球|单", "1").put("第六球|双", "1").put("第六球|大", "1").put("第六球|小", "1").put("第六球|合单", "1")
			.put("第六球|合双", "1").put("第六球|尾大", "1").put("第六球|尾小", "1").put("第六球|东", "2").put("第六球|南", "2")
			.put("第六球|西", "2").put("第六球|北", "2").put("第六球|中", "3").put("第六球|发", "3").put("第六球|白", "3")

			.put("第七球|1", "0").put("第七球|2", "0").put("第七球|3", "0").put("第七球|4", "0").put("第七球|5", "0").put("第七球|6", "0")
			.put("第七球|7", "0").put("第七球|8", "0").put("第七球|9", "0").put("第七球|10", "0").put("第七球|11", "0")
			.put("第七球|12", "0").put("第七球|13", "0").put("第七球|14", "0").put("第七球|15", "0").put("第七球|16", "0")
			.put("第七球|17", "0").put("第七球|18", "0").put("第七球|19", "0").put("第七球|20", "0")

			.put("第七球|单", "1").put("第七球|双", "1").put("第七球|大", "1").put("第七球|小", "1").put("第七球|合单", "1")
			.put("第七球|合双", "1").put("第七球|尾大", "1").put("第七球|尾小", "1").put("第七球|东", "2").put("第七球|南", "2")
			.put("第七球|西", "2").put("第七球|北", "2").put("第七球|中", "3").put("第七球|发", "3").put("第七球|白", "3")

			.put("第八球|1", "0").put("第八球|2", "0").put("第八球|3", "0").put("第八球|4", "0").put("第八球|5", "0").put("第八球|6", "0")
			.put("第八球|7", "0").put("第八球|8", "0").put("第八球|9", "0").put("第八球|10", "0").put("第八球|11", "0")
			.put("第八球|12", "0").put("第八球|13", "0").put("第八球|14", "0").put("第八球|15", "0").put("第八球|16", "0")
			.put("第八球|17", "0").put("第八球|18", "0").put("第八球|19", "0").put("第八球|20", "0")

			.put("第八球|单", "1").put("第八球|双", "1").put("第八球|大", "1").put("第八球|小", "1").put("第八球|合单", "1")
			.put("第八球|合双", "1").put("第八球|尾大", "1").put("第八球|尾小", "1").put("第八球|东", "2").put("第八球|南", "2")
			.put("第八球|西", "2").put("第八球|北", "2").put("第八球|中", "3").put("第八球|发", "3").put("第八球|白", "3")

			.put("总和|大", "10").put("总和|小", "10").put("总和|单", "11").put("总和|双", "11").put("总和|尾大", "12").put("总和|尾小", "12")
			.put("总和|龙", "10").put("总和|虎", "10").build();

}
