package com.ibm.common.utils.handicap.config;

import com.google.common.collect.ImmutableMap;

import java.util.Map;

/**
 * @Description:
 * @Author: wwj
 * @Date: 2019/12/27 16:08
 * @Email: 97085010@qq.com
 * @Version: v1.0
 */
public interface NewMoaNumberConfig {


	/**
	 * 所有球码code
	 */
	Map<String, String> BALL_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "B1-1")
			.put("第一名|2", "B1-2").put("第一名|3", "B1-3").put("第一名|4", "B1-4").put("第一名|5", "B1-5")
			.put("第一名|6", "B1-6").put("第一名|7", "B1-7").put("第一名|8", "B1-8").put("第一名|9", "B1-9")
			.put("第一名|10", "B1-10").put("第一名|大", "DX-11").put("第一名|小", "DX-10").put("第一名|单", "DS-11")
			.put("第一名|双", "DS-12").put("第一名|龙", "LH-1L").put("第一名|虎", "LH-1H")

			.put("第二名|1", "B2-1").put("第二名|2", "B2-2").put("第二名|3", "B2-3").put("第二名|4", "B2-4")
			.put("第二名|5", "B2-5").put("第二名|6", "B2-6").put("第二名|7", "B2-7").put("第二名|8", "B2-8")
			.put("第二名|9", "B2-9").put("第二名|10", "B2-10").put("第二名|大", "DX-21").put("第二名|小", "DX-20")
			.put("第二名|单", "DS-21").put("第二名|双", "DS-22").put("第二名|龙", "LH-2L").put("第二名|虎", "2H")

			.put("第三名|1", "B3-1").put("第三名|2", "B3-2").put("第三名|3", "B3-3").put("第三名|4", "B3-4")
			.put("第三名|5", "B3-5").put("第三名|6", "B3-6").put("第三名|7", "B3-7").put("第三名|8", "B3-8")
			.put("第三名|9", "B3-9").put("第三名|10", "B3-10").put("第三名|大", "DX-31").put("第三名|小", "DX-30")
			.put("第三名|单", "DS-31").put("第三名|双", "DS-32").put("第三名|龙", "LH-3L").put("第三名|虎", "LH-3H")

			.put("第四名|1", "B4-1").put("第四名|2", "B4-2").put("第四名|3", "B4-3").put("第四名|4", "B4-4")
			.put("第四名|5", "B4-5").put("第四名|6", "B4-6").put("第四名|7", "B4-7").put("第四名|8", "B4-8")
			.put("第四名|9", "B4-9").put("第四名|10", "B4-10").put("第四名|大", "DX-41").put("第四名|小", "DX-40")
			.put("第四名|单", "DS-41").put("第四名|双", "DS-42").put("第四名|龙", "LH-4L").put("第四名|虎", "LH-4H")

			.put("第五名|1", "B5-1").put("第五名|2", "B5-2").put("第五名|3", "B5-3").put("第五名|4", "B5-4")
			.put("第五名|5", "B5-5").put("第五名|6", "B5-6").put("第五名|7", "B5-7").put("第五名|8", "B5-8")
			.put("第五名|9", "B5-9").put("第五名|10", "B5-10").put("第五名|大", "DX-51").put("第五名|小", "DX-50")
			.put("第五名|单", "DS-51").put("第五名|双", "DS-52").put("第五名|龙", "LH-5L").put("第五名|虎", "LH-5H")

			.put("第六名|1", "B6-1").put("第六名|2", "B6-2").put("第六名|3", "B6-3").put("第六名|4", "B6-4")
			.put("第六名|5", "B6-5").put("第六名|6", "B6-6").put("第六名|7", "B6-7").put("第六名|8", "B6-8")
			.put("第六名|9", "B6-9").put("第六名|10", "B6-10").put("第六名|大", "DX-61").put("第六名|小", "DX-60")
			.put("第六名|单", "DS-61").put("第六名|双", "DS-62")

			.put("第七名|1", "B7-1").put("第七名|2", "B7-2").put("第七名|3", "B7-3").put("第七名|4", "B7-4")
			.put("第七名|5", "B7-5").put("第七名|6", "B7-6").put("第七名|7", "B7-7").put("第七名|8", "B7-8")
			.put("第七名|9", "B7-9").put("第七名|10", "B7-10").put("第七名|大", "DX-71").put("第七名|小", "DX-70")
			.put("第七名|单", "DS-71").put("第七名|双", "DS-72")

			.put("第八名|1", "B8-1").put("第八名|2", "B8-2").put("第八名|3", "B8-3").put("第八名|4", "B8-4")
			.put("第八名|5", "B8-5").put("第八名|6", "B8-6").put("第八名|7", "B8-7").put("第八名|8", "B8-8")
			.put("第八名|9", "B8-9").put("第八名|10", "B8-10").put("第八名|大", "DX-81").put("第八名|小", "DX-82")
			.put("第八名|单", "DS-81").put("第八名|双", "DS-82")

			.put("第九名|1", "B9-1").put("第九名|2", "B9-2").put("第九名|3", "B9-3").put("第九名|4", "B9-4")
			.put("第九名|5", "B9-5").put("第九名|6", "B9-6").put("第九名|7", "B9-7").put("第九名|8", "B9-8")
			.put("第九名|9", "B9-9").put("第九名|10", "B9-10").put("第九名|大", "DX-91").put("第九名|小", "DX-90")
			.put("第九名|单", "DS-91").put("第九名|双", "DS-92")

			.put("第十名|1", "B10-1").put("第十名|2", "B10-2").put("第十名|3", "B10-3").put("第十名|4", "B10-4")
			.put("第十名|5", "B10-5").put("第十名|6", "B10-6").put("第十名|7", "B10-7").put("第十名|8", "B10-8")
			.put("第十名|9", "B10-9").put("第十名|10", "B10-10").put("第十名|大", "DX-01").put("第十名|小", "DX-00")
			.put("第十名|单", "DS-01").put("第十名|双", "DS-02")

			.put("冠亚|3", "H12-3").put("冠亚|4", "H12-4").put("冠亚|5", "H12-5").put("冠亚|6", "H12-6").put("冠亚|7", "H12-7")
			.put("冠亚|8", "H12-8").put("冠亚|9", "H12-9").put("冠亚|10", "H12-10").put("冠亚|11", "H12-11").put("冠亚|12", "H12-12")
			.put("冠亚|13", "H12-13").put("冠亚|14", "H12-14").put("冠亚|15", "H12-15").put("冠亚|16", "H12-16")
			.put("冠亚|17", "H12-17").put("冠亚|18", "H12-18").put("冠亚|19", "H12-19").put("冠亚|大", "HDX-1").put("冠亚|小", "HDX-0")
			.put("冠亚|单", "HDS-1").put("冠亚|双", "HDS-2").build();

	/**
	 * 投注信息
	 */
	Map<String, String> BET_INFO_CODE = ImmutableMap.<String, String>builder().put("冠軍-1", "第一名|1").put("冠軍-2", "第一名|2")
			.put("冠軍-3", "第一名|3").put("冠軍-4", "第一名|4").put("冠軍-5", "第一名|5").put("冠軍-6", "第一名|6").put("冠軍-7", "第一名|7")
			.put("冠軍-8", "第一名|8").put("冠軍-9", "第一名|9").put("冠軍-10", "第一名|10").put("冠軍-虎", "第一名|虎").put("冠軍-龍", "第一名|龙")
			.put("冠軍-單", "第一名|单").put("冠軍-雙", "第一名|双").put("冠軍-大", "第一名|大").put("冠軍-小", "第一名|小")

			.put("亞軍-1", "第二名|1").put("亞軍-2", "第二名|2").put("亞軍-3", "第二名|3").put("亞軍-4", "第二名|4").put("亞軍-5", "第二名|5")
			.put("亞軍-6", "第二名|6").put("亞軍-7", "第二名|7").put("亞軍-8", "第二名|8").put("亞軍-9", "第二名|9").put("亞軍-10", "第二名|10")
			.put("亞軍-虎", "第二名|虎").put("亞軍-龍", "第二名|龙").put("亞軍-單", "第二名|单").put("亞軍-雙", "第二名|双").put("亞軍-大", "第二名|大")
			.put("亞軍-小", "第二名|小")

			.put("第三名-1", "第三名|1").put("第三名-2", "第三名|2").put("第三名-3", "第三名|3").put("第三名-4", "第三名|4").put("第三名-5", "第三名|5")
			.put("第三名-6", "第三名|6").put("第三名-7", "第三名|7").put("第三名-8", "第三名|8").put("第三名-9", "第三名|9").put("第三名-10", "第三名|10")
			.put("第三名-虎", "第三名|虎").put("第三名-龍", "第三名|龙").put("第三名-單", "第三名|单").put("第三名-雙", "第三名|双").put("第三名-大", "第三名|大")
			.put("第三名-小", "第三名|小")

			.put("第四名-1", "第四名|1").put("第四名-2", "第四名|2").put("第四名-3", "第四名|3").put("第四名-4", "第四名|4").put("第四名-5", "第四名|5")
			.put("第四名-6", "第四名|6").put("第四名-7", "第四名|7").put("第四名-8", "第四名|8").put("第四名-9", "第四名|9").put("第四名-10", "第四名|10")
			.put("第四名-虎", "第四名|虎").put("第四名-龍", "第四名|龙").put("第四名-單", "第四名|单").put("第四名-雙", "第四名|双").put("第四名-大", "第四名|大")
			.put("第四名-小", "第四名|小")

			.put("第五名-1", "第五名|1").put("第五名-2", "第五名|2").put("第五名-3", "第五名|3").put("第五名-4", "第五名|4").put("第五名-5", "第五名|5")
			.put("第五名-6", "第五名|6").put("第五名-7", "第五名|7").put("第五名-8", "第五名|8").put("第五名-9", "第五名|9").put("第五名-10", "第五名|10")
			.put("第五名-虎", "第五名|虎").put("第五名-龍", "第五名|龙").put("第五名-單", "第五名|单").put("第五名-雙", "第五名|双").put("第五名-大", "第五名|大")
			.put("第五名-小", "第五名|小")

			.put("第六名-1", "第六名|1").put("第六名-2", "第六名|2").put("第六名-3", "第六名|3").put("第六名-4", "第六名|4").put("第六名-5", "第六名|5")
			.put("第六名-6", "第六名|6").put("第六名-7", "第六名|7").put("第六名-8", "第六名|8").put("第六名-9", "第六名|9").put("第六名-10", "第六名|10")
			.put("第六名-單", "第六名|单").put("第六名-雙", "第六名|双").put("第六名-大", "第六名|大").put("第六名-小", "第六名|小")

			.put("第七名-1", "第七名|1").put("第七名-2", "第七名|2").put("第七名-3", "第七名|3").put("第七名-4", "第七名|4").put("第七名-5", "第七名|5")
			.put("第七名-6", "第七名|6").put("第七名-7", "第七名|7").put("第七名-8", "第七名|8").put("第七名-9", "第七名|9").put("第七名-10", "第七名|10")
			.put("第七名-單", "第七名|单").put("第七名-雙", "第七名|双").put("第七名-大", "第七名|大").put("第七名-小", "第七名|小")

			.put("第八名-1", "第八名|1").put("第八名-2", "第八名|2").put("第八名-3", "第八名|3").put("第八名-4", "第八名|4").put("第八名-5", "第八名|5")
			.put("第八名-6", "第八名|6").put("第八名-7", "第八名|7").put("第八名-8", "第八名|8").put("第八名-9", "第八名|9").put("第八名-10", "第八名|10")
			.put("第八名-單", "第八名|单").put("第八名-雙", "第八名|双").put("第八名-大", "第八名|大").put("第八名-小", "第八名|小")

			.put("第九名-1", "第九名|1").put("第九名-2", "第九名|2").put("第九名-3", "第九名|3").put("第九名-4", "第九名|4").put("第九名-5", "第九名|5")
			.put("第九名-6", "第九名|6").put("第九名-7", "第九名|7").put("第九名-8", "第九名|8").put("第九名-9", "第九名|9").put("第九名-10", "第九名|10")
			.put("第九名-單", "第九名|单").put("第九名-雙", "第九名|双").put("第九名-大", "第九名|大").put("第九名-小", "第九名|小")

			.put("第十名-1", "第十名|1").put("第十名-2", "第十名|2").put("第十名-3", "第十名|3").put("第十名-4", "第十名|4").put("第十名-5", "第十名|5")
			.put("第十名-6", "第十名|6").put("第十名-7", "第十名|7").put("第十名-8", "第十名|8").put("第十名-9", "第十名|9").put("第十名-10", "第十名|10")
			.put("第十名-單", "第十名|单").put("第十名-雙", "第十名|双").put("第十名-大", "第十名|大").put("第十名-小", "第十名|小")

			.put("冠亞-3", "冠亚|3").put("冠亞-4", "冠亚|4").put("冠亞-5", "冠亚|5").put("冠亞-6", "冠亚|6").put("冠亞-7", "冠亚|7")
			.put("冠亞-8", "冠亚|8").put("冠亞-9", "冠亚|9").put("冠亞-10", "冠亚|10").put("冠亞-11", "冠亚|11")
			.put("冠亞-12", "冠亚|12").put("冠亞-13", "冠亚|13").put("冠亞-14", "冠亚|14").put("冠亞-15", "冠亚|15")
			.put("冠亞-16", "冠亚|16").put("冠亞-17", "冠亚|17").put("冠亞-18", "冠亚|18").put("冠亞-19", "冠亚|19")
			.put("冠亞-單", "冠亚|单").put("冠亞-雙", "冠亚|双").put("冠亞-大", "冠亚|大").put("冠亞-小", "冠亚|小").build();


	/**
	 * 投注限制
	 */
	Map<String, String> BET_LIMIT_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "00").put("第一名|2", "02")
			.put("第一名|3", "02").put("第一名|4", "02").put("第一名|5", "02").put("第一名|6", "02").put("第一名|7", "02")
			.put("第一名|8", "02").put("第一名|9", "02").put("第一名|10", "02").put("第一名|大", "01").put("第一名|小", "01")
			.put("第一名|单", "01").put("第一名|双", "01").put("第一名|龙", "01").put("第一名|虎", "01")

			.put("第二名|1", "02").put("第二名|2", "02").put("第二名|3", "02").put("第二名|4", "02").put("第二名|5", "02")
			.put("第二名|6", "02").put("第二名|7", "02").put("第二名|8", "02").put("第二名|9", "02").put("第二名|10", "02")
			.put("第二名|大", "01").put("第二名|小", "01").put("第二名|单", "01").put("第二名|双", "01").put("第二名|龙", "01")
			.put("第二名|虎", "01")

			.put("第三名|1", "02").put("第三名|2", "02").put("第三名|3", "02").put("第三名|4", "02").put("第三名|5", "02")
			.put("第三名|6", "02").put("第三名|7", "02").put("第三名|8", "02").put("第三名|9", "02").put("第三名|10", "02")
			.put("第三名|大", "01").put("第三名|小", "01").put("第三名|单", "01").put("第三名|双", "01").put("第三名|龙", "01")
			.put("第三名|虎", "01")

			.put("第四名|1", "02").put("第四名|2", "02").put("第四名|3", "02").put("第四名|4", "02").put("第四名|5", "02")
			.put("第四名|6", "02").put("第四名|7", "02").put("第四名|8", "02").put("第四名|9", "02").put("第四名|10", "02")
			.put("第四名|大", "01").put("第四名|小", "01").put("第四名|单", "01").put("第四名|双", "01").put("第四名|龙", "01")
			.put("第四名|虎", "01")

			.put("第五名|1", "02").put("第五名|2", "02").put("第五名|3", "02").put("第五名|4", "02").put("第五名|5", "02")
			.put("第五名|6", "02").put("第五名|7", "02").put("第五名|8", "02").put("第五名|9", "02").put("第五名|10", "02")
			.put("第五名|大", "01").put("第五名|小", "01").put("第五名|单", "01").put("第五名|双", "01").put("第五名|龙", "01")
			.put("第五名|虎", "01")

			.put("第六名|1", "02").put("第六名|2", "02").put("第六名|3", "02").put("第六名|4", "02").put("第六名|5", "02")
			.put("第六名|6", "02").put("第六名|7", "02").put("第六名|8", "02").put("第六名|9", "02").put("第六名|10", "02")
			.put("第六名|大", "01").put("第六名|小", "01").put("第六名|单", "01").put("第六名|双", "01")

			.put("第七名|1", "02").put("第七名|2", "02").put("第七名|3", "02").put("第七名|4", "02").put("第七名|5", "02")
			.put("第七名|6", "02").put("第七名|7", "02").put("第七名|8", "02").put("第七名|9", "02").put("第七名|10", "02")
			.put("第七名|大", "01").put("第七名|小", "01").put("第七名|单", "01").put("第七名|双", "01")

			.put("第八名|1", "02").put("第八名|2", "02").put("第八名|3", "02").put("第八名|4", "02").put("第八名|5", "02")
			.put("第八名|6", "02").put("第八名|7", "02").put("第八名|8", "02").put("第八名|9", "02").put("第八名|10", "02")
			.put("第八名|大", "01").put("第八名|小", "01").put("第八名|单", "01").put("第八名|双", "01")

			.put("第九名|1", "02").put("第九名|2", "02").put("第九名|3", "02").put("第九名|4", "02").put("第九名|5", "02")
			.put("第九名|6", "02").put("第九名|7", "02").put("第九名|8", "02").put("第九名|9", "02").put("第九名|10", "02")
			.put("第九名|大", "01").put("第九名|小", "01").put("第九名|单", "01").put("第九名|双", "01")

			.put("第十名|1", "02").put("第十名|2", "02").put("第十名|3", "02").put("第十名|4", "02").put("第十名|5", "02")
			.put("第十名|6", "02").put("第十名|7", "02").put("第十名|8", "02").put("第十名|9", "02").put("第十名|10", "02")
			.put("第十名|大", "01").put("第十名|小", "01").put("第十名|单", "01").put("第十名|双", "01")

			.put("冠亚|3", "00").put("冠亚|4", "00").put("冠亚|5", "00").put("冠亚|6", "00").put("冠亚|7", "00").put("冠亚|8", "00")
			.put("冠亚|9", "00").put("冠亚|10", "00").put("冠亚|11", "00").put("冠亚|12", "00").put("冠亚|13", "00")
			.put("冠亚|14", "00").put("冠亚|15", "00").put("冠亚|16", "00").put("冠亚|17", "00").put("冠亚|18", "00")
			.put("冠亚|19", "00").put("冠亚|大", "06").put("冠亚|小", "06").put("冠亚|单", "10").put("冠亚|双", "10").build();

}
