package com.ibm.common.utils.handicap.config;

import com.google.common.collect.ImmutableMap;
import com.ibm.common.core.configs.Ncom2Config;

import java.util.Map;

/**
 * @Description:
 * @Author: wwj
 * @Date: 2019/12/30 11:27
 * @Email: 97085010@qq.com
 * @Version: v1.0
 */
public interface NewMoaBallConfig extends Ncom2Config {

    Map<String,String> GAME_ODDS_ID = ImmutableMap.<String, String>builder().put("ballNO","1,4,7,10,13").
            put("dobleSides","2,3,5,6,8,9,11,12,14,15,16,17,18").put("threeBall","1,2,3,16,17,18,19,20,21").build();

    /**
     * 游戏code
     */
    Map<String, String> BALL_CODE = ImmutableMap.<String, String>builder().put("第一球|0", "B1-1").put("第一球|1", "B1-2")
            .put("第一球|2", "B1-3").put("第一球|3", "B1-4").put("第一球|4", "B1-5").put("第一球|5", "B1-6")
            .put("第一球|6", "B1-7").put("第一球|7", "B1-8").put("第一球|8", "B1-9").put("第一球|9", "B1-10")
            .put("第一球|大", "DX-11").put("第一球|小", "DX-10").put("第一球|单", "DS-11").put("第一球|双", "DS-12")

            .put("第二球|0", "B2-0").put("第二球|1", "B2-1").put("第二球|2", "B2-2").put("第二球|3", "B2-3")
            .put("第二球|4", "B2-4").put("第二球|5", "B2-5").put("第二球|6", "B2-6").put("第二球|7", "B2-7")
            .put("第二球|8", "B2-8").put("第二球|9", "B2-9").put("第二球|大", "DX-21").put("第二球|小", "DX-20")
            .put("第二球|单", "DS-21").put("第二球|双", "DS-22")

            .put("第三球|0", "B3-0").put("第三球|1", "B3-1").put("第三球|2", "B3-2").put("第三球|3", "B3-3")
            .put("第三球|4", "B3-4").put("第三球|5", "B3-5").put("第三球|6", "B3-6").put("第三球|7", "B3-7")
            .put("第三球|8", "B3-8").put("第三球|9", "B3-9").put("第三球|大", "DX-31").put("第三球|小", "DX-30")
            .put("第三球|单", "DS-31").put("第三球|双", "DS-32")

            .put("第四球|0", "B4-0").put("第四球|1", "B4-1").put("第四球|2", "B4-2").put("第四球|3", "B4-3")
            .put("第四球|4", "B4-4").put("第四球|5", "B4-5").put("第四球|6", "B4-6").put("第四球|7", "B4-7")
            .put("第四球|8", "B4-8").put("第四球|9", "B4-9").put("第四球|大", "DX-41").put("第四球|小", "DX-40")
            .put("第四球|单", "DS-41").put("第四球|双", "DS-42")

            .put("第五球|0", "B5-0").put("第五球|1", "B5-1").put("第五球|2", "B5-2").put("第五球|3", "B5-3")
            .put("第五球|4", "B5-4").put("第五球|5", "B5-5").put("第五球|6", "B5-6").put("第五球|7", "B5-7")
            .put("第五球|8", "B5-8").put("第五球|9", "B5-9").put("第五球|大", "DX-51").put("第五球|小", "DX-50")
            .put("第五球|单", "DS-51").put("第五球|双", "DS-52")

            .put("总和|大", "ZDX-1").put("总和|小", "ZDX-0").put("总和|单", "ZDS-1").put("总和|双", "ZDS-2")
            .put("龙虎和|龙", "LHH-L").put("龙虎和|虎", "LHH-H").put("龙虎和|和", "LHH-0")
            .put("前三|豹子", "Q3-BZ").put("前三|顺子", "Q3-SZ").put("前三|对子", "Q3-DZ").put("前三|半顺", "Q3-BS").put("前三|杂六", "Q3-Z6")
            .put("中三|豹子", "Z3-BZ").put("中三|顺子", "Z3-SZ").put("中三|对子", "Z3-DZ").put("中三|半顺", "Z3-BS").put("中三|杂六", "Z3-Z6")
            .put("后三|豹子", "H3-BZ").put("后三|顺子", "H3-SZ").put("后三|对子", "H3-DZ").put("后三|半顺", "H3-BS").put("后三|杂六", "H3-Z6")
            .build();

    /**
     * 投注信息
     */
    Map<String, String> BET_INFO_CODE = ImmutableMap.<String, String>builder().put("第一球-0", "第一球|0").put("第一球-1", "第一球|1")
            .put("第一球-2", "第一球|2").put("第一球-3", "第一球|3").put("第一球-4", "第一球|4").put("第一球-5", "第一球|5")
            .put("第一球-6", "第一球|6").put("第一球-7", "第一球|7").put("第一球-8", "第一球|8").put("第一球-9", "第一球|9")
            .put("第一球-單", "第一球|单").put("第一球-雙", "第一球|双").put("第一球-大", "第一球|大").put("第一球-小", "第一球|小")

            .put("第二球-0", "第二球|0").put("第二球-1", "第二球|1").put("第二球-2", "第二球|2").put("第二球-3", "第二球|3")
            .put("第二球-4", "第二球|4").put("第二球-5", "第二球|5").put("第二球-6", "第二球|6").put("第二球-7", "第二球|7")
            .put("第二球-8", "第二球|8").put("第二球-9", "第二球|9").put("第二球-單", "第二球|单").put("第二球-雙", "第二球|双")
            .put("第二球-大", "第二球|大").put("第二球-小", "第二球|小")

            .put("第三球-0", "第三球|0").put("第三球-1", "第三球|1").put("第三球-2", "第三球|2").put("第三球-3", "第三球|3")
            .put("第三球-4", "第三球|4").put("第三球-5", "第三球|5").put("第三球-6", "第三球|6").put("第三球-7", "第三球|7")
            .put("第三球-8", "第三球|8").put("第三球-9", "第三球|9").put("第三球-單", "第三球|单").put("第三球-雙", "第三球|双")
            .put("第三球-大", "第三球|大").put("第三球-小", "第三球|小")

            .put("第四球-0", "第四球|0").put("第四球-1", "第四球|1").put("第四球-2", "第四球|2").put("第四球-3", "第四球|3")
            .put("第四球-4", "第四球|4").put("第四球-5", "第四球|5").put("第四球-6", "第四球|6").put("第四球-7", "第四球|7")
            .put("第四球-8", "第四球|8").put("第四球-9", "第四球|9").put("第四球-單", "第四球|单").put("第四球-雙", "第四球|双")
            .put("第四球-大", "第四球|大").put("第四球-小", "第四球|小")

            .put("第五球-0", "第五球|0").put("第五球-1", "第五球|1").put("第五球-2", "第五球|2").put("第五球-3", "第五球|3")
            .put("第五球-4", "第五球|4").put("第五球-5", "第五球|5").put("第五球-6", "第五球|6").put("第五球-7", "第五球|7")
            .put("第五球-8", "第五球|8").put("第五球-9", "第五球|9").put("第五球-單", "第五球|单").put("第五球-雙", "第五球|双")
            .put("第五球-大", "第五球|大").put("第五球-小", "第五球|小")

            .put("總和大", "总和|大").put("總和小", "总和|小").put("總和單", "总和|单").put("總和雙", "总和|双")
            .put("龍", "龙虎和|龙").put("虎", "龙虎和|虎").put("和", "龙虎和|和")
            .put("前三-豹子", "前三|豹子").put("中三-豹子", "中三|豹子").put("后三-豹子", "后三|豹子")
            .put("前三-順子", "前三|顺子").put("中三-順子", "中三|顺子").put("后三-順子", "后三|顺子")
            .put("前三-對子", "前三|对子").put("中三-對子", "中三|对子").put("后三-對子", "后三|对子")
            .put("前三-半順", "前三|半顺").put("中三-半順", "中三|半顺").put("后三-半順", "后三|半顺")
            .put("前三-雜六", "前三|杂六").put("中三-雜六", "中三|杂六").put("后三-雜六", "后三|杂六").build();

    /**
     * 限额信息
     */
    Map<String, String> BET_LIMIT_CODE = ImmutableMap.<String, String>builder().put("第一球|0", "07").put("第一球|1", "07")
            .put("第一球|2", "07").put("第一球|3", "07").put("第一球|4", "07").put("第一球|5", "07").put("第一球|6", "07")
            .put("第一球|7", "07").put("第一球|8", "07").put("第一球|9", "07").put("第一球|大", "06").put("第一球|小", "06")
            .put("第一球|单", "06").put("第一球|双", "06")

            .put("第二球|0", "07").put("第二球|1", "07").put("第二球|2", "07").put("第二球|3", "07").put("第二球|4", "07")
            .put("第二球|5", "07").put("第二球|6", "07").put("第二球|7", "07").put("第二球|8", "07").put("第二球|9", "07")
            .put("第二球|大", "06").put("第二球|小", "06").put("第二球|单", "06").put("第二球|双", "06")

            .put("第三球|0", "07").put("第三球|1", "07").put("第三球|2", "07").put("第三球|3", "07").put("第三球|4", "07")
            .put("第三球|5", "07").put("第三球|6", "07").put("第三球|7", "07").put("第三球|8", "07").put("第三球|9", "07")
            .put("第三球|大", "06").put("第三球|小", "06").put("第三球|单", "02").put("第三球|双", "02")

            .put("第四球|0", "07").put("第四球|1", "07").put("第四球|2", "07").put("第四球|3", "07").put("第四球|4", "07")
            .put("第四球|5", "07").put("第四球|6", "07").put("第四球|7", "07").put("第四球|8", "07").put("第四球|9", "07")
            .put("第四球|大", "06").put("第四球|小", "06").put("第四球|单", "06").put("第四球|双", "06")

            .put("第五球|0", "07").put("第五球|1", "07").put("第五球|2", "07").put("第五球|3", "07").put("第五球|4", "07")
            .put("第五球|5", "07").put("第五球|6", "07").put("第五球|7", "07").put("第五球|8", "07").put("第五球|9", "07")
            .put("第五球|大", "06").put("第五球|小", "06").put("第五球|单", "06").put("第五球|双", "06")

            .put("总和|大", "03").put("总和|小", "03").put("总和|单", "05").put("总和|双", "05")
            .put("龙虎和|龙", "01").put("龙虎和|虎", "01").put("龙虎和|和", "02")
            .put("前三|豹子", "04").put("中三|豹子", "00").put("后三|豹子", "02")
            .put("前三|顺子", "04").put("中三|顺子", "07").put("后三|顺子", "02")
            .put("前三|对子", "04").put("中三|对子", "00").put("后三|对子", "02")
            .put("前三|半顺", "04").put("中三|半顺", "00").put("后三|半顺", "02")
            .put("前三|杂六", "04").put("中三|杂六", "00").put("后三|杂六", "02").build();

}
