package com.ibm.common.utils.handicap.config;

import com.google.common.collect.ImmutableMap;

import java.util.Map;

/**
 * @Description:
 * @Author: wwj
 * @Date: 2019/12/27 16:08
 * @Email: 97085010@qq.com
 * @Version: v1.0
 */
public interface NewWsNumberConfig {


    /**
     * 投注信息
     */
    Map<String, String> BET_INFO_CODE = ImmutableMap.<String, String>builder().put("冠軍-1", "第一名|1").put("冠軍-2", "第一名|2")
            .put("冠軍-3", "第一名|3").put("冠軍-4", "第一名|4").put("冠軍-5", "第一名|5").put("冠軍-6", "第一名|6").put("冠軍-7", "第一名|7")
            .put("冠軍-8", "第一名|8").put("冠軍-9", "第一名|9").put("冠軍-10", "第一名|10").put("冠軍-虎", "第一名|虎").put("冠軍-龍", "第一名|龙")
            .put("冠軍-單", "第一名|单").put("冠軍-雙", "第一名|双").put("冠軍-大", "第一名|大").put("冠軍-小", "第一名|小")

            .put("亞軍-1", "第二名|1").put("亞軍-2", "第二名|2").put("亞軍-3", "第二名|3").put("亞軍-4", "第二名|4").put("亞軍-5", "第二名|5")
            .put("亞軍-6", "第二名|6").put("亞軍-7", "第二名|7").put("亞軍-8", "第二名|8").put("亞軍-9", "第二名|9").put("亞軍-10", "第二名|10")
            .put("亞軍-虎", "第二名|虎").put("亞軍-龍", "第二名|龙").put("亞軍-單", "第二名|单").put("亞軍-雙", "第二名|双").put("亞軍-大", "第二名|大")
            .put("亞軍-小", "第二名|小")

            .put("第三名-1", "第三名|1").put("第三名-2", "第三名|2").put("第三名-3", "第三名|3").put("第三名-4", "第三名|4").put("第三名-5", "第三名|5")
            .put("第三名-6", "第三名|6").put("第三名-7", "第三名|7").put("第三名-8", "第三名|8").put("第三名-9", "第三名|9").put("第三名-10", "第三名|10")
            .put("第三名-虎", "第三名|虎").put("第三名-龍", "第三名|龙").put("第三名-單", "第三名|单").put("第三名-雙", "第三名|双").put("第三名-大", "第三名|大")
            .put("第三名-小", "第三名|小")

            .put("第四名-1", "第四名|1").put("第四名-2", "第四名|2").put("第四名-3", "第四名|3").put("第四名-4", "第四名|4").put("第四名-5", "第四名|5")
            .put("第四名-6", "第四名|6").put("第四名-7", "第四名|7").put("第四名-8", "第四名|8").put("第四名-9", "第四名|9").put("第四名-10", "第四名|10")
            .put("第四名-虎", "第四名|虎").put("第四名-龍", "第四名|龙").put("第四名-單", "第四名|单").put("第四名-雙", "第四名|双").put("第四名-大", "第四名|大")
            .put("第四名-小", "第四名|小")

            .put("第五名-1", "第五名|1").put("第五名-2", "第五名|2").put("第五名-3", "第五名|3").put("第五名-4", "第五名|4").put("第五名-5", "第五名|5")
            .put("第五名-6", "第五名|6").put("第五名-7", "第五名|7").put("第五名-8", "第五名|8").put("第五名-9", "第五名|9").put("第五名-10", "第五名|10")
            .put("第五名-虎", "第五名|虎").put("第五名-龍", "第五名|龙").put("第五名-單", "第五名|单").put("第五名-雙", "第五名|双").put("第五名-大", "第五名|大")
            .put("第五名-小", "第五名|小")

            .put("第六名-1", "第六名|1").put("第六名-2", "第六名|2").put("第六名-3", "第六名|3").put("第六名-4", "第六名|4").put("第六名-5", "第六名|5")
            .put("第六名-6", "第六名|6").put("第六名-7", "第六名|7").put("第六名-8", "第六名|8").put("第六名-9", "第六名|9").put("第六名-10", "第六名|10")
            .put("第六名-單", "第六名|单").put("第六名-雙", "第六名|双").put("第六名-大", "第六名|大").put("第六名-小", "第六名|小")

            .put("第七名-1", "第七名|1").put("第七名-2", "第七名|2").put("第七名-3", "第七名|3").put("第七名-4", "第七名|4").put("第七名-5", "第七名|5")
            .put("第七名-6", "第七名|6").put("第七名-7", "第七名|7").put("第七名-8", "第七名|8").put("第七名-9", "第七名|9").put("第七名-10", "第七名|10")
            .put("第七名-單", "第七名|单").put("第七名-雙", "第七名|双").put("第七名-大", "第七名|大").put("第七名-小", "第七名|小")

            .put("第八名-1", "第八名|1").put("第八名-2", "第八名|2").put("第八名-3", "第八名|3").put("第八名-4", "第八名|4").put("第八名-5", "第八名|5")
            .put("第八名-6", "第八名|6").put("第八名-7", "第八名|7").put("第八名-8", "第八名|8").put("第八名-9", "第八名|9").put("第八名-10", "第八名|10")
            .put("第八名-單", "第八名|单").put("第八名-雙", "第八名|双").put("第八名-大", "第八名|大").put("第八名-小", "第八名|小")

            .put("第九名-1", "第九名|1").put("第九名-2", "第九名|2").put("第九名-3", "第九名|3").put("第九名-4", "第九名|4").put("第九名-5", "第九名|5")
            .put("第九名-6", "第九名|6").put("第九名-7", "第九名|7").put("第九名-8", "第九名|8").put("第九名-9", "第九名|9").put("第九名-10", "第九名|10")
            .put("第九名-單", "第九名|单").put("第九名-雙", "第九名|双").put("第九名-大", "第九名|大").put("第九名-小", "第九名|小")

            .put("第十名-1", "第十名|1").put("第十名-2", "第十名|2").put("第十名-3", "第十名|3").put("第十名-4", "第十名|4").put("第十名-5", "第十名|5")
            .put("第十名-6", "第十名|6").put("第十名-7", "第十名|7").put("第十名-8", "第十名|8").put("第十名-9", "第十名|9").put("第十名-10", "第十名|10")
            .put("第十名-單", "第十名|单").put("第十名-雙", "第十名|双").put("第十名-大", "第十名|大").put("第十名-小", "第十名|小")

            .put("冠亞-3", "冠亚|3").put("冠亞-4", "冠亚|4").put("冠亞-5", "冠亚|5").put("冠亞-6", "冠亚|6").put("冠亞-7", "冠亚|7")
            .put("冠亞-8", "冠亚|8").put("冠亞-9", "冠亚|9").put("冠亞-10", "冠亚|10").put("冠亞-11", "冠亚|11")
            .put("冠亞-12", "冠亚|12").put("冠亞-13", "冠亚|13").put("冠亞-14", "冠亚|14").put("冠亞-15", "冠亚|15")
            .put("冠亞-16", "冠亚|16").put("冠亞-17", "冠亚|17").put("冠亞-18", "冠亚|18").put("冠亞-19", "冠亚|19")
            .put("冠亞-單", "冠亚|单").put("冠亞-雙", "冠亚|双").put("冠亞-大", "冠亚|大").put("冠亞-小", "冠亚|小").build();



    /**
     * 投注限制
     */
    Map<String, String> BET_LIMIT_CODE = ImmutableMap.<String, String>builder().put("第一名|1", "00").put("第一名|2", "00")
            .put("第一名|3", "00").put("第一名|4", "00").put("第一名|5", "00").put("第一名|6", "00").put("第一名|7", "00")
            .put("第一名|8", "00").put("第一名|9", "00").put("第一名|10", "00").put("第一名|大", "01").put("第一名|小", "01")
            .put("第一名|单", "01").put("第一名|双", "01").put("第一名|龙", "02").put("第一名|虎", "02")

            .put("第二名|1", "00").put("第二名|2", "00").put("第二名|3", "00").put("第二名|4", "00").put("第二名|5", "00")
            .put("第二名|6", "00").put("第二名|7", "00").put("第二名|8", "00").put("第二名|9", "00").put("第二名|10", "00")
            .put("第二名|大", "01").put("第二名|小", "01").put("第二名|单", "01").put("第二名|双", "01").put("第二名|龙", "02")
            .put("第二名|虎", "02")

            .put("第三名|1", "00").put("第三名|2", "00").put("第三名|3", "00").put("第三名|4", "00").put("第三名|5", "00")
            .put("第三名|6", "00").put("第三名|7", "00").put("第三名|8", "00").put("第三名|9", "00").put("第三名|10", "00")
            .put("第三名|大", "01").put("第三名|小", "01").put("第三名|单", "01").put("第三名|双", "01").put("第三名|龙", "02")
            .put("第三名|虎", "02")

            .put("第四名|1", "00").put("第四名|2", "00").put("第四名|3", "00").put("第四名|4", "00").put("第四名|5", "00")
            .put("第四名|6", "00").put("第四名|7", "00").put("第四名|8", "00").put("第四名|9", "00").put("第四名|10", "00")
            .put("第四名|大", "01").put("第四名|小", "01").put("第四名|单", "01").put("第四名|双", "01").put("第四名|龙", "02")
            .put("第四名|虎", "02")

            .put("第五名|1", "00").put("第五名|2", "00").put("第五名|3", "00").put("第五名|4", "00").put("第五名|5", "00")
            .put("第五名|6", "00").put("第五名|7", "00").put("第五名|8", "00").put("第五名|9", "00").put("第五名|10", "00")
            .put("第五名|大", "01").put("第五名|小", "01").put("第五名|单", "01").put("第五名|双", "01").put("第五名|龙", "02")
            .put("第五名|虎", "02")

            .put("第六名|1", "00").put("第六名|2", "00").put("第六名|3", "00").put("第六名|4", "00").put("第六名|5", "00")
            .put("第六名|6", "00").put("第六名|7", "00").put("第六名|8", "00").put("第六名|9", "00").put("第六名|10", "00")
            .put("第六名|大", "01").put("第六名|小", "01").put("第六名|单", "01").put("第六名|双", "01")

            .put("第七名|1", "00").put("第七名|2", "00").put("第七名|3", "00").put("第七名|4", "00").put("第七名|5", "00")
            .put("第七名|6", "00").put("第七名|7", "00").put("第七名|8", "00").put("第七名|9", "00").put("第七名|10", "00")
            .put("第七名|大", "01").put("第七名|小", "01").put("第七名|单", "01").put("第七名|双", "01")

            .put("第八名|1", "00").put("第八名|2", "00").put("第八名|3", "00").put("第八名|4", "00").put("第八名|5", "00")
            .put("第八名|6", "00").put("第八名|7", "00").put("第八名|8", "00").put("第八名|9", "00").put("第八名|10", "00")
            .put("第八名|大", "01").put("第八名|小", "01").put("第八名|单", "01").put("第八名|双", "01")

            .put("第九名|1", "00").put("第九名|2", "00").put("第九名|3", "00").put("第九名|4", "00").put("第九名|5", "00")
            .put("第九名|6", "00").put("第九名|7", "00").put("第九名|8", "00").put("第九名|9", "00").put("第九名|10", "00")
            .put("第九名|大", "01").put("第九名|小", "01").put("第九名|单", "01").put("第九名|双", "01")

            .put("第十名|1", "00").put("第十名|2", "00").put("第十名|3", "00").put("第十名|4", "00").put("第十名|5", "00")
            .put("第十名|6", "00").put("第十名|7", "00").put("第十名|8", "00").put("第十名|9", "00").put("第十名|10", "00")
            .put("第十名|大", "01").put("第十名|小", "01").put("第十名|单", "01").put("第十名|双", "01")

            .put("冠亚|3", "05").put("冠亚|4", "05").put("冠亚|5", "05").put("冠亚|6", "05").put("冠亚|7", "05").put("冠亚|8", "05")
            .put("冠亚|9", "05").put("冠亚|10", "05").put("冠亚|11", "05").put("冠亚|12", "05").put("冠亚|13", "05")
            .put("冠亚|14", "05").put("冠亚|15", "05").put("冠亚|16", "05").put("冠亚|17", "05").put("冠亚|18", "05")
            .put("冠亚|19", "05").put("冠亚|大", "03").put("冠亚|小", "03").put("冠亚|单", "04").put("冠亚|双", "04").build();

}
