package com.ibm.common.utils.handicap.config;
import com.google.common.collect.ImmutableMap;
import com.ibm.common.core.configs.SgWinConfig;

import java.util.Map;

/**
 * @Description: 球号
 * @Author: null
 * @Date: 2019-10-25 17:36
 * @Version: v1.0
 */
public interface UNBallConfig extends SgWinConfig {


	Map<String, String> BET_LIMIT_CODE = ImmutableMap.<String, String>builder().put("第一球|0", "00").put("第一球|1", "00")
			.put("第一球|2", "00").put("第一球|3", "00").put("第一球|4", "00").put("第一球|5", "00").put("第一球|6", "00")
			.put("第一球|7", "00").put("第一球|8", "00").put("第一球|9", "00").put("第一球|大", "01").put("第一球|小", "01")
			.put("第一球|单", "01").put("第一球|双", "01")

			.put("第二球|0", "00").put("第二球|1", "00").put("第二球|2", "00").put("第二球|3", "00").put("第二球|4", "00")
			.put("第二球|5", "00").put("第二球|6", "00").put("第二球|7", "00").put("第二球|8", "00").put("第二球|9", "00")
			.put("第二球|大", "01").put("第二球|小", "01").put("第二球|单", "01").put("第二球|双", "01")

			.put("第三球|0", "00").put("第三球|1", "00").put("第三球|2", "00").put("第三球|3", "00").put("第三球|4", "00")
			.put("第三球|5", "00").put("第三球|6", "00").put("第三球|7", "00").put("第三球|8", "00").put("第三球|9", "00")
			.put("第三球|大", "01").put("第三球|小", "01").put("第三球|单", "01").put("第三球|双", "01")

			.put("第四球|0", "00").put("第四球|1", "00").put("第四球|2", "00").put("第四球|3", "00").put("第四球|4", "00")
			.put("第四球|5", "00").put("第四球|6", "00").put("第四球|7", "00").put("第四球|8", "00").put("第四球|9", "00")
			.put("第四球|大", "01").put("第四球|小", "01").put("第四球|单", "01").put("第四球|双", "01")

			.put("第五球|0", "00").put("第五球|1", "00").put("第五球|2", "00").put("第五球|3", "00").put("第五球|4", "00")
			.put("第五球|5", "00").put("第五球|6", "00").put("第五球|7", "00").put("第五球|8", "00").put("第五球|9", "00")
			.put("第五球|大", "01").put("第五球|小", "01").put("第五球|单", "01").put("第五球|双", "01")

			.put("总和|大", "04").put("总和|小", "04").put("总和|单", "04").put("总和|双", "04").put("龙虎和|龙", "02")
			.put("龙虎和|虎", "02").put("龙虎和|和", "03").put("前三|豹子", "05").put("中三|豹子", "05").put("后三|豹子", "05")
			.put("前三|顺子", "06").put("中三|顺子", "06").put("后三|顺子", "06").put("前三|对子", "07").put("中三|对子", "07")
			.put("后三|对子", "07").put("前三|半顺", "08").put("中三|半顺", "08").put("后三|半顺", "08").put("前三|杂六", "09")
			.put("中三|杂六", "09").put("后三|杂六", "09").build();

}
